{"abstract": "", "citation": "Journal of Applied Physics", "volume": "116", "pdf_filename": "916209.pdf", "authors": "Christian J. Long; Daniel  Ebeling; Santiago D. Solares; Rachel J. Cannara;", "keywords": "", "pages": "", "dates": "", "pdf_text": "Friction imprint effect in mechanically cleaved BaTiO3 (001) Christian J. Long,1,2 Daniel Ebeling,3,a) Santiago D. Solares,4,a) and Rachel J. Cannara1,b) 1Center for Nanoscale Science and Technology, NIST, Gaithersburg, MD 20899, USA 2Maryland Nanocenter, University of Maryland, College Park, MD 20742, USA 3Institute of Applied Physics, Justus Liebig University of Giessen, 35392 Giessen, Germany 4Department of Mechanical and Aerospace Engineering, George Washington University, Washington, DC 20052, USA Adsorption, chemisorption, and reconstruction at the surfaces of ferroelectric materials can all contribute toward the pinning of ferroelectric polarization, which is called the electrical imprint effect. Here, we show that the opposite is also true: freshly cleaved, atomically-flat surfaces of (001) oriented BaTiO3 exhibit a persistent change in surface chemistry that is driven by ferroelectric polarization. This surface modification is explored using lateral force microscopy (LFM), while the ferroelectric polarization is probed using piezoresponse force microscopy (PFM). We find that immediately after cleaving BaTiO3, LFM reveals friction contrast between ferroelectric domains. We also find that this surface modification remains after the ferroelectric domain distribution is modified, resulting in an imprint of the original ferroelectric domain distribution on the sample surface. This friction imprint effect has implications for surface patterning as well as ferroelectric device operation and failure. a) This research was performed while D. Ebeling and S. D. Solares were at the Department of Mechanical Engineering, University of Maryland, College Park, Maryland 20742, USA b) Author to whom correspondence should be addressed. Electronic mail: rcannara@intven.com. 2 I. INTRODUCTION BaTiO3 (BTO) is perhaps the most well-studied ferroelectric material to date. The uses of BTO span applications including substrates for oxide thin film growth,1,2 positive temperature coefficient resistors,3 non-linear optical devices,4 piezoelectric transducers,5 ferroelectric memory,6 and multiferroic composite devices.7 In many of these applications, understanding the surface layer of BTO is of critical importance. For example, the epitaxial growth of many oxide thin films requires a well-ordered surface, while the positive temperature coefficient of resistance is attributed to surface phases. Unfortunately, most surface preparation techniques, such as polishing, sputtering, and annealing, introduce surface contamination and structural defects, or change the stoichiometry in near-surface layers. These non-idealities can make surface studies difficult to interpret. In this work, we show that atomically-flat terraces of pristine BTO can be obtained by mechanical cleavage. This provides a simple way to obtain ideal, uncontaminated surfaces. Using these pristine surfaces, we then show that when samples are cleaved in air there is a surface modification that depends on the direction of ferroelectric polarization at the time that the sample is cleaved. In the following paragraphs, we begin by introducing the crystal structure of BTO and providing a brief overview of its ferroelectric properties. We then examine the surface of cleaved BTO using a variety of atomic force microscopy (AFM) based techniques. First, we show that the topography within a single-ferroelectric-domain region contains pristine, atomically-flat terraces. Next, we examine regions of the surface that contain a mixture of ferroelectric domains. For these mixed domain regions, we perform a series of cleaving, drying, and heating experiments that are designed to elucidate the role of both water adsorption and ferroelectric 3 polarization on the surface chemistry. In the mixed domain regions, the surface chemistry is probed using lateral force microscopy (LFM) and the ferroelectric domain pattern is probed using piezoresponse force microscopy (PFM). II. STRUCTURE AND FERROELECTRIC POLARIZATION OF BTO At standard temperature and pressure, the structure of BTO is tetragonal (space group P4mm, IUC number 99).8,9 A typical single crystal sample contains a mixture of ferroelastic domains, which correspond to the three possible orientations of the long axis (c axis) of the unit cell. For each ferroelastic domain orientation, there are two possible ferroelectric polarization directions, which correspond to the displacement of the Ti4+ cation from the center of the unit cell along the c axis. In this work, we focus on ferroelastic domains that are oriented perpendicular to the sample surface (c domains). For c domains, the ferroelectric polarization can be oriented either out of the sample plane (c+ domain) or into the plane (c- domain). The ferroelastic distortion (and therefore the ferroelectric polarization) can also lie in-the-plane of the sample (a domain). III. CLEAVAGE AND ATOMIC TERRACES The typical methods used to prepare clean, atomically-flat surfaces on single crystal BTO substrates entail polishing,10 sputtering,11 etching,12 and annealing.11,13 All of these steps modify the structure and surface chemistry of the sample, making it more difficult to draw conclusions about how an ideal BTO surface behaves. Among these techniques, only annealing can yield atomically-flat surfaces. Unfortunately, annealing can also cause reconstruction of the surface and may disturb the stoichiometry in sub-surface layers. In this work, we obtain atomically-flat terraces of (001) BTO by cleaving a chip out of the edge of a single crystal sample. This 4 approach yields the most pristine possible surface of BTO, making it ideal for investigation of its intrinsic surface properties. The single crystal samples of (001) oriented BTO10,14 were cleaved using a pair of tweezers by applying pressure at the edge of the sample in a direction perpendicular to the c axis. Figures 1a and 1b show an example of the kind of chip that typically results from this cleavage method. We note that on some (non-ideal) samples, the edges of the crystal have large a-oriented ferroelastic domains. In this case it is still possible to chip the edge of the sample, but we have not found atomically-flat terraces within those regions, and the chips do not exhibit the clamshell-like structure shown in Fig. 1b. We also find that when there is a mixture of c+ and c- Figure 1 Optical and AFM images of a cleaved chip at the edge of a BTO single crystal. Parts (a) and (b) show optical images of the sample at different magnifications. Part (c) shows an AFM deflection image that illustrates the micro-scale structure within the cleaved area. Parts (d) and (e) show atomic terraces within the region shown in part (c). Part (f) shows a line cut from the image in part (e), highlighting the fact that the step height between terraces corresponds to the height of a single unit cell. The dashed lines in (f) are included as a guide to the eye. 5 domains, and especially when there is a mixture of c and a domains, it is much less likely to find atomically-flat terraces within the chipped region. Therefore, if one is interested in obtaining large atomically-flat terraces, it is critical that the cleaved region is dominated by a single ferroelastic domain with a single (c+ or c-) electrical polarization. For such a sample, we find that it is relatively easy to find single atomic terraces that have an area of at least 20 um2. Example AFM topography images in a region containing a single ferroelectric domain are shown in Figs. 1b, c, and d. The terraces are typically elongated along the direction of cleavage crack propagation (from the bottom to the top of the image in Figs. 1b through e) and exhibit wedge shaped features at the step edge nucleation site (see Fig. 4b). The smallest step between terraces that we have observed is (4.0 +- 0.3) A, where the uncertainty is a single standard deviation determined by the root mean square roughness within a terrace. This value is in close agreement with the lattice constants of the unit cell of BTO (a = 3.99 A, c = 4.03 A).8 IV. FRICTION AND FERROELECTRIC POLARIZATION Lateral force microscopy (LFM) is an AFM-based technique used to measure nanoscale friction.15 The tip is brought into contact with the sample surface and scanned perpendicular to the long axis of the AFM cantilever. As the tip slides along the surface, friction between the tip and sample causes the cantilever to twist. The torsional bending of the cantilever results in a lateral deflection of the optical-lever laser spot on a quadrant photodiode, providing the user with a friction force signal. It has been shown that LFM can be sensitive to surface forces arising from chemical16,17 as well as structural surface properties.18 6 PFM is another AFM-based technique that is used to image ferroelectric domain distributions.19 In PFM, the AFM tip is brought into contact with a sample, an AC bias voltage is applied to the tip, and the amplitude and phase of the cantilever deflection at the AC bias frequency are measured. The amplitude of the cantilever response is related to the piezoelectric constants of the material under test, while the phase of the response is related to the direction of the ferroelectric polarization. Figure 2 shows LFM and PFM images overlaid on the topography of a cleaved area that contained both c+ and c- domains after cleaving. Both images were taken immediately after cleaving the sample in laboratory air (relative humidity of approximately 25 % at 21 degC). The ferroelectric domain pattern visible in Fig. 2b is typical of BTO (001) both before cleaving and Figure 2 LFM and PFM of a cleaved BTO surface containing both c+ and c- domains. Part (a) shows a friction force image obtained while applying a normal load of approximately 12 nN at a scan speed of approximately 100 um/s. The average friction force in each domain type is given in supplemental material.9 Part (b) shows a PFM phase image obtained using a Pt coated AFM tip. Both images are overlaid on top of the AFM topography. The contrast visible in the friction image corresponds quite closely to the ferroelectric domain pattern, but is largely independent of topography. 7 after cleaving, though it is possible that the process of cleaving the sample could introduce domains or alter the domain structure. The friction pattern exhibited in the LFM image very closely matches the ferroelectric domain patterns observed in the PFM image, implying that the ferroelectric polarization is closely related to the mechanism of friction contrast. It has been shown that water preferentially adsorbs onto the surface of c oriented BTO domains, and that this adsorption occurs within minutes after a change in humidity.20 The rapid adsorption of water is typically attributed to screening of bound charge on the polar ferroelectric surfaces.21 In order establish the contribution of adsorbed water to the friction contrast shown in Fig. 3a, we performed a drying experiment in N2 atmosphere. We first cleaved and imaged a sample in laboratory air. We then purged the air from the AFM using a continuous flow of dry nitrogen, which resulted in a relative humidity of less than 3 %. After one day in nitrogen, the sample was then measured again using LFM. These measurements are shown in Figs. 3a and 3b after cleaving in air and after one day in dry nitrogen atmosphere, respectively. We make two observations about these images: (1) after one day in nitrogen, friction on both c+ and c- domains is greatly reduced; and (2), after drying the sample in nitrogen, the c+ domains that had initially exhibited higher friction than the c- domains, then switched to the lower friction signal. In order to identify whether the residual friction contrast visible after drying the sample was directly related to the ferroelectric polarization, we performed a heating experiment that was designed to re-arrange the ferroelectric domains. The ferroelectric Curie temperature in BTO is approximately 125 degC, where BTO undergoes a structural phase transition from a tetragonal to a cubic unit cell. Once above this temperature, the ferroelectric ordering in BTO is destroyed. Upon cooling below 125 degC, the ferroelectric polarization can form a different pattern of domains as compared with the initial, unheated state. In our heating experiment, the crystal was 8 cleaved in air and an LFM image was obtained (Fig. 4a). Next, the AFM was flooded with a continuous flow of nitrogen. Once the relative humidity had dropped below 3 % (after approximately one hour), the crystal was heated from ambient temperature to 150 degC at a rate of 0.1 degC/s, and then cooled back to ambient temperature at an equal rate. Figure 4 shows friction, topography, and PFM images of a cleaved region of BTO before and after heat cycling. Figure 4a shows a freshly cleaved chip, which again shows the characteristic high and low friction regions. After heating, the change in friction shows the same trend as it did when simply drying the sample (see Fig. 3). That is, overall friction is reduced and there is a friction contrast reversal. As in the drying experiment, we attribute the friction reduction and contrast reversal to the removal of adsorbed water. In addition to these drying effects, we saw that after the sample was heated, the ferroelectric domain pattern was drastically Figure 3 Friction images demonstrating the effect of drying. Part (a) shows the friction force measured immediately after cleaving in air, revealing the friction contrast associated with c+ and c- domains, as shown in Fig. 2. Part (b) shows the friction force measured after leaving the sample in an N2 atmosphere for 24 hours. Both images are overlaid on top of AFM topography. The average friction force in each domain type before and after drying is given in supplemental material.9 After drying in N2, friction on both c+ and c- domains is reduced and there is a contrast reversal between domains. 9 changed. This change was indicated by a mismatch between the friction pattern immediately after cleaving (Fig. 4a) and the piezoresponse after heating (Figs. 4e and f), as well as the appearance of surface corrugations in the topography after heating (Figs. 4b and d). These surface corrugations are associated with domain rearrangement from an entirely c-oriented surface (before heating) to a mixture of a and c domains (after heating).21,28 We note that even after the ferroelectric domains were re-arranged by heat cycling, the friction imprint on the surface retained the same pattern as the ferroelectric polarization at the time the sample was cleaved. This indicates that the surface was permanently modified after cleaving, resulting in an imprint of the ferroelectric polarization onto the surface chemistry. V. DISCUSSION There are several possible mechanisms that could be responsible for the friction imprint effect described here. These mechanisms include physisorption, chemisorption, surface reconstruction, or a combination thereof. In previous reports, it has been shown that in ambient conditions the ferroelectric polarization charge of BTO is screened by adsorbed molecules on the timescale of minutes21 and that water is readily adsorbed onto BTO (001) surfaces.20 The role of water as a screening mechanism can be twofold: molecular water may reduce depolarization energy via higher dielectric constant, while dissociative adsorption and ionic transport can serve to compensate polarization bound charge. Based on these studies and the fact that our samples were cleaved in air, it is reasonable to expect that adsorption of water plays a role in our experiments. In this case, we expect that by either drying or heating the sample, we would at least partially remove the water layer. Indeed, we find that we observe a similar change in friction by placing the sample in a dry atmosphere for one day (as shown in Fig. 3), or by heating in a dry atmosphere (as shown in Fig. 4). In both of these cases, we find that the removal of 10 adsorbed water results in an overall reduction in friction force, as well as a contrast reversal between friction measured on c+ and c- domains. Although the effects of water adsorption should be considered, we do not expect a uniform layer of water to produce friction contrast between c+ and c- domains. However, it has been shown that different adsorbed ionic species can change the friction properties of surfaces significantly22,23,24 and that the adsorption of molecular species differs for c+ and c- domains on BTO.25 For our experiments, there are several possible sources of ionic species on the surface. For example, it has been shown that water undergoes dissociative adsorption on the BTO surface, producing H+ and OH- ions.26 Since the surfaces of BTO are polar, the surface bound charge may interact more strongly with either positive or negatively charged ions, leading to chemical contrast between domains. These ions may also be more strongly physisorbed or chemisorbed than the adsorbed water, preventing them from being removed after drying or heating. In addition to water, other surface contaminations may play a role. For example, CO2 dissolves in water and forms carbonic acid. This can dissociate into HCO3 and H+ ions, which may also adsorb on the surface. Yet another possible source of surface ions is leaching of Ba2+ from the surface, which has been shown to occur when BTO is exposed to aqueous solutions.27 It is very likely that the corresponding chemical surface reaction (see Eq. (1) in Ref. 27) depends on the local surface potential of the c+ and c- domains. Therefore, this reaction may result in different amounts of Ba2+ ions on the surface, which, in turn, could cause a difference in the measured friction. 11 It is worth noting that friction contrast has also been observed between the ferroelectric domains on organic ferroelectrics, such as triglycine sulphate (TGS)18,28 and guanidinium aluminum sulfate hexahydrate (GASH).18 In both of these cases, it was found that the origin of Figure 4 Friction and topography images before and after heating the sample above its Curie temperature. Part (a) shows the friction force overlaid on the topography immediately after cleaving the sample. Part (c) shows the friction force overlaid on the topography after heat cycling to 150 degC, which is well above the ferroelectric Curie temperature of BTO (125 degC). Parts (b) and (d) show high-resolution topography images before and after heating, respectively. The average friction force for each domain type before and after heating is given in supplemental material.9 Parts (e) and (f) show PFM phase and amplitude measurements after heat cycling, respectively. The black square in parts (a), (c), (e) and (f) indicates the region shown in parts (b) and (d). Despite the change in ferroelectric domain structure, the pattern of the friction force after heating closely matches the initial friction force distribution, indicating that the friction signal after heating is due to a modification of surface chemistry, rather than the ferroelectric polarization distribution. 12 friction contrast between ferroelectric domains was the orientation of molecules in the unit cell, which reverses as one moves across a 180 deg ferroelectric domain wall.18 For BTO, the unit cell is much simpler than that of either TGS or GASH, eliminating the possibility that a reversal in molecular orientation is the relevant mechanism here. It is also worth noting that friction contrast has been seen on SrTiO329,30 which has a very similar structure to BTO, although it is not ferroelectric. For the SrTiO3 (001) surface, the friction contrast has been attributed to the surface termination of the crystal, which can be either SrO or TiO2. This surface termination effect is generally associated with integer-and-a-half unit-cell steps on the surface, since the unit cell consists of alternating layers of SrO or TiO2. For our work, we believe that we can rule out this mechanism since we have observed friction contrast even within a single atomic terrace.9 Further, we have only observed whole-unit-cell steps between terraces and domains, implying that each adjacent domain has the same termination, which may be BaO or TiO2. In general, we expect that the mechanism of friction contrast between ferroelectric domains in BTO is likely to be a mixture physisorption, chemisorption, and surface reconstruction. Future experiments with samples cleaved and interrogated in vacuum would be instrumental in determining the degree to which each of these factors contributes to the friction contrast. VI. CONCLUSION We have carried out a comprehensive AFM-based study on freshly cleaved, atomically-flat BTO surfaces, and investigated the interaction between surface functionalization and the orientation of the ferroelectric domains. The main results of this work are two-fold. First, we have shown that atomic terraces of (001) oriented BTO can be obtained by mechanical cleavage. 13 This cleavage method provides a simple method for preparing fresh surfaces of BTO, which may find applications in fundamental studies of BTO surfaces or in exploratory studies of prototype devices that require epitaxial growth on BTO substrates. Second, we have shown that the freshly cleaved surface exhibits friction contrast between c+ and c- oriented ferroelectric domains, and that this friction pattern persists even after the ferroelectric domain distribution is changed. We have also shown the role of water in generating friction contrast reversal after drying or heating the sample in nitrogen. The origin of the observed friction contrast may be adsorption or chemisorption of charged or polar species from the air, or may entail surface reconstruction that is independent of environmental moieties. VII. MATERIALS AND METHODS For friction measurements, the sample was scanned along the direction perpendicular to the long axis of the cantilever while contact was maintained between the tip and sample, and the lateral signal from the quadrant photodiode was recorded. We then used a diamagnetic lateral force calibrator to convert the lateral deflection signal from Volts to Newtons.31 The friction force on the tip was then calculated by taking half of the difference in lateral force between the trace and retrace scan directions. All friction measurements were performed using nanocrystalline diamond tips, model ND-CTIT2 (Advanced Diamond Technologies, Romeoville, IL) unless otherwise noted. The scan speed was approximately 100 um/s and the normal load was approximately 12 nN for all friction images unless otherwise noted. PFM was performed at the fundamental contact resonance frequency using dual amplitude resonance tracking.32 For the PFM phase image in Fig. 2b, an AC bias of 1 V at approximately 270 kHz was applied to the Pt metal coating on the tip-side of the cantilever, which was a model AC240TM (Olympus, Tokyo, Japan). For the PFM images in Figs. 4e and f, 14 an AC bias of 1 V at approximately 780 kHz was applied to the conductive coating on the tip-side of the cantilever, which was a model DCP-11 (NT-MDT, Moscow, Russia). The orientation of the c+ and c- domains was identified by patterning domains using a DC bias on the tip, as shown in supplemental material.9 Following this patterning step, the PFM phase channel was calibrated by adding an offset that set the phase on c- domains to zero. AFM images were post-processed using Gwyddion software33 in order to produce 3D renderings. ACKNOWLEDGMENTS RJC thanks Fred Sharifi for insightful discussions. CJL acknowledges support under the Cooperative Research Agreement between the University of Maryland and the National Institute of Standards and Technology Center for Nanoscale Science and Technology, Award 70NANB10H193, through the University of Maryland. Work by DE and SDS was supported by the U.S. Department of Energy (DOE), Office of Science, Basic Energy Sciences (BES) under award # DESC0008115. REFERENCES 1 M. K. Lee, T. K. Nath, C. B. Eom, M. C. Smoak, and F. Tsui perovskite oxide thin films using structural transitions of ferroelectric BaTiO3 Appl. Phys. Lett. 77, 3547 (2000). DOI: 10.1063/1.1328762 2 C. A. F. Vaz, J. Hoffman, A.-in Fe3O4/BaTiO3 (100) epitaxial structures, Appl. Phys. Lett. 94, 022504 (2009). DOI: 10.1063/1.3069280 3 D. C. 3 J. Appl. Phys. 66, 3850 (1989). DOI: 10.1063/1.344049 4 J. O. White, M. Cronin-Golomb, B. induced gratings in the photorefractive crystal BaTiO3,Appl. Phys. Lett. 40, 450 (1982). DOI: 10.1063/1.93144 5 T. Karaki, K. Yan, T. Miyamoto, -free piezoelectric ceramics with large dielectric and piezoelectric constants manufactured from BaTiO3 nano-pJpn. J. Appl. Phys. 46, L97 (2007). DOI: 10.1143/JJAP.46.L97 6 J. Scott, Ferroelectric Memories (Springer, Berlin, 2000). 15 7 H. Zheng, J. Wang, S. E. Lofland, Z. Ma, L. Mohaddes-Ardabili, T. Zhao, L. Salamanca-Riba, S. R. Shinde, S. B. Ogale, F. Bai, D. Viehland, Y. Jia, D. G. Schlom, M. Wuttig, A. Roytburd, and R. Ramesh 3-CoFe2O4 nanostructures,Science 303, 661 (2004). DOI: 10.1126/science.1094207 8 F. Jona and G. Shirane, Ferroelectric crystals (Dover Publications, INC., New York, 1993). 9 See supplemental material at [URL will be inserted by AIP] for the crystal structure of BTO, images showing patterning of ferroelectric domains, images showing friction contrast within a single atomic terrace, and a table of friction values within each domain type for the images shown in Figs. 2-4. 10 MTI Corporation, Part #: BTOb050510S2 (BaTiO3 single crystal, (001) orientation, 5x5x1 mm, polished on both sides). 11 3 (001) Surface Science 605, 158 (2011). DOI: 10.1016/j.susc.2010.10.014 12 3 J. Appl. Phys. 51, 4956 (1980). DOI: 10.1063/1.328372 13 thermodynamic stability of the BaTiO3 Phys. Rev. Lett. 101, 036102 (2008). DOI: PhysRevLett.101.036102 14 The full description of the procedures used in this article requires the identification of certain commercial products and their suppliers. The inclusion of such information should in no way be construed as indicating that such products or suppliers are endorsed by NIST or are recommended by NIST or that they are necessarily the best materials, instruments, software or suppliers for the purposes described. 15 R. W. Carpick, D. F. Ogletree, and M. measurement for the determination of shear strengths with friction force microscopy,Appl. Phys. Lett. 70, 1548 (1997). DOI: 10.1063/1.118639 16 C. D. Frisgroup imaging by chemical force microscopy,Science 265, 5181 (1994). DOI: 10.1126/science.265.5181.2071 17 E. Meyer, R. Overney, D. Brodbeck, L. Howald, R. Luthi, J. Frommer, and H.-and wear of Langmuir-Blodgett films observed by friction force microscopy,Phys. Rev. Lett. 69, 1777 (1992). DOI: 10.1103/PhysRevLett.69.1777 18 in lateral force microscopy,Phys. Rev. B 57, 161 (1998). DOI: 10.1103/PhysRevB.57.161 19 Nanoscale characterization of ferroelectric materials, edited by M. Alexe and A. Gruverman (Springer, Berlin, 2004). 20 D. Y. He, L. J. Qiao, Alex A. Volinsky, Y. Bai, M. Wu, BaTiO3 single crystal surface water adsorption,Appl. Phys. Lett. 98, 062905 (2011). DOI: 10.1063/1.3544586 21 Sergei V. Kalinin, C. Y. Johnson, and Dawn A. potential inversion on the BaTiO3 (100) surface,J. Appl. Phys. 91, 3816 (2002). DOI: 10.1063/1.1446230 22 L. Xu and M. Salmeron surface ions on the friction and adhesion properties of mLangmuir 14, 2187 (1998). DOI: 10.1021/la9713659 23 B. C. Donose, I. U. Vakarelski, E. Taran, H. Shinto, and K. Higashitani Specific effects of divalent cation nitrates on the nanotribology of silica surfaces,Ind. Eng. Chem. Res. 45, 7035 (2006). DOI: 10.1021/ie060182r 24 I. U. Vakarelski, N. Teramoto, C. E. McNamee, J. O. Marston, and K. enhancement of silica surface nanowear in electrolyte solutions,Langmuir 28, 16072 (2012). DOI: 10.1021/la303223q 16 25 D. Li, M. H. Zhao, J. Garra, A. M. Kolpak, A. M. Rappe, D. A. determination Nat. Mater. 7, 473 (2008). DOI: 10.1038/nmat2198 26 J. L. Wang, B. Vilquin, 3 (001) surface by ultraviolet photo-induced charge and dissociative water adsorption,Appl. Phys. Lett. 101, 092902 (2012). DOI: 10.1063/1.4748330 27 -temperature solubility behavior of barium titanate in aqueous media, J. Am. Ceram. Soc. 83, 860 (2000). DOI: 10.1111/j.1151-2916.2000.tb01286.x 28 contrast by noncontact and friction force microscopy,J. Vac. Sci. Technol. B 14, 1191 (1996). DOI: 10.1116/1.588512 29 -ideal strontium Appl. Phys. Lett. 73, 2920 (1998). DOI: 10.1063/1.122630 30 J. Fompeyrine, R. Berger, H. P. Lang, J. Perret, E. Machler, Ch. Gerber and J.-P. Locquet determination of the stacking sequAppl. Phys. Lett. 72, 1697 (1998). DOI: 10.1063/1.121155 31 Q. Li, K.-S. Rev. Sci. Instrum. 77, 065105 (2006). DOI: 10.1063/1.2209953 32 B. -frequency resonance-tracking atomic Nanotechnology 18, 475504 (2007). DOI: 10.1088/0957-4484/18/47/475504 33 D. Necas and P. -source software for SPM data analysis,Central Eur. J. Phys. 10, 181 (2012). DOI: 10.2478/s11534-011-0096-2 Figure S1 Part (a) shows the crystal structure of BTO at ambient temperature, which is a tetragonal perovskite structure (space group P4mm, IUC number 99). The ferroelectric polarization direction corresponds to the displacement of the Ti atom from the center of the unit cell along the c axis. Part (b) shows the six possible ferroelectric polarization directions relative to the crystal lattice. Figure S2 Identification of ferroelectric domain orientation by patterning ferroelectric domains. Parts (a) and (b) show the PFM amplitude and phase channels for a freshly cleaved BTO surface, respectively. Parts (c) and (d) show the PFM amplitude and phase channels after writing ferroelectric domains using a tip bias. A positive tip bias writes c- domains, while a negative tip bias writes c+ domains. Figure S3 Example of friction contrast in a region with no unit cell step between the high friction and low friction regions. Part (a) shows the sample topography and (b) shows the friction force image for a freshly cleaved BTO surface. The tip was a model TR800PSA (Olympus, Tokyo, Japan). The applied normal load was approximately 16 nN and the scan speed was approximately 10 um/s. Friction image c+ c- Fig. 2a (Freshly cleaved) (15.2 +- 3.1) nN (7.3 +- 0.8) nN Fig. 3a (Freshly cleaved) (18.9 +- 2.1) nN (10.4 +- 2.3) nN Fig. 3b (After drying) (3.4 +- 0.6) nN (4.7 +- 1.2) nN Fig. 4a (Freshly cleaved) (13.5 +- 1.0) nN (7.8 +- 0.7) nN Fig. 4c (After heating) (4.4 +- 0.3) nN (7.7 +- 0.6) nN Table S4 Average friction values for the friction images shown in Figs. 2, 3, and 4. The uncertainties represent one standard deviation of the friction force within each domain type as determined by the root mean square deviation from the average. The ferroelectric domain orientation (c+ or c-) in the table above refers to the domain orientation immediately after cleaving.", "title": "Friction imprint effect in mechanically cleaved BaTiO3 (001)", "url": "http://www.nist.gov/manuscript-publication-search.cfm?pub_id=916209", "proceedings": "", "location": "", "published": "September 28, 2014", "issue": "12"}