{"abstract": "", "citation": "NIST Interagency/Internal Report (NISTIR) - 8100", "volume": "", "pdf_filename": "919811.pdf", "authors": "Christopher U. Brown; Gregor  Jacob; Mark R. Stoudt; Antonio M. Possolo; Shawn P. Moylan; M A. Donmez;", "keywords": "", "pages": "", "dates": "", "pdf_text": "NISTIR 8100 Supplementary information for an interlaboratory study of additively manufactured nickel alloy (IN625) tensile specimens Christopher U. Brown Gregor Jacob Mark Stoudt Antonio Possolo Shawn Moylan Alkan Donmez This publication is available free of charge from: http://dx.doi.org/10.6028/NIST.IR.8100 NISTIR 8100 Supplementary information for an interlaboratory study of additively manufactured nickel alloy (IN625) tensile specimens Christopher U. Brown Systems Integration Division Engineering Laboratory Gregor Jacob Intelligent Systems Division Engineering Laboratory Mark Stoudt Materials Science and Engineering Division Material Measurement Laboratory Antonio Possolo Statistical Engineering Division Information Technology Laboratory Shawn Moylan Intelligent Systems Division Engineering Laboratory Alkan Donmez Intelligent Systems Division Engineering Laboratory This publication is available free of charge from: http://dx.doi.org/10.6028/NIST.IR.8100 March 2016 U.S. Department of Commerce Penny Pritzker, Secretary National Institute of Standards and Technology Willie May, Under Secretary of Commerce for Standards and Technology and Director i TABLE OF CONTENTS 1. INTRODUCTION 2. MANUFACTURING PLAN AND BLANK PROCESS CONTROL DOCUMENT SENT TO PARTICIPANTS 3. BUILD FILES SENT TO THE PARTICIPANTS 4. ENGINEERING DRAWINGS WITH BUILD INSTRUCTIONS SENT TO PARTICIPANTS 5. ANALYSIS OF PARTICLE SIZE DISTRIBUTION OF THE POWDERS SENT TO PARTICIPANTS 6. TENSION SPECIMENS FABRICATED ON A DIFFERENT LPBF MACHINE 7. SUMMARY 8. ACKNOWLEDGEMENT 9. REFERENCES 10. APPENDIX - COPY OF THE 7 PROCESS CONTROL DOCUMENTS RETURNED BY THE PARTICIPANTS ii 1 1. INTRODUCTION In fiscal year 2014, National Institute of Standards and Technology (NIST) conducted a round robin study to investigate the variation of mechanical properties of nickel alloy (IN 625) tensile specimens fabricated on six different laser-based powder bed fusion (LPBF) machines from the same machine vendor by six different institutions. The study results were summarized in a journal paper [1]. This report provides the supplementary information generated during planning and execution of the study. This supplementary information includes: (1) the manufacturing plan and blank process control document sent to the participants, (2) a description of the build programs sent to the participants, (3) engineering drawings with build instructions, (4) powder size distribution analysis of the powder sent to the participants, and (5) results obtained from a different LPBF machine. Copies of the process control documents received from the participants are provided in the Appendix. During this study, the round robin coordinator identified a willing participant who had a LPBF machine from a different vendor. To obtain an additional data point for future comparative studies, this participant was invited to fabricate tensile specimens using the same powder and manufacturing plan with the process settings provided to the other participants. This participant was also sent the same individual tessellated and slice files to duplicate the process and fabricate the tensile bars. Upon receiving the build platform with the tensile specimens attached, NIST followed the same post processing procedures to heat treat them, extract the specimens, and prepare the specimens for the tension tests. This report1 also provides a comparison of tension test results and fracture analysis 1 Certain commercial entities, equipment, or materials may be identified in this document in order to describe an experimental procedure or concept adequately. Such identification is not intended to imply recommendation or endorsement by the National Institute of Standards and Technology, nor is it intended to imply that the entities, materials, or equipment are necessarily the best available for the purpose. 2 between the results obtained from the main group of participants and the participant with a different LPBF machine (section 6). 2. MANUFACTURING PLAN AND BLANK PROCESS CONTROL DOCUMENT SENT TO PARTICIPANTS NIST sent the following manufacturing plan and blank Process Control Document (PCD) to each participant before fabricating the specimens. The manufacturing plan consists of a detailed list of steps for each participant to follow in order to fabricate the build. NIST requested that the participants track the machine parameters used for the build in the Process Control Document (PCD). Participants returned the completed process control document back to NIST. The Manufacturing Plan defines the requirements to complete the desired work that is agreed upon by the supplier and purchaser. The Process Control Document is a procedure to ensure the requirements of the Manufacturing Plan are met. Together, the Manufacturing Plan and PCD tightly control and fully document the fabrication of test coupons for generating material property data. 0. Scope and Purpose of Study Starting in May of 2014, NIST will conduct a round robin test to 1) further refine test protocols and analysis methods that will be used in future, more extensive round robin tests that will result in certification of AM materials, and 2) assess the variability in the tensile properties of additively made nickel alloy (Inconel 625) tension specimens from different institutions. The focus will be the Direct Metal Laser Sintering (DMLS) EOS M270/M280 process. NIST will distribute virgin nickel chrome (IN625) powder and build plates for the participants. Before distribution, NIST will sample the various powder lots for subsequent powder analysis. Each participant will follow a NIST-provided manufacturing plan to make one single build of eight (8) tensile bars, using a NIST-provided build file. (In the cases where the NIST-provided EOS job file is not compatible, NIST will provide the necessary information for the participant to construct the job file.) . Inability to comply with the manufacturing plan should be raised by the participant and approved by the study coordinator. 3 Each participant will send the tensile bars, still on the NIST-provided build plate, to NIST. NIST will coordinate the heat treatment, removal from the build plates, and testing the bars. NIST statistical experts will then perform the data analysis and make recommendations for test protocols and analysis methods for future round robins that lead to certification of AM materials. All results will be shared with the participants and may be published as well. The specific results from individual participants will not be publically attributed. All participants may keep any unused powder for their own future use. 1. Part Description 1.1. Engineering Drawing (the final geometry of the tensile specimen conforms to ASTM E8/E8M [2], d : Please note the following revised drawing sent to the participants by email within the build files reflects the actual build design in the study. The original image in the manufacturing plan was an earlier version of the build design which was modified slightly. 4 1.2. STL file: to be sent by email from study coordinator 1.3. EOSJOB file: to be sent by email from study coordinator 2. Machine Requirements 2.1. System 2.1.1. Process: Laser Powder Bed Fusion 2.1.2. Manufacturer: EOS 2.1.3. Model: EOSINT M270 2.1.4. Laser System: 200 W maximum power, 1060 nm - 1100 nm wavelength (preferred IPG YLR-SM-200) 2.2. Software: EOS M270 Operating Software Version: PSW 3.5 rev 71 or newer preferred, not required. 2.3. Maintenance: All maintenance of the system must be current and documented. Preventative maintenance must have been completed within 6 months of building the test specimens. 2.4. System Calibrations: All system calibrations shall be current and documented. Some of these calibrations should be completed as part of regular preventative maintenance (e.g., laser power, skywriting, etc.). Others should be performed by the individual users (e.g., beam offset, x and y scaling). 3. Powder Requirements 3.1. Powder shall be supplied to the participants by the study coordinator for use in this study. The subsections below document the powder as procured by the study coordinator. Samples have been extracted from each powder container for further evaluation. 3.2. Chemistry (mass fraction): 58.00 wt - %) Cr (20.00 - 23.00 wt - %) 5 Mo (8.00 - 10.00 wt - %) Nb (3.15 - 4.15 wt - %) 5.00 wt - %) 0.40 wt - %) 0.40 wt - %) 1.0 wt - %) 0.10 wt - %) 0.05 wt - %) 0.50 wt - %) 0.015 wt - %) 3.3. Powder Size and Distribution: mean diameter = 37.8 um +- 12.4 um. D(0.7) = 40 um. 3.4. Recycling of Powder: Only virgin (per ASTM 2924) powder may be used to produce the components. 4. Process Set-Up Requirements 4.1. Platform: Build platforms can be provided to participants upon request. If a participant would prefer to use their own build platform, it should conform to the specifications study. 4.1.1. Material: Platform must be AISI 1045 steel. 4.1.2. Thickness: Platform must be 20 mm +- 2 mm thick. 4.1.3. Condition: Platform should be ground flat to a roughness of Rz = 10 um or better. The platform demagnetized after grinding. The platform shall be thoroughly cleaned of machining lubricants prior to installation into the system. Once installed, the build platform surface shall be cleaned with alcohol using a lint free cloth and gloved hands. 4.1.4. Preheat: Platform shall be preheated to a temperature of 80 degC. 4.2. Recoater Blade: The blade shall be ceramic (EOS part HSS 2200-4073) and within the manufacturers specified useful lifetime and or original specification. The blade shall be 4.3. Process Parameters: The study coordinator will provide, via email, an EOSJOB file with process parameters preset. Participants should check and document correct settings of all process parameters. All process parameters below are to be explicitly followed and reported. The process parameters are to be defined in the default job file and held constant throughout all builds unless otherwise agreed upon. Any changes in the default parameter set from build to build must be documented and carried forward in all reporting. All parameter sets are to be disclosed. Each job file will be saved and archived upon completion of the build for each and every build. All parameters that are unique to each system and that are not saved in the job file shall also be documented. A list of all process parameters shall be created and reported. The process parameter list shall 6 include all key parameters, system settings and machine conditions including but not limited to: 4.3.1. Base Parameter Set: The EOS MP1 (Cobalt-Chrome) parameter set for an EOS M270 with 200W laser machine using the layer thickness in 4.3.2 shall be used. 4.3.2. 4.3.3. Material Specific Settings 4.3.3.1. Material Dependent Scaling Factors (to be set at each machine for each machine). Scaling Factors may be determined from the EOS certification part and fine tuning spreadsheet X Y Z(0) Z(200) TBD by participant TBD by participant TBD by participant TBD by participant 4.3.3.2. Beam Offset (mm): May be determined from EOS certification part 4.3.3.3. Beam Expander Setting: 1 4.3.4. Adjust Tab 4.3.4.1. Groups: All individual parts shall be contained in their own group with the same exposure setting (4.3.5). The position and rotation of the group shall not be modified from 2.1. 4.3.4.2. Sorting: Sorting of parts by X/Y/Z by smallest point. 4.3.5. Exposure Parameters 4.3.5.1. Pre exposure type: PreContour 4.3.5.1.1. First Contour Standard OnPart Downskin Speed (mm/s): 900.0 800.0 1600.0 Power (W): 100.0 100.0 100.0 Beam Offset (mm): 0.000 Contour Yes (checked) Thickness (mm): 0.040 Post Contour No (unchecked) Corridor (mm): 0.040 4.3.5.1.2. Second Contour (Turned Off) Standard OnPart Downskin Speed (mm/s): - - - Power (W): - - - Beam Offset (mm): - Contour No (unchecked) Thickness (mm): - Post Contour No (unchecked) 7 Corridor (mm): - 4.3.5.1.3. Edges (Turned Off) Edge factor - Edges No (unchecked) Threshold: - Post Edge No (unchecked) Minimum radius factor: - Beam offset (mm): - Speed (mm/s): - Power (W): - 4.3.5.2. Skin exposure type: OuterSkin 4.3.5.2.1. Stripes Distance (mm): 0.10 Stripe width (mm): 4.00 Speed (mm/s): 800.0 Stripes overlap (mm): 0.10 Power (W): 195.0 Skywriting: Yes (checked) Beam offset (mm) 0.030 Offset: Yes (checked) Hatching, X Yes (checked) Alternating: Yes (checked) Hatching, Y Yes (checked) Rotating: Yes (checked) Rotated Angle 67deg* *may not be available for specification 4.3.5.2.2. UpDown Upskin Downskin Distance (mm): 0.05 0.05 Overlap with inskin (mm): 0.10 Speed (mm/s): 800.0 3000.0 Min. length (mm): 2.00 Power (W): 195.0 195.0 Thickness (mm): 0.00 0.04 X: Yes (checked) Yes (checked) Y: Yes (checked) Yes (checked) Alternating No (unchecked) No (unchecked) Skywriting Yes (checked) 8 4.3.5.2.3. Skip layer Skipped layers: 0 Offset layers: 0 Expose first layer: Yes (checked) 4.3.5.3. Core exposure type: InnerSkin 4.3.5.3.1. Chess Squares Gap Distance (mm): 0.10 0.10 Square width (mm): 8.00 Speed (mm/s): 800.0 800.0 Gap width (mm): 0.00 Power (W): 195.0 195.0 Overlap (mm): 0.08 Beam offset: -0.050 Alternating: Yes (checked) Hatching: X = Yes (checked) Y = Yes (checked) Rotated: Yes (checked) Skywriting: No (unchecked) Offset: Yes (checked) 4.3.5.3.2. Skip layer Skipped layers: 0 Offset layers: 0 Expose first layer: Yes (checked) 4.3.5.4. Post exposure type: Postcontour 4.3.5.4.1. First Contour Standard OnPart Downskin Speed (mm/s): 900.0 800.0 1600.0 Power (W): 120.0 120.0 120.0 Beam Offset (mm): 0.015 Contour Yes (checked) Thickness (mm): 0.040 Post Contour Yes (checked) Corridor (mm): 0.040 4.3.5.4.2. Second Contour (Turned Off) Standard OnPart Downskin Speed (mm/s): - - - Power (W): - - - 9 Beam Offset (mm): - Contour No (unchecked) Thickness (mm): - Post Contour No (unchecked) Corridor (mm): - 4.3.5.4.3. Edges Edge factor 2.00 Edges Yes (checked) Threshold: 3.0 Post Edge Yes (checked) Minimum radius factor: 0.00 Beam offset (mm): 0.000 Speed (mm/s): 900.0 Power (W): 100.0 4.3.5.5. Skin Thickness (x/y): 3.00 mm 4.3.5.6. Skin Thickness (z): 3.00 mm 4.3.5.7. Base radius: 0.00 mm 4.3.5.8. Core open to platform: No (unchecked) 4.3.5.9. Skin/Core: Yes (checked) 4.3.6. Setting 4.3.6.1. Part Specific Scaling: 0% in X and Y 4.3.6.2. Material Dependent Scaling 0% in X and Y 4.3.6.3. Part Specific Undersize/Oversize: 0 mm 4.3.7. Building 4.3.7.1. Start Height: 0.02mm 4.3.7.2. Final Height: the height of the tallest part in 1.2 (4.18 mm) 4.3.7.3. Layer Thickness: See 4.3.2 4.3.8. DMLS 4.3.8.1. DMLS: DMLS shall be unchecked 4.3.8.2. Pre-exposure: Pre-exposure shall be set to 0.06 mm (3 layers). 4.3.9. Recoating. 4.3.9.1. Minimum charge amount: 150 % 4.3.9.2. Maximum charge amount: 200 % 4.3.9.3. Dosing boost amount: 300 % 4.3.9.4. Recoater speed 1: 500 mm/s 4.3.9.5. Recoater speed 2: 80 mm/s 4.3.9.6. Lower dispenser platform: 1.00 mm 4.3.9.7. Contact-free outward travel: yes (checked) 10 4.3.10. Scanner Settings 4.3.10.1. Automatic Calibration: Yes, every 2 layers 4.4. Build Chamber Environment 4.4.1. Purge Gas: For the purpose of this study, nitrogen will be used as the inert gas within the process chamber. allowable. If the Nitrogen is from a bottle or dewar, user should report the nominal gas purity. 4.4.2. 4.4.2.1. Flow Meters set on the front of the machine (5 meters) 4.4.2.2. Flow meter set (voltage) on the filtration unit 4.4.3. Filtration: Filtration must be enabled. Filter maintenance must be current per manufacturer guidelines 4.4.4. Oxygen Level: Oxygen level must be less than 1.3 % oxygen (15000 ppm) maximum. 4.5. Required Quality Control Checks at Build Start The following Quality Control Checks are required to be performed sequentially before beginning the build. 4.5.1. System Maintenance and Cleaning: All system maintenance must be performed and the interior of the chamber, including optical components, powder hoppers, recoater blade, shall be cleaned per manufacturer guidelines. 4.5.2. Laser Power: The laser power shall be measured (if possible) using a laser power meter within calibration at all power levels prescribed in 4.3 and fall within 10 % of the prescribed value. Each measurement is to be reported as setpoint, displayed and measured value. If any value is outside the prescribed value, the individual measurement shall be repeated and if the average of 3 measurements exceeds the power range, corrective action should be taken which includes laser maintenance and adjusting the setpoint value to achieve the desired delivered laser power. 4.5.3. Installation of Platform: Platform may be installed after completion requirements in 4.5.1 and 4.5.2. The build platform shall be parallel to the recoating blade and recoating arm motion to within 50 um. Preferred method of levelling to recoating blade uses feeler gage/ shims between build platform and recoating blade. Preferred method of levelling to recoating arm motion uses dial indicator mounted to recoating arm. After installation and levelling of the platform, it shall be cleaned in a manner described in 4.1.3. 4.5.4. Powder Loading: New powder, directly from containers, must be loaded into the dispenser per manufacturer guidelines (sieving not necessary). Sufficient quantities shall be loaded to achieve a complete build without the need to refill. Any devices used to stab, pack or tamp the powder must be stainless steel and cleaned using acetone and wiped with a lint free cloth prior to inserting into the powder. 4.5.5. First layer: Once the build platform is leveled and the powder is loaded, railed, packed and smoothed, the first layer shall be created. The recoating arm should be past the dispenser platform. The build platform should be brought up to the level of the recoating blade, 11 then lowered by the distance equal to one layer thickness. The dispenser platform shall be raised to a height to expose enough powder to deposit one layer as well as fill any gaps, holes, crevices, etc. between the dispenser platform and the collector bin. The recoating arm shall then be moved across the dispenser platform and build platform (to the home position) at the speed described in 4.3.9.5. 4.5.6. Platform Temperature: The platform temperature must be within 5 degC of the value prescribed in 4.1.4. Record the platform temperature at the start of the build. 4.5.7. Oxygen Level: The oxygen level must be less than the level prescribed in 4.4.4. Record the oxygen level at the start of the build process. 5. In Process Requirements 5.1. Limits 5.1.1. Environment: If during processing the oxygen level in the build chamber exceeds the level prescribed in 4.4.4, the build shall be stopped. 5.2. Build Pause/Interruption 5.2.1. No planned interruption of the build is required. 5.2.2. Any interruption to the continuous build cycle must be recorded with a description of the reason for the interruption and corrective action. 5.2.3. Prior to opening the build chamber, the oxygen level and platform temperature must be recorded. 5.2.4. Upon continuation of the build, the requirements of 4.5.6 and 4.5.7 must be met and preferably be within 10 % of the values recorded in 5.2.3. 6. Process Completion Requirements 6.1. Removal from System 6.1.1. The build shall be allowed to cool inside the build chamber submerged in powder under protective environment until the temperature drops below 30 degC. 6.1.2. The temperature and oxygen level shall be recorded prior to opening the build chamber. 6.1.3. The build and platform shall be removed from the chamber and cleaned of loose powder using a non-metallic brush. 6.1.4. The build and platform may be further cleaned by using a metallic brush or other means to remove partially sintered powder particles. 6.1.5. Laser Power: The laser power shall be measured (if possible) using a laser power meter within calibration at all power levels prescribed in 4.3. Each measurement is to be reported as setpoint, displayed and measured value. 6.1.6. Cleaning: The system may be cleaned at this point following manufacturer guidelines. 6.2. Powder Recovery 6.2.1. Excess, loose powder removed from the build platform through the completion of 6.1.3 shall be collected and stored in appropriately marked containers indicating that it is USED. 6.2.2. Any partially sintered material is not allowable for reuse and should be disposed of properly. 12 6.2.3. Participants may keep any unused powder for their own use. 7. Post Process Requirements 7.1. Heat treat 7.2. Machine samples 7.2.1. Mill top surface 7.2.2. Remove samples by electric discharge machining (EDM) 7.2.3. EDM gage section 7.2.4. Grind remaining surfaces 8. Reporting 8.1. Part Technical Data 8.2. Machine Technical Data 8.3. Powder Technical Data 8.4. Process Setup Technical Data 8.5. In Process Technical Data 8.6. Process Completion Technical Data 8.7. Post Process Technical Data 8.8. Testing Technical Data Process Control Document Technical Data (section numbers refer to Manufacturing Plan) Part Manufacturing Technical Data Completed by the part manufacturer Value Requirement Section Approval Job Number Build File Name: 1.2 Process 2.1.1 Equipment Manufacturer and Model: 2.1.2 Equipment Serial Number: Laser Manufacturer and Model: 2.1.4 Laser Serial Number: Software Version: 2.2 13 Date of last preventative maintenance 2.3 System Calibration Current 2.4 Material Requirements Verify Powder Heat/Lot Loaded Matches Feedstock Technical Data Material Condition (Virgin/Recycled) 3.4 Process Setup Requirements Build Platform Material 4.1.1 Build Platform Thickness 4.1.2 Build Platform Condition 4.1.3 Build Platform Preheat, degC 4.1.4 Recoater Blade Material/Part Number 4.2 Process Parameter Settings Base Parameter Set 4.3.1 Base Parameter Filename Layer Thickness 4.3.2 Sort Parts Method: 4.3.4.2 Exposure Parameters Complete Exposure Parameters Table Below 4.3.5 Pre Contour Type 4.3.5.1 Skin Exposure Type 4.3.5.2 Core Exposure Type 4.3.5.3 Post Contour Type 4.3.5.4 Skin Thickness (x/y), mm 4.3.5.5 Skin Thickness (z), mm 4.3.5.6 Base Radius: 4.3.5.7 Core open to platform?: 4.3.5.8 Skin/Core: 4.3.5.9 Scaling and Offset 14 Material Specific Scaling X, % Y, % Part Specific Undersize/Oversize Beam Offset, mm 4.3.6.3 4.3.6.1 4.3.6.2 Building Screen Start Height (mm): 4.3.7.1 Final Height (mm): 4.3.7.2 Layer Thickness 4.3.2 DMLS Settings DMLS Off Range, (mm) Pre-exposure On Range, (mm) 4.3.8.1 4.3.8.2 Recoating Screen Minimum Charge, % Maximum Charge, % Dosing Boost, % Recoating Speeds (mm/s) Recoating Speed 1 Recoating Speed 2 4.3.9.4, 4.3.9.5 Dosing Boost, % Lower Dispenser Platform Contact-free outward travel 4.3.9.6 4.3.9.7 Build Time Estimation Build Chamber Environment 4.4 Purge Gas Used 4.4.1 Purge Gas Source 4.4.1 Flow Rates 4.4.2 Filtration 4.4.3 Oxygen Set Point 4.4.4 Quality Control Checks at Build Start System Maintenance and Cleaning Performed 4.5.1 Pre Build Laser Power Measurement Setpoint Display Measured Pre Contour Stripes 4.5.2 Up Skin 15 Down Skin Post Contour Edges Build Platform Leveling Complete 4.5.3 Platform Temperature 4.5.6 Platform Level Oxygen Level 4.5.7 In Process Requirements Limits Max Limit Min Limit Max Measured Build Start Time Build Interruptions (If Yes, Attach Documentation per 5.2) 5.2 Process Completion Platform Temperature at Time of Chamber Opening 6.1.1,6.1.2 Chamber Oxygen Prior to Opening 6.1.2 Recovered Powder Labeling 6.2 Post Build Laser Power Measurement Setpoint Display Measured Pre Contour Stripes 6.1.5 Up Skin Down Skin Post Contour Edges Exposure Parameters Completed by the part manufacturer Value Requirement Section Approval 16 Job Number Build File Name: Pre Exposure Pre Exposure Type 4.3.5.1 First Contour Standard OnPart Downskin 4.3.5.1.1 Speed (mm/s): Power (W): Beam Offset (mm): Contour Thickness (mm): Post Contour Corridor (mm): Second Contour Standard OnPart Downskin 4.3.5.1.2 Speed (mm/s): Power (W): Beam Offset (mm): Contour Thickness (mm): Post Contour Corridor (mm): Edges Edge factor Edges 4.3.5.1.3 Threshold: Post Edge Minimum radius factor: Beam offset (mm): Speed (mm/s): Power (W): Skin Exposure Skin Exposure Type 4.3.5.2 Stripes Distance (mm): Stripe width (mm): 4.3.5.2.1 17 Speed (mm/s): Stripes overlap (mm): Power (W): Skywriting: Beam offset (mm) Offset: Hatching, X Alternating: Hatching, Y Rotating: UpDown Upskin Downskin 4.3.5.2.2 Distance (mm): Speed (mm): Power (W): Thickness (mm): X: Y: Alternating: Overlap with inskin(mm): Skywriting: Min. length (mm) Skip Layer Skipped Layers 4.3.5.2.3 Offset layers: Expose first layer: Core Exposure Core Exposure Type 4.3.5.3 Chess Squares Gap Distance (mm): Speed (mm/s): Power (W): Width (mm): Beam offset (mm) Overlap: Hatching, X: Alternating: 18 Hatching, Y: Rotating: Skywriting: Rotated Angle: Offset: Post Exposure Post Exposure Type 4.3.5.4 First Contour Standard OnPart Downskin 4.3.5.4.1 Speed (mm/s): Power (W): Beam Offset (mm): Contour Thickness (mm): Post Contour Corridor (mm): Second Contour Standard OnPart Downskin 4.3.5.4.2 Speed (mm/s): Power (W): Beam Offset (mm): Contour Thickness (mm): Post Contour Corridor (mm): Edges Edge factor Edges 4.3.5.4.3 Threshold: Post Edge Minimum radius factor: Beam offset (mm): Speed (mm/s): Power (W): 19 3. BUILD FILES SENT TO THE PARTICIPANTS Figure 1 shows a block diagram of the process of developing build files from the initial computer solid models using various software modules. NIST sent the computer files to all the participants. Figure 1. Block diagram of the process of developing the build files. Material setting: \"MP1_020_100_Surface\" (default) NIST generated the following build files and distributed them to the participants: Six STL files, named: \"RR_IN625_tensile_x.stl\" where x = 1 to 6 for each of the 6 tensile bars Six CLI support structure related files, named: RR_IN625_tensile_x_0m. cli where x = 1 to 6 One Magics file, named: \"AM_Round Robin IN625_tensile specimens.magics\" six part related slice files named: \"RR_IN625_tensile_x_p.sli\" where x = 1 to 6 20 six support structure related slice files named: \"RR_IN625_tensile_x_0m.sli\" where x = 1 to 6 for each of the 6 tensile bars One EOS build file, named: \"AM_Round Robin_Inconel 625.eosjob\" 21 4. ENGINEERING DRAWINGS WITH BUILD INSTRUCTIONS SENT TO PARTICIPANTS Engineering drawings of the build with post processing directions. 22 23 24 25 26 Engineering drawing of the final tensile specimens: 27 5. ANALYSIS OF PARTICLE SIZE DISTRIBUTION OF THE POWDERS SENT TO PARTICIPANTS IN625 powder size distribution as determined using sieves ASTM B214 [3] was followed to perform the sieve analysis for each of the 15 buckets of IN625 powder sent to the participants. Originally two buckets were distributed to each of the 7 participants; however, one bucket was misplaced and therefore a fifteenth, replacement bucket, was issued. All 15 buckets were from the same manufacturing lot (M111201). Seven sieves were chosen based on the expected maximum size of the powder. The chosen US Standard sieve sizes were: 230 (75 m > 63 m), 270 (63 m > 53 m), 325 (53 m > 45 m), 400 (45 m > 38 m), 450 (38 m > 32 m), 500 (32 m > 25 m), 635 (25 m > 20 m), and pan (> 20 m). According to the mill certificate, 98 % of the powder was expected to be 53 m or smaller, therefore one sieve size larger than 53 m was used, sieve 230 (US Standard size). The powder in each sieve was determined using a mass balance and the cumulative mass percent was calculated for each sieve. Figure 2 is an example plot from one of the powder samples. The data was used to approximate the powder diameter at cumulating mass percentages of 10 % (D10), 50 % (D50), and 90 % (D90). In other words, the D50 for a given powder as determined by sieving indicates 50% of the powder mass has this diameter size or smaller. 28 Figure 2. Cumulative mass (%) versus powder size (m) versus for one of the IN625 powder samples. The data in this plot was used to approximate the powder diameter at the cumulative mass percentages of 10 %, 50 %, and 90 % for each powder bucket (see ASTM E11 for sieve variation [4]). A line was chosen to connect the data points however it is possible that the actual powder size distribution between the sieves does not follow a straight line. To report the diameter at the cumulative mass percent at 10 %, 50 %, and 90 %, linear interpolation was chosen to approximate the powder diameter at these percentages. Thus the D50 for the distribution in Figure 2 is 35 um, or in other words, 50% of the powder mass has a diameter of 35 um or smaller. Table 1 lists the powder diameter for each bucket as determined by sieving. 29 Table 1. The powder diameter determined by sieving for each of the 15 participant buckets of IN625. The 10 %, 50 %, and 90 % cumulative mass percentages are shown along with the average and standard deviation. Bucket # D10 D50 D90 1 20.32 34.85 50.54 2 14.59 34.68 49.82 3 10.59 30.84 48.3 4 22.28 35.4 50.36 5 21.03 36.36 51.5 6 22.15 36.41 51.18 7 16.68 33.29 48.88 8 19.65 33.98 49.33 9 21.14 34.37 49.66 10 14.08 32.28 48.89 11 21.95 36.57 51.48 12 16.12 33.22 48.79 13 13.99 31.79 48.86 14 20.67 35.47 50.98 15 21.69 35.29 50.72 Average = 18.46 34.32 49.95 St D = 3.77 1.74 1.08 IN625 powder size distribution as determined using laser diffraction Table 2 lists the particle size distribution measured using laser diffraction of the 15 buckets of IN625 that were distributed to the participants. The technique involves using isopropanol (IPA) to suspend the powder. The D10, D50, and D90 values are based on a cumulative volume percentage, rather than a cumulative mass percent as is used for sieve analysis. In other words, the D50 for a given powder as determined by laser diffraction indicates 50 % of the powder volume has this diameter size or 30 smaller. The average powder diameter (m) for D10, D50, and D90 are shown at the bottom along with the corresponding standard deviation. Table 2. Powder distribution as determined using laser diffraction for each of the 15 participant buckets of IN625. The diameter at the 10 %, 50 % and 90 % cumulative volume percentages are shown for each bucket along with the average and standard deviation. IN625 Bucket # Label D10 D50 D90 1 A 16.122 28.293 49.243 2 B 14.609 24.723 42.127 3 C 15.752 26.51 44.861 4 D 14.645 25.224 43.875 5 E 14.895 24.908 41.779 6 F 15.321 25.972 43.797 7 G 15.696 27.623 48.657 8 H 15.362 26.554 45.823 9 I 15.642 26.605 45.047 10 J 15.561 27.962 50.103 11 K 17.389 28.396 45.749 12 L 15.39 26.589 45.748 13 M 15.251 26.063 44.773 14 N 15.065 26.152 45.634 15 P 15.336 26.009 44.718 Average 15.469 26.506 45.462 St Dev 0.671 1.146 2.359 31 Figure 3 shows the volume percent versus particle size (m) as determined by laser diffraction for all 15 powder samples. Figure 3. Volume percent versus powder diameter for all 15 samples of IN625 powder. The legend shows a different symbol for each of the 15 buckets. Comments on the size distribution results Although the main goal of this study was not comparing the results of different size distribution techniques, we did want to understand the size distribution of our powder used by the participants. The vendor powder specification reported 98 % of the powder mass should have a diameter of 53 m or smaller. Our sieve results showed that 98 % of the powder mass had a diameter of 58.02m +- 2.72m or smaller. 32 6. TENSION SPECIMENS FABRICATED ON A DIFFERENT LPBF MACHINE During this study, the round robin coordinator identified a willing participant who had a LPBF machine from a different vendor. NIST sent this participant the same powder and the same individual tessellated and slice files to fabricate the parts as sent to the other participants. This participant used the manufacturing plan and the files to duplicate the process parameters in their machine. Upon receiving the build platform with the tensile specimens attached, NIST followed the same post processing procedures to heat treat, extract the specimens, and prepare the specimens for the tension tests. The statistical analysis was conducted on the tension test results, including the specimens from the different LPBF machine. Statistical analysis The yield strength (YS), ultimate tensile strength (UTS), elongation after fracture (A), and 6 test specimens produced by each participant. Figure 4 shows summaries of these results, in the form of boxplots. Each rectangular box comprises the middlemost 50 % of the data, the thick horizontal line within the box marks the median, and the whiskers, if present, extend to the extreme data points. Circles indicate potential outliers: values that lie farther than 1.5 times the inter-quartile range from either the top or bottom sides of a box. As seen in these plots, the tensile properties of the specimens from the last participant (with a different LPBF machine) are clearly different than the properties obtained from the specimens fabricated on the other participants' machines. Therefore, the results from participant #7 were not included in the following statistical analysis. 33 Figure 4. Boxplots of tension test results of the specimens received from all participants. Box plots of measured mechanical properties from all participants including Lab 7. The data from Labs 1 through 6 were used in the statistical analysis. Results from the additional participant, Lab 7, that used a different LPBF machine, are also shown. Values of the following covariates were also reported by almost all participants: energy density, volume rate, layer thickness, and skin power. However, these attributes had only two or three different values, and their values varied between some of the laboratories, but never within a laboratory. The statistical model for the value xi, j of each of the four measurands (YS, UTS, A, and E) measured on test coupon i produced by laboratory j expresses it as an additive superposition of three different effects, xi, j = u++ bj + ei, j. This is called a mixed effects model [5] because u and are treated 34 as fixed effects, and the bj and ei, j are treated as random effects. For YS, for example, u denotes the true value of the yield strength for this material that results from this manufacturing process, is the effect of a particular covariate (for example, energy density), bj is the effect of laboratory j, and ei, j is the effect of this particular coupon, all for j = 1, . . . , n, with n = 6 participants, and i = 1, . . . , mj , where mj = 6 denotes the number of coupons from participant j that were used in the analysis. The fact that the covariates take constant values within laboratories, and that often they take the same values also between laboratories, prevents studying their effects other than one at a time. This is an important weakness of the study that should be avoided in future studies. The {bj} are modeled as independent, Gaussian random variables with mean of 0 and standard deviation , which characterizes the between-laboratory dispersion of values; and the {e1, j , . . . , emj , j} are modeled as independent, Gaussian random variables with mean of 0 and standard deviation j , which characterizes the dispersion of values within laboratory j, and may vary between laboratories. These models were fitted using function lme from the package nlme for the R environment for statistical computing and graphics [6, 7]. Their fit to the data was evaluated via graphical examination of the corresponding estimates of the laboratory and coupon effects. The heterogeneity of the results from the different laboratories may be evaluated in greater detail by applying Q-test to determine whether the standard deviation of the laboratory effects is zero [8]. Table 3 summarizes the results that may be relevant to the design of future, more ambitious interlaboratory studies of additive manufacturing. The between-laboratory range of values, expressed relative to the estimate of the measurand, listed in the column labeled / (%), is a modest 1.3 % to 4.1 %. The between-laboratory variability is substantially (up to 4 times) larger than the typical within-laboratory variability, listed in the column labeled /median({j}), for all measurands except for elongation, whose values are surprisingly uniform across laboratories. 35 Considered one at a time, none of the four covariates (energy density, volume rate, layer thickness, and skin power) had effects significantly different from zero, once the differences between laboratories were taken into account. An analysis based on summary data (averages and standard errors of these averages), where the same mixed effects model was fitted using a different statistical procedure [9], implemented in function rma defined in R package meta for Viechtbauer [10] revealed the following: For yield strength (YS) (E), there is significant between-lab heterogeneity (that is, the standard deviation of the laboratory effects is significantly greater than 0), but Q-test. Only for yield strength is there a slight indication of possible significance of energy density upon mechanical performance, with higher values of the energy density (coefficient of corresponding effect is positive, 0.66, with associated standard uncertainty 0.28) tending to produce greater yield strength. 36 Table 3. Selected results from fitting mixed effects models to the experimental data. The values in the last two columns are the same for all the covariates (to within the number of significant digits quoted) because the variability in the covariates was insufficient to impact the variability of the measured values of the mechanical properties. Estimate Effect / (%) /median ({j}) Energy Density Yield Strength (MPa) 701 0.66 2.4 3.2 Ultimate Tensile Strength (MPa) 1044 0.25 2.0 4.9 Elongation (%) 36.3 -0.01 1.3 0.4 Young's Modulus (GPa) 203 -0.17 3.3 1.5 Volume Rate Yield Strength (MPa) 802 -13 2.1 3.2 Ultimate Tensile Strength (MPa) 1081 -5 1.9 4.9 Elongation (%) 35.1 0.15 1.4 0.4 Young's Modulus (GPa) 177 3.4 3.8 1.5 Layer Thickness Yield Strength (MPa) 816 -1.7 2.1 3.2 Ultimate Tensile Strength (MPa) 1086 -0.64 1.9 4.9 Elongation (%) 35 0.02 1.4 0.4 Young's Modulus (GPa) 174 0.44 3.9 1.5 Skin Power Yield Strength (MPa) 852 -0.36 2.0 3.2 Ultimate Tensile Strength (MPa) 1100 -0.14 1.9 4.9 Elongation (%) 34.6 0.00 1.4 0.4 Young's Modulus (GPa) 164 0.09 4.1 1.5 Fractography analysis Fractography analysis of these specimens was also carried out to understand the differences seen in the tensile test results. A series of scanning electron micrographs were taken of the fracture surface from tensile bar 5 from participant 7. The tensile bar in the following images was stress-relief 37 heat-treated following the same heat treatment followed for the other 6 participants [1]. The build platform was heated to 840 C in 6 h and temperature held at 840 C for 1 h. For comparison purposes, micrographs from a specimen made on the LPBF machine of the other 6 participants are included at the end of this section (Figure 22 to Figure 27). The nature of the fracture surface morphology in the following images showed significant differences compared to a specimen made on the LPBF machine of the other 6 participants [1] (Figure 22 to Figure 27). The surface shows several secondary cracks, some quite large, that appear to be the result of the variability in the LPBF process. The small secondary cracks appear to have initiated near an unmelted powder particle (or other microstructural anomaly) and propagated a short distance into the bulk of the sample (i.e., perpendicular to the primary fracture plane) and arrested. These cracks may be the result of translating a manufacturing plan developed for one LPBF machine for use on a different vendor's LPBF machine. The translation of the manufacturing plan may have resulted in the sub-optimum build producing lower mechanical properties and the observed fracture surface. Figure 5 is a low-magnification view of the surface showing a large flaw in the lower left corner of the tensile specimen cross-section. This flaw appears to be a pore caused by trapped gas and is the most likely initiation point of the primary fracture. At higher magnification (Figure 6 and Figure 7), this area shows that the pore may have originated during the solidification process as unmelted and partially melted powder are clearly observable within. The fracture surface has a number of large secondary cracks aligned in the build direction (Figure 5). During the build, the powder was applied in layers in a horizontal plane. The horizontal secondary cracks may have initiated as interlayer cracks that pulled apart during the tensile loading. However since these cracks appear to be open, it may suggest that they are build related rather than the result of loading. Higher magnification images also show smaller secondary cracks that are in various directions along the surface as well (Figure 8 and Figure 13). 38 Figure 5. Overview of the fracture surface (x23) showing a large flaw in the lower left corner of the specimen and large secondary cracks parallel to build layers. The white box is the region magnified in Figure 8. Figure 6. A low magnification view (x100) of the lower left corner of the specimen showing the flaw (1) and what appears to be a short crack that initiated to the right of a large particle (2). Figure 7. A higher magnification image (x250) showing unmelted and partially melted particles (1) of various sizes trapped within the flaw (2). 39 Figure 8. Higher magnification (x110) of the white box in Figure 5 with secondary cracks (1) and dimple-like microvoids (2). Some cracks are aligned in the build direction while others are not. Figure 9. Higher magnification (x500) of Figure 8 showing similar features to Figure 13. Fine dendritic segregation (1), microvoids (2), a small secondary crack (3), and an unmelted powder particle within the crack (4). The white box is the region magnified in Figure 10. 40 Figure 10. Higher magnification (x1000) of Figure 9 showing a portion of the small crack (1) (labeled 3 in Figure 9) and a microvoid (2) from Figure 9. The fine scaled dendrites can easily be seen across the surface. Figure 11. Another high magnification image (x1500) of the fracture surface showing dendrites. In the center of this image there is a cube shaped formation (1) that appears to be a different nature then the surrounding material and could be crystallographic. Figure 12. This area of the fracture surface shows areas of very consistent dendrite orientation. Figure 13. A small secondary crack (3) is surrounded by fine dendritic segregation (1) and microvoids (2). An unmelted particle is within the crack (4). While the microvoids reflect the ductility observed in the mechanical data, the crack may have contributed to lower overall ductility in this specimen as compared to the specimen representing the other 6 participants. Fine-scaled dendrites, resulting from micro-segregation during the solidification process, are exhibited at region 1 in Figure 13 and these are the most prevalent features on the fracture surface 41 overall. Microvoids, or dimple-like features, are also visible on the surface and they are noted in Figure 13 as region 2. Numerous voids were observed and they ranged in size from extremely fine to quite large. Since many of the observed microvoids are smaller than the diameter of an unmelted powder particle, it is possible these formed around an unmelted powder or contaminate particle during solidification. Microvoids typically form during final fracture (i.e., after necking has initiated in the sample) and indicate ductile failure, which is consistent with the mechanical test data for this specimen. While lower than the results from the other 6 participants, this specimen did demonstrate significant ductility prior to failure. Figure 13 also shows a small secondary crack (region 3). Several secondary cracks, also ranging in size were observed on the fracture surface of this specimen. Most exhibited small, unmelted powder particles near the mouth of the crack, which can be seen in Figure 13 (region 4). These cracks were most likely produced by local variability in the layered solidification process and may have contributed to the reduced strength. Another example of a secondary crack is shown in Figure 14 through Figure 17. The powder particles were examined further and Figure 18 and Figure 20 are high magnification images of partially melted powder from Figure 17. Some evidence of decohesion can be seen between the unmelted powder particle and the surrounding matrix (decohesion at region 2 in Figure 18), which is also consistent with the reduced mechanical properties for this specimen. The particle morphology was relatively spherical. Some evidence of grain structure and fine-scale dendrites is also observable at extremely high magnification (Figure 19 and Figure 21). 42 Figure 14. Figure 5, a low magnification overview (x23) of the fracture surface. The white box is the region magnified in Figure 15. Note the area for Figure 15 with relation to the flaw. Figure 15. Higher magnification (x85) of Figure 14 showing secondary cracks, one with unmelted or partially melted powder particles trapped inside. Note the thin horizontal crack passing through the white box extends from the flaw across most of this image. The white box is the region magnified in Figure 16. Figure 16. Higher magnification (x200) of Figure 15 showing secondary cracks with unmelted or partially Figure 17. A higher magnification view (x400) of the mouth of a secondary crack showing unmelted or 43 melted powder trapped in the mouth of the crack. The thin horizontal crack noted in Figure 15 that extends from the flaw is easier to see. The white box is the region magnified for Figure 17. partially melted powder particles trapped inside. The white box is the region magnified for Figure 18. Figure 18. Partially melted powder at a higher magnification (x2500) from Figure 17. The rough texture on the particle surfaces is produced by rapid solidification during the atomization process (1). There is evidence of decohesion between the unmelted powder particle and the surrounding matrix (2). Figure 19. A high magnification image (x15000) of Figure 18 showing the surface of an unmelted powder particle. The brighter regions are likely second phase precipitates (1) decorating extremely fine grain boundaries (2). 44 Figure 20. Partially melted powder within the secondary crack at a high magnification (x2500) from Figure 17. The rough texture on the particles surface is produced by rapid solidification during the atomization process. Figure 21. The melted region between two partially melted powder particles (x5000) shown in Figure 18. The brighter regions are likely second phase participates decorating extremely fine grain boundaries. The above images represent the microstructure and associated fracture patterns of a specimen fabricated on a different LPBF machine then the other 6 participants. The nature of the fracture surface morphology in these images showed significant differences compared to a specimen made on the LPBF machine of the other 6 participants [1]. The difference in the facture pattern may be the result of translating a manufacturing plan developed for one LPBF machine for use on a different vendor's LPBF machine. The translation of the manufacturing plan may have resulted in the sub-optimum build results exhibited in the above images and in the lower mechanical properties. Figure 22 through Figure 27 show the fractography results from a specimen made using the LPBF machine of the 6 participants. 45 Figure 22. A region of fracture zone (x100) that does not appear to have horizontal secondary cracks related to the build layer but rather localized transgranular cracking in various directions. Figure 23. A group of facets (x500). The white box is the region magnified in Figure 24. These step-like cracks appear to be aligned in the build direction, however they do not appear to be as open as seen with the other specimen (Figure 8 and Figure 17). Figure 24. Several transgranular cleave-like (TCL) facets on the fracture surface (x1000). Figure 25. A different area of the fracture surface (x250). Large TCL facet is in the middle of the 46 image and the top of the facet was chosen to magnify in Figure 26. Figure 26. Dendrites are evident around a secondary crack (x1500). Figure 27. A high magnification image (x3000) of the fracture surface shows primarily dendrites with a transgranular cleavage-like feature. 7. SUMMARY Conducting a round robin study involving a large number of variables requires significant effort to identify and control most, if not all, of these variables. Additive manufacturing processes are examples of such processes with very large, on the order of hundred, number of variable process parameters. Therefore, careful planning is needed to determine the manufacturing plan and collect all necessary information to be able to draw conclusions from the resulting tests. This report presented all the information and documentation shared between the study coordinator (NIST) and each participant during execution of this study. This report also provided an example of using some fixed process parameters on different LPBF machines, which are not intended to necessarily use the same parameters. The test results from the specimens fabricated on a different 47 vendor's LPBF machine showed significant differences both in mechanical properties as well as fracture and microstructure characteristics. These differences are most likely the result of translating a manufacturing plan developed for one LPBF machine for use on a different vendor's machine. The translation of the manufacturing plan may have resulted in the sub-optimum build results. Future studies will take these results into account when setting and applying fixed parameters on different AM platforms. The results indicate that differences between laboratories, even between those that have used the very same parent material and manufacturing process (the only ones considered in the analyses that produced the results summarized in Table 3), generally are considerably more important than differences between coupons manufactured in the same laboratory. This fact suggests that there is more to be gained by increasing the number of participating laboratories, than by increasing the number of coupons manufactured by each laboratory. Future experiments will be designed to enable investigation of the effects that process variables (the covariates considered above and others) have upon the mechanical properties of the resulting parts. To achieve this goal, settings of key process variables should be varied deliberately, over practically significant ranges, both within laboratories and between laboratories, in a suitably designed experiment. For example, one may choose at a minimum two different values for the energy density, but then ensure that the two levels are used in different runs in each laboratory. 8. ACKNOWLEDGEMENTS The authors would like to thank Stephanie Watson, Max Peltz, and Clarissa Ferraris for their laser diffraction powder size analysis. The authors would also like to thank the participants in this study: 48 GE Global Research: Prabhjot Singh, John Deaton, Laura Dial Honeywell Aerospace: Donald Godfrey, Bob Rasmussen, Brian Baughman Arizona Commerce Authority: Dan Franklin University of Louisville: Tim Gornet, Brent Stucker, Gary Graf, Matt Taylor Western Illinois University-Quad City Manufacturing Lab: Eric Faierson Picatinny Arsenal: Stacey Kerwien, Elias Jelis, Matthew Clemente, Dave Dekmar, Sr. Aberdeen Proving Ground: Rick Moore, Lester Hitch 9. REFERENCES [1] Brown, C.U., Jacob, G., Stoudtfor nickel alloy 625 made by laser powder bed fusion additive manufacturing to assess mechanical prop [2] ASTM Standard E8/E8M-13a, Standard Test Method for Tension Testing of Metallic Materials, ASTM International, West Conshohocken, PA, USA, 2013. [3] ASTM Standard B214-15, Standard Test Method for Sieve Analysis of Metal Powders, ASTM International, West Conshohocken, PA, USA, 2015. [4] ASTM Standard E11-15, Standard Specification for Woven Wire Test Sieve Cloth and Test Sieves, ASTM International, West Conshohocken, PA, USA, 2015. [5] Pinheiro, J.C. and Bates, D.M., Mixed-Effects Models in S and S-Plus Springer-Verlag, New York, NY, 2000. 49 [6] Pinheiro, J., Bates, D., DebRoy, S., Sarkar, D., and R Core Teamnlme: Linear and Nonlinear Mixed Effects Models, 2015. URL http://CRAN.R-project.org/package=nlme. R package version 3.1-120. [7] R Core Team, R: A Language and Environment for Statistical Computing R Foundation for Statistical Computing, Vienna, Austria, 2015. URL http://www.R-project.org/. [8] Hedges, L. V. and Olkin, IStatistical Methods for Meta- Academic Press, San Diego, CA, 1985. [9] DerSimonian, R. and LairdMeta-analysis in clinical trials Controlled Clinical Trials, 7(3):177188, September 1986. [10] Viechtbauer, W, Conducting meta-analyses in R with the metafor package Journal of Statistical Software, 36(3):148, 2010. URL http://www.jstatsoft.org/v36/i03/. 50 APPENDIX COPY OF THE 7 PROCESS CONTROL DOCUMENTS RETURNED BY THE PARTICIPANTS Participant 1 PCD Process Control Document Technical Data Part Manufacturing Technical Data Completed by the part manufacturer Value Requirement Section Approval Job Number Build File Name: AM_Round Robin_Inconel 625 1.2 Process Laser Powder Bed Fusion 2.1.1 Equipment Manufacturer and Model: EOS EOSINT M270D 2.1.2 Equipment Serial Number: SI978 Laser Manufacturer and Model: H0911286 2.1.4 Laser Serial Number: 1212-0163 Software Version: PSW Version 3.5 (Build 64) 2.2 Date of last preventative maintenance 02/04/14 2.3 System Calibration Current yes 2.4 Material Requirements Verify Powder Heat/Lot Loaded Matches Feedstock Technical Data Containers #2 and #15 Material Condition (Virgin/Recycled) Virgin 3.4 Process Setup Requirements Build Platform Material New Plate PN: 2200-4372 4.1.1 51 Build Platform Thickness 22.15 mm 4.1.2 Build Platform Condition New Plate Cleaned 4.1.3 Build Platform Preheat, degC 80 C 4.1.4 Recoater Blade Material/Part Number Ceramic, PN: 2200-3013 4.2 Process Parameter Settings Base Parameter Set EOS MP1 4.3.1 Base Parameter Filename MP1_Surface_101 Layer Thickness 20 4.3.2 Sort Parts Method: - 4.3.4.2 Exposure Parameters Complete Exposure Parameters Table Below 4.3.5 Pre Contour Type NIST_RR_IN625_PreContour 4.3.5.1 Skin Exposure Type NIST_RR_IN625_OuterSkin 4.3.5.2 Core Exposure Type NIST_RR_IN625_InnerSkin 4.3.5.3 Post Contour Type NIST_RR_IN625_Postcontour 4.3.5.4 Skin Thickness (x/y), mm 3.00 4.3.5.5 Skin Thickness (z), mm 3.00 4.3.5.6 Base Radius: 0.00 4.3.5.7 Core open to platform?: No (unchecked) 4.3.5.8 Skin/Core: Yes (checked) 4.3.5.9 Scaling and Offset Material Specific Scaling X, % Y, % Part Specific Undersize/Oversize Beam Offset, mm 0 4.3.6.3 0 0 4.3.6.1 0 0 4.3.6.2 Building Screen Start Height (mm): 0.02 4.3.7.1 Final Height (mm): 9.180 4.3.7.2 Layer Thickness 0.020 mm 4.3.2 DMLS Settings DMLS Off Range, (mm) Pre-exposure On 0.06 Range, (mm) 4.3.8.1 4.3.8.2 52 Recoating Screen Minimum Charge, % 150 Maximum Charge, % 200 Dosing Boost, % 300 Recoating Speeds (mm/s) Recoating Speed 1 Recoating Speed 2 4.3.9.4, 4.3.9.5 Dosing Boost, % 500 mm/s 80 mm/s Lower Dispenser Platform Contact-free outward travel 1.00 mm 4.3.9.6 Yes, (checked) 4.3.9.7 Build Time Estimation 18:42:36 Build Chamber Environment 0 Purge Gas Used Nitrogen 4.4.1 Purge Gas Source Nitrogen Generator 4.4.1 Flow Rates 5.48 bar, 1.50 V 4.4.2 Filtration Enabled 4.4.3 Oxygen Set Point 1.3% 4.4.4 Quality Control Checks at Build Start System Maintenance and Cleaning Performed Cleaned 4.5.1 Pre Build Laser Power Measurement Setpoint Display Measured Pre Contour Stripes 4.5.2 Up Skin Down Skin Post Contour Edges Build Platform Leveling Complete Yes 4.5.3 Platform Temperature 80.0 C 4.5.6 Platform Level Build Platform Z = 1.190 mm Oxygen Level 0.88% 4.5.7 In Process Requirements Limits Max Limit Min Limit Max Measured Build Start Time 08 04 14 14:30 Build Interruptions None 5.2 53 (If Yes, Attach Documentation per 5.2) Process Completion Platform Temperature at Time of Chamber Opening 28.0 C 6.1.1,6.1.2 Chamber Oxygen Prior to Opening 2.00% 6.1.2 Recovered Powder Labeling Yes 6.2 Post Build Laser Power Measurement Setpoint Display Measured Pre Contour Stripes 6.1.5 Up Skin Down Skin Post Contour Edges Exposure Parameters Completed by the part manufacturer Value Requirement Section Approval Job Number Build File Name: AM_Round Robin_Inconel 625 Pre Exposure Pre Exposure Type NIST_RR_IN625_PreContour 4.3.5.1 First Contour Standard OnPart Downskin 4.3.5.1.1 Speed (mm/s): 900.0 800.0 1600.0 Power (W): 100.0 100.0 100.0 Beam Offset (mm): 0.000 Contour Yes (checked) 54 Thickness (mm): 0.040 Post Contour No (unchecked) Corridor (mm): 0.040 Second Contour Standard OnPart Downskin 4.3.5.1.2 Speed (mm/s): - - - Power (W): - - - Beam Offset (mm): - Contour No (unchecked) Thickness (mm): - Post Contour No (unchecked) Corridor (mm): - Edges Edge factor - Edges No(unchecked) 4.3.5.1.3 Threshold: - Post Edge No(unchecked) Minimum radius factor: - Beam offset (mm): - Speed (mm/s): - Power (W): - Skin Exposure Skin Exposure Type NIST_RR_IN625_OuterSkin 4.3.5.2 Stripes Distance (mm): 0.10 Stripe width (mm): 4.00 4.3.5.2.1 Speed (mm/s): 800.0 Stripes overlap (mm): 0.10 Power (W): 195.0 Skywriting: Yes(checked) Beam offset (mm) 0.030 Offset: Yes(checked) Hatching, X Yes(checked) Alternating: Yes(checked) Hatching, Y Yes(checked) Rotating: Yes(checked) UpDown Upskin Downskin 4.3.5.2.2 Distance (mm): 0.05 0.05 Speed (mm): 800.0 3000.0 55 Power (W): 195.0 195.0 Thickness (mm): 0.00 0.04 X: Yes(checked) Yes(checked) Y: Yes(checked) Yes(checked) Alternating: No (unchecked) Overlap with inskin(mm): 0.10 Skywriting: Yes (checked) Min. length (mm) 2.00 Skip Layer Skipped Layers 0 4.3.5.2.3 Offset layers: 0 Expose first layer: Yes (checked) Core Exposure Core Exposure Type NIST_RR_IN625_InnerSkin 4.3.5.3 Chess Squares Gap Distance (mm): 0.10 0.10 Speed (mm/s): 800.0 800.0 Power (W): 195.0 195.0 Width (mm): 8.00 0.00 Beam offset (mm) -0.050 Overlap: 0.08 Hatching, X: Yes (checked) Alternating: Yes (checked) Hatching, Y: Yes (checked) Rotating: Yes (checked) Skywriting: No (unchecked) Rotated Angle: - Offset: Yes(checked) Post Exposure Post Exposure Type NIST_RR_IN625_Postcontour 4.3.5.4 First Contour Standard OnPart Downskin 4.3.5.4.1 Speed (mm/s): 900.0 800.0 1600.0 Power (W): 120.0 120.0 120.0 56 Beam Offset (mm): 0.015 Contour Yes (checked) Thickness (mm): 0.040 Post Contour Yes (checked) Corridor (mm): 0.040 Second Contour Standard OnPart Downskin 4.3.5.4.2 Speed (mm/s): - - - Power (W): - - - Beam Offset (mm): - Contour No (unchecked) Thickness (mm): - Post Contour No (unchecked) Corridor (mm): - Edges Edge factor 2.00 Edges Yes(checked) 4.3.5.4.3 Threshold: 3.0 Post Edge Yes(checked) Minimum radius factor: 0.00 Beam offset (mm): 0.000 Speed (mm/s): 900.0 Power (W): 100.0 57 Participant 2 PCD 58 59 60 61 62 63 64 Participant 3 PCD: 65 66 67 68 69 70 71 Participant 4 PCD: Process Control Document Technical Data Part Manufacturing Technical Data Completed by the part manufacturer Value Requirement Section Approval Job Number 8-11-2014 Build File Name: IN625NISTROUNDROBIN.eosjob 1.2 Process DMLS 2.1.1 Equipment Manufacturer and Model: EOSINT M270 2.1.2 Equipment Serial Number: SI 987 Laser Manufacturer and Model: 2.1.4 Laser Serial Number: Software Version: PSW 3.6 2.2 Date of last preventative maintenance May 28 2.3 System Calibration Current May 28 2.4 Material Requirements Verify Powder Heat/Lot Loaded Matches Feedstock Technical Data Use SEM with EDS to verify the powder met specification Material Condition (Virgin/Recycled) Virgin 3.4 Process Setup Requirements Build Platform Material 1045 steel 4.1.1 Build Platform Thickness ~20mm 4.1.2 Build Platform Condition Good 4.1.3 72 Build Platform Preheat, degC 80degC 4.1.4 Recoater Blade Material/Part Number EOS ceramic blade 4.2 Process Parameter Settings Base Parameter Set MP1 Performance 4.3.1 Base Parameter Filename MP1_Performance_101.eosjob Layer Thickness 40 4.3.2 Sort Parts Method: 4.3.4.2 Exposure Parameters Complete Exposure Parameters Table Below 4.3.5 Pre Contour Type 4.3.5.1 Skin Exposure Type 4.3.5.2 Core Exposure Type 4.3.5.3 Post Contour Type 4.3.5.4 Skin Thickness (x/y), mm 4.3.5.5 Skin Thickness (z), mm 4.3.5.6 Base Radius: 4.3.5.7 Core open to platform?: 4.3.5.8 Skin/Core: 4.3.5.9 Scaling and Offset .032 Material Specific Scaling X, %.19 Y, %.23 Part Specific Undersize/Oversize Beam Offset, mm 4.3.6.3 4.3.6.1 4.3.6.2 Building Screen Start Height (mm): 4.3.7.1 Final Height (mm): 4.3.7.2 Layer Thickness 4.3.2 DMLS Settings DMLS Off Range, (mm) Pre-exposure On Range, (mm) 4.3.8.1 4.3.8.2 Recoating Screen Minimum Charge, % 120 Maximum Charge, % 150 Dosing Boost, % 300 73 Recoating Speeds (mm/s) Recoating Speed 1 Recoating Speed 2 4.3.9.4, 4.3.9.5 Dosing Boost, % Lower Dispenser Platform Contact-free outward travel 4.3.9.6 4.3.9.7 Build Time Estimation ~11 hours Build Chamber Environment Good 0 Purge Gas Used Nitrogen 4.4.1 Purge Gas Source Compressed Air 4.4.1 Flow Rates 4.4.2 Filtration 1.5setting, not clogged 4.4.3 Oxygen Set Point 1.3wt% 4.4.4 Quality Control Checks at Build Start System Maintenance and Cleaning Performed 4.5.1 Pre Build Laser Power Measurement Setpoint Display Measured Pre Contour Stripes 4.5.2 Up Skin Down Skin Post Contour Edges Build Platform Leveling Complete 4.5.3 Platform Temperature 4.5.6 Platform Level Oxygen Level 4.5.7 In Process Requirements Limits Max Limit Min Limit Max Measured Build Start Time 12pm Aug. 11 Build Interruptions (If Yes, Attach Documentation per 5.2) No 5.2 Process Completion 74 Platform Temperature at Time of Chamber Opening 6.1.1,6.1.2 Chamber Oxygen Prior to Opening The chamber was opened several hours after build was completed 6.1.2 Recovered Powder Labeling 6.2 Post Build Laser Power Measurement Setpoint Display Measured Pre Contour Stripes 6.1.5 Up Skin Down Skin Post Contour Edges Exposure Parameters Completed by the part manufacturer Value Requirement Section Approval Job Number Build File Name: Pre Exposure Pre Exposure Type 4.3.5.1 First Contour Standard OnPart Downskin 4.3.5.1.1 Speed (mm/s): Power (W): Beam Offset (mm): Contour Thickness (mm): Post Contour Corridor (mm): Second Contour Standard OnPart Downskin 4.3.5.1.2 Speed (mm/s): Power (W): 75 Beam Offset (mm): Contour Thickness (mm): Post Contour Corridor (mm): Edges Edge factor Edges 4.3.5.1.3 Threshold: Post Edge Minimum radius factor: Beam offset (mm): Speed (mm/s): Power (W): Skin Exposure Skin Exposure Type 4.3.5.2 Stripes Distance (mm): Stripe width (mm): 4.3.5.2.1 Speed (mm/s): Stripes overlap (mm): Power (W): Skywriting: Beam offset (mm) Offset: Hatching, X Alternating: Hatching, Y Rotating: UpDown Upskin Downskin 4.3.5.2.2 Distance (mm): Speed (mm): Power (W): Thickness (mm): X: Y: Alternating: Overlap with inskin(mm): 76 Skywriting: Min. length (mm) Skip Layer Skipped Layers 4.3.5.2.3 Offset layers: Expose first layer: Core Exposure Core Exposure Type 4.3.5.3 Chess Squares Gap Distance (mm): Speed (mm/s): Power (W): Width (mm): Beam offset (mm) Overlap: Hatching, X: Alternating: Hatching, Y: Rotating: Skywriting: Rotated Angle: Offset: Post Exposure Post Exposure Type 4.3.5.4 First Contour Standard OnPart Downskin 4.3.5.4.1 Speed (mm/s): Power (W): Beam Offset (mm): Contour Thickness (mm): Post Contour Corridor (mm): Second Contour Standard OnPart Downskin 4.3.5.4.2 Speed (mm/s): Power (W): 77 Beam Offset (mm): Contour Thickness (mm): Post Contour Corridor (mm): Edges Edge factor Edges 4.3.5.4.3 Threshold: Post Edge Minimum radius factor: Beam offset (mm): Speed (mm/s): Power (W): 78 Participant 5 PCD Process Control Document Technical Data Part Manufacturing Technical Data Completed by the part manufacturer: September 16th 2014 Value Requirement Section Approval Job Number Build File Name: AM_Round Robin_Inconel 625 1.2 GJ Process Laser Powder Bed Fusion 2.1.1 GJ Equipment Manufacturer and Model: EOS M270, year of production: 2010 2.1.2 GJ Equipment Serial Number: 992 GJ Laser Manufacturer and Model: IPG, YLR-200-SM-EOS 2.1.4 GJ Laser Serial Number: 10061428 GJ Software Version: PSW, Version 3.5 (Build 71) 2.2 GJ Date of last preventative maintenance June 2nd unit June 6th 2014 performed by Mr. Jay Thornburg 2.3 GJ System Calibration Current August 22nd 2014 2.4 GJ Material Requirements Verify Powder Heat/Lot Loaded Matches Feedstock Technical Data EOS_IN625 Lot. No.: 1112012 Buckets: #4 and #12 GJ Material Condition (Virgin/Recycled) virgin 3.4 GJ Process Setup Requirements Build Platform Material AlSi 1045 steel, charge no.: 2200 - 4372 4.1.1 GJ Build Platform Thickness 22.4 mm 4.1.2 GJ Build Platform Condition Virgin, unused 4.1.3 GJ Build Platform Preheat, degC 80 4.1.4 GJ 79 Recoater Blade Material/Part Number HSS 2200_3013 4.2 GJ Process Parameter Settings Base Parameter Set NIST: MP1_020_100_IN625_020_NIST_V1.eosjob 4.3.1 GJ Base Parameter Filename EOS_MP1_020_100_Surface GJ Layer Thickness 20 4.3.2 GJ Sort Parts Method: Group: alternating between front to back 4.3.4.2 GJ Exposure Parameters Complete Exposure Parameters Table Below 4.3.5 Pre Contour Type NIST_PreContour_RR_IN625 4.3.5.1 GJ Skin Exposure Type NIST_OuterSkin_RR_IN625 4.3.5.2 GJ Core Exposure Type NIST_InnterSkin_RR_IN625 4.3.5.3 GJ Post Contour Type NIST_PreContour_RR_IN625 4.3.5.4 GJ Skin Thickness (x/y), mm 3.00 4.3.5.5 GJ Skin Thickness (z), mm 3.00 4.3.5.6 GJ Base Radius: 0.00 4.3.5.7 GJ Core open to platform?: No 4.3.5.8 GJ Skin/Core: Yes 4.3.5.9 GJ Scaling and Offset Material Specific Scaling X, 0.209% Y, 0.375% GJ Part Specific Undersize/Oversize Beam Offset, mm 0.048 4.3.6.3 0.00 4.3.6.1 GJ 0.00 4.3.6.2 GJ Building Screen Start Height (mm): 0.02 4.3.7.1 GJ Final Height (mm): 9.16 4.3.7.2 GJ Layer Thickness (mm) 0.02 4.3.2 GJ DMLS Settings DMLS Off --- Range, (mm) Pre-exposure On 0.06 Range, (mm) 4.3.8.1 GJ 4.3.8.2 GJ Recoating Screen Minimum Charge, % 150 GJ Maximum Charge, % 200 GJ Dosing Boost, % 300 GJ Recoating Speeds (mm/s) Recoating Speed 1: 500 Recoating Speed 2: 80 4.3.9.4, 4.3.9.5 80 Dosing Boost, % Lower Dispenser Platform Contact-free outward travel 1.00 mm 4.3.9.6 GJ Yes 4.3.9.7 Build Time Estimation 18:47 (hh:mm) GJ Build Chamber Environment 0 Purge Gas Used Nitrogen 4.4.1 GJ Purge Gas Source Nitrogen generator 4.4.1 GJ Flow Rates --- 4.4.2 Filtration 1.5 4.4.3 GJ Oxygen Set Point 1.3 % 4.4.4 GJ Quality Control Checks at Build Start System Maintenance and Cleaning Performed Yes 4.5.1 GJ Pre Build Laser Power Measurement Not performed before the RR build started. (But after the build was finished and the lens cleaned) Display Measured Sep. 18th Pre Contour 100 20 sec. 101.5 W Stripes 195 20 sec. 4.5.2 196.8 W Up Skin 195 20 sec. 197.8 W Down Skin 195 20 sec. 196.1 W Post Contour 120 20 sec. 118.7 W Edges 100 20 sec. 101.9 W Build Platform Leveling Complete Yes 4.5.3 GJ Platform Temperature 81 degC 4.5.6 GJ Platform Level --- Oxygen Level 0.9 % 4.5.7 GJ In Process Requirements Limits Max Limit Min Limit Max Measured Build Start Time 04:30 PM Sep. 16th 2014 Build Interruptions (If Yes, Attach Documentation per 5.2) No interruptions Successfully finished 5.2 GJ Process Completion Platform Temperature at Time of Chamber Opening 80 6.1.1,6.1.2 GJ Chamber Oxygen Prior to Opening 0.5 6.1.2 GJ 81 Recovered Powder Labeling Yes 6.2 GJ Post Build Laser Power Measurement Setpoint (After the was finished and the lens untouched) Display Measured Sep. 18th Pre Contour 100 20 sec. 100.8 W Stripes 195 20 sec. 6.1.5 194.4 W Up Skin 195 20 sec. 195.8 W Down Skin 195 20 sec. 196.2 W Post Contour 120 20 sec. 119.4 W Edges 100 20 sec. 101.5 W Exposure Parameters Completed by the part manufacturer: September 16th 2014 Value Requirement Section Approval Job Number --- Build File Name: AM_Round Robin_Inconel 625.eosjob Pre Exposure Pre Exposure Type NIST_PreContour_RR_IN625 4.3.5.1 First Contour Standard OnPart Downskin 4.3.5.1.1 Speed (mm/s): 900.0 800.0 1600.0 Power (W): 100.0 100.0 100.0 Beam Offset (mm): 0.000 Contour Yes Thickness (mm): 0.040 Post Contour No Corridor (mm): 0.040 Second Contour Standard OnPart Downskin 4.3.5.1.2 Speed (mm/s): 50 50 50 Power (W): 0 0 0 Beam Offset (mm): 0.000 Contour No Thickness (mm): 0.040 Post Contour No 82 Corridor (mm): 0.040 Edges Edge factor 2.0 Edges No 4.3.5.1.3 Threshold: 3.0 Post Edge No Minimum radius factor: 0.000 Beam offset (mm): 0.000 Speed (mm/s): 50 Power (W): 0 Skin Exposure Type NIST_OuterSkin_RR_IN625 4.3.5.2 Stripes Distance (mm): 0.10 Stripe width (mm): 4.00 4.3.5.2.1 Speed (mm/s): 800.0 Stripes overlap (mm): 0.10 Power (W): 195 Skywriting: Yes Beam offset (mm) 0.030 Offset: Yes Hatching, X Yes Alternating: Yes Hatching, Y Yes Rotating: Yes Rot. Angle: 67 deg UpDown Upskin Downskin 4.3.5.2.2 Distance (mm): 0.05 0.05 Speed (mm): 800.0 3000.0 Power (W): 195.0 195.0 Thickness (mm): 0.00 0.04 X: Yes Yes Y: Yes Yes Alternating: No Overlap with inskin(mm): 0.10 Skywriting: Yes Min. length (mm) 2.00 Skip Layer Skipped Layers 0 4.3.5.2.3 83 Offset layers: 0 Expose first layer: Yes Core Exposure Type NIST_InnterSkin_RR_IN625 4.3.5.3 Chess Squares Gap 4.3.5.3.1 Distance (mm): 0.10 0.10 Speed (mm/s): 800.0 800.0 Power (W): 195.0 195.0 Width (mm): 8.00 0.00 Beam offset (mm) -0.050 Overlap: 0.08 Hatching, X: Yes Alternating: Yes Hatching, Y: Yes Rotating: Yes Skywriting: No Rotated Angle: 67 deg Offset: Yes Skip Layer Skipped Layers 1 4.3.5.3.2 Offset layers: 0 Expose first layer: Yes Post Exposure Type NIST_PreContour_RR_IN625 4.3.5.4 First Contour Standard OnPart Downskin 4.3.5.4.1 Speed (mm/s): 900.0 800.0 1600.0 Power (W): 120.0 120.0 120.0 Beam Offset (mm): 0.015 Contour Yes Thickness (mm): 0.040 Post Contour Yes Corridor (mm): 0.040 Second Contour Standard OnPart Downskin 4.3.5.4.2 84 Speed (mm/s): 50 50 50 Power (W): 0 0 0 Beam Offset (mm): 0 Contour No Thickness (mm): 0.06 Post Contour No Corridor (mm): 0.04 Edges Edge factor 2.00 Edges Yes 4.3.5.4.3 Threshold: 3.0 Post Edge Yes Minimum radius factor: 0.00 Beam offset (mm): 0.000 Speed (mm/s): 900.0 Power (W): 100.0 85 Participant 6 PCD: Process Control Document Technical Data Part Manufacturing Technical Data Completed by the part manufacturer Value Requirement Section Approval Job Number Build File Name: NIST_RoundRobbin_IN625 1.2 Process 2.1.1 Equipment Manufacturer and Model: EOS INT M270D 2.1.2 Equipment Serial Number: 1088 Laser Manufacturer and Model: IPG Laser YLR-200-SM 2.1.4 Laser Serial Number: Software Version: PSW 3.5 (71) 2.2 Date of last preventative maintenance September 2014 2.3 System Calibration Current yes 2.4 Material Requirements Verify Powder Heat/Lot Loaded Matches Feedstock Technical Data EOS Nickel Alloy IN 625 LOT M111201-2 Bucket #1 and #10 Material Condition (Virgin/Recycled) Virgin 3.4 Process Setup Requirements Build Platform Material NIST provided 4.1.1 Build Platform Thickness 4.1.2 Build Platform Condition 4.1.3 86 Build Platform Preheat, degC 4.1.4 Recoater Blade Material/Part Number 4.2 Process Parameter Settings Base Parameter Set 4.3.1 Base Parameter Filename 20 4.3.2 Sort Parts Method: 4.3.4.2 Exposure Parameters Complete Exposure Parameters Table Below 4.3.5 Pre Contour Type 4.3.5.1 Skin Exposure Type 4.3.5.2 Core Exposure Type 4.3.5.3 Post Contour Type 4.3.5.4 Skin Thickness (x/y), mm 4.3.5.5 Skin Thickness (z), mm 4.3.5.6 Base Radius: 4.3.5.7 Core open to platform?: 4.3.5.8 Skin/Core: 4.3.5.9 Scaling and Offset 0% Material Specific Scaling X, 0% Y,0 % Part Specific Undersize/Oversize Beam Offset, mm 0 4.3.6.3 0 0 0 4.3.6.1 4.3.6.2 Building Screen Start Height (mm): .020mm 4.3.7.1 Final Height (mm): 9.180mm 4.3.7.2 Layer Thickness .020mm 4.3.2 DMLS Settings DMLS Off Range, (mm) Pre-exposure On Range, (mm) 4.3.8.1 4.3.8.2 Recoating Screen Minimum Charge, % 150% Maximum Charge, % 200% Dosing Boost, % 300% 87 Recoating Speeds (mm/s) Recoating Speed 1 500 mm/s Recoating Speed 2 80 mm/s 4.3.9.4, 4.3.9.5 Dosing Boost, % Lower Dispenser Platform Contact-free outward travel 4.3.9.6 4.3.9.7 Build Time Estimation Build Chamber Environment 0 Purge Gas Used nitrogen 4.4.1 Purge Gas Source Internal generator 4.4.1 Flow Rates 4.4.2 Filtration 4.4.3 Oxygen Set Point 4.4.4 Quality Control Checks at Build Start System Maintenance and Cleaning Performed 4.5.1 Pre Build Laser Power Measurement Setpoint Display Measured Pre Contour Stripes 4.5.2 Up Skin Down Skin Post Contour Edges Build Platform Leveling Complete 4.5.3 Platform Temperature 4.5.6 Platform Level Oxygen Level 4.5.7 In Process Requirements Limits Max Limit Min Limit Max Measured Build Start Time Build Interruptions (If Yes, Attach Documentation per 5.2) Build stopped numerous times. Once for an early blade impact and twice for short feeding. Adjustments were made to correct. 5.2 88 Process Completion Platform Temperature at Time of Chamber Opening 6.1.1,6.1.2 Chamber Oxygen Prior to Opening 6.1.2 Recovered Powder Labeling 6.2 Post Build Laser Power Measurement Setpoint Display Measured Pre Contour Stripes 6.1.5 Up Skin Down Skin Post Contour Edges Exposure Parameters Completed by the part manufacturer Value Requirement Section Approval Job Number Build File Name: Pre Exposure Pre Exposure Type 4.3.5.1 First Contour Standard OnPart Downskin 4.3.5.1.1 Speed (mm/s): Power (W): Beam Offset (mm): Contour Thickness (mm): Post Contour Corridor (mm): Second Contour Standard OnPart Downskin 4.3.5.1.2 Speed (mm/s): 89 Power (W): Beam Offset (mm): Contour Thickness (mm): Post Contour Corridor (mm): Edges Edge factor Edges 4.3.5.1.3 Threshold: Post Edge Minimum radius factor: Beam offset (mm): Speed (mm/s): Power (W): Skin Exposure Skin Exposure Type 4.3.5.2 Stripes Distance (mm): Stripe width (mm): 4.3.5.2.1 Speed (mm/s): Stripes overlap (mm): Power (W): Skywriting: Beam offset (mm) Offset: Hatching, X Alternating: Hatching, Y Rotating: UpDown Upskin Downskin 4.3.5.2.2 Distance (mm): Speed (mm): Power (W): Thickness (mm): X: Y: 90 Alternating: Overlap with inskin(mm): Skywriting: Min. length (mm) Skip Layer Skipped Layers 4.3.5.2.3 Offset layers: Expose first layer: Core Exposure Core Exposure Type 4.3.5.3 Chess Squares Gap Distance (mm): Speed (mm/s): Power (W): Width (mm): Beam offset (mm) Overlap: Hatching, X: Alternating: Hatching, Y: Rotating: Skywriting: Rotated Angle: Offset: Post Exposure Post Exposure Type 4.3.5.4 First Contour Standard OnPart Downskin 4.3.5.4.1 Speed (mm/s): Power (W): Beam Offset (mm): Contour Thickness (mm): Post Contour Corridor (mm): Second Contour Standard OnPart Downskin 4.3.5.4.2 91 Speed (mm/s): Power (W): Beam Offset (mm): Contour Thickness (mm): Post Contour Corridor (mm): Edges Edge factor Edges 4.3.5.4.3 Threshold: Post Edge Minimum radius factor: Beam offset (mm): Speed (mm/s): Power (W): 92 Participant 7 PCD Process Control Document Technical Data Part Manufacturing Technical Data Completed by the part manufacturer Value Requirement Section Approval Job Number Build File Name: 1.2 Process 2.1.1 Equipment Manufacturer and Model: 2.1.2 Equipment Serial Number: Laser Manufacturer and Model: 2.1.4 Laser Serial Number: Software Version: 2.2 Date of last preventative maintenance 2.3 System Calibration Current 2.4 Material Requirements Verify Powder Heat/Lot Loaded Matches Feedstock Technical Data Material Condition (Virgin/Recycled) 3.4 Process Setup Requirements Build Platform Material 4.1.1 Build Platform Thickness 4.1.2 Build Platform Condition 4.1.3 93 Build Platform Preheat, degC 4.1.4 Recoater Blade Material/Part Number 4.2 Process Parameter Settings Base Parameter Set 4.3.1 Base Parameter Filename Layer Thickness 4.3.2 Sort Parts Method: 4.3.4.2 Exposure Parameters Complete Exposure Parameters Table Below 4.3.5 Pre Contour Type 4.3.5.1 Skin Exposure Type 4.3.5.2 Core Exposure Type 4.3.5.3 Post Contour Type 4.3.5.4 Skin Thickness (x/y), mm 4.3.5.5 Skin Thickness (z), mm 4.3.5.6 Base Radius: 4.3.5.7 Core open to platform?: 4.3.5.8 Skin/Core: 4.3.5.9 Scaling and Offset Material Specific Scaling X, % Y, % Part Specific Undersize/Oversize Beam Offset, mm 4.3.6.3 4.3.6.1 4.3.6.2 Building Screen Start Height (mm): 4.3.7.1 Final Height (mm): 4.3.7.2 Layer Thickness 4.3.2 DMLS Settings DMLS Off Range, (mm) Pre-exposure On Range, (mm) 4.3.8.1 4.3.8.2 Recoating Screen Minimum Charge, % Maximum Charge, % Dosing Boost, % 94 Recoating Speeds (mm/s) Recoating Speed 1 Recoating Speed 2 4.3.9.4, 4.3.9.5 Dosing Boost, % Lower Dispenser Platform Contact-free outward travel 4.3.9.6 4.3.9.7 Build Time Estimation Build Chamber Environment 0 Purge Gas Used 4.4.1 Purge Gas Source 4.4.1 Flow Rates 4.4.2 Filtration 4.4.3 Oxygen Set Point 4.4.4 Quality Control Checks at Build Start System Maintenance and Cleaning Performed 4.5.1 Pre Build Laser Power Measurement Setpoint Display Measured Pre Contour Stripes 4.5.2 Up Skin Down Skin Post Contour Edges Build Platform Leveling Complete 4.5.3 Platform Temperature 4.5.6 Platform Level Oxygen Level 4.5.7 In Process Requirements Limits Max Limit Min Limit Max Measured Build Start Time Build Interruptions (If Yes, Attach Documentation per 5.2) 5.2 Process Completion 95 Platform Temperature at Time of Chamber Opening 6.1.1,6.1.2 Chamber Oxygen Prior to Opening 6.1.2 Recovered Powder Labeling 6.2 Post Build Laser Power Measurement Setpoint Display Measured Pre Contour Stripes 6.1.5 Up Skin Down Skin Post Contour Edges Exposure Parameters Completed by the part manufacturer Value Requirement Section Approval Job Number Build File Name: 20140916.SLM Pre Exposure Pre Exposure Type 4.3.5.1 First Contour (Volume Border) Standard OnPart Downskin 4.3.5.1.1 Speed (mm/s): 400 Power (W): 125 Beam Offset (mm): 3.0 Contour Thickness (mm): .05 Post Contour Corridor (mm): Second Contour Standard OnPart Downskin 4.3.5.1.2 Speed (mm/s): Power (W): 96 Beam Offset (mm): Contour Thickness (mm): Post Contour Corridor (mm): Edges Edge factor Edges 4.3.5.1.3 Threshold: Post Edge Minimum radius factor: Beam offset (mm): Speed (mm/s): Power (W): Skin Exposure Skin Exposure Type 4.3.5.2 Stripes Distance (mm): Stripe width (mm): 4.3.5.2.1 Speed (mm/s): Stripes overlap (mm): Power (W): Skywriting: Beam offset (mm) Offset: Hatching, X Alternating: Hatching, Y Rotating: UpDown Upskin Downskin 4.3.5.2.2 Distance (mm): Speed (mm): Power (W): Thickness (mm): X: Y: Alternating: Overlap with inskin(mm): 97 Skywriting: Min. length (mm) Skip Layer Skipped Layers 4.3.5.2.3 Offset layers: Expose first layer: Core Exposure Core Exposure Type 4.3.5.3 Chess (Volume Area) Squares Gap Distance (mm): Speed (mm/s): 500 Power (W): 200 Width (mm): Beam offset (mm) 3.0 Overlap: Hatching, X: 0.110 Alternating: Hatching, Y: Rotating: Skywriting: Rotated Angle: Offset: Post Exposure Post Exposure Type 4.3.5.4 First Contour (Volume Offset) Standard OnPart Downskin 4.3.5.4.1 Speed (mm/s): 400 Power (W): 100 Beam Offset (mm): 4.0 Contour Thickness (mm): Post Contour Corridor (mm): Second Contour Standard OnPart Downskin 4.3.5.4.2 Speed (mm/s): Power (W): 98 Beam Offset (mm): Contour Thickness (mm): Post Contour Corridor (mm): Edges Edge factor Edges 4.3.5.4.3 Threshold: Post Edge Minimum radius factor: Beam offset (mm): Speed (mm/s): Power (W):", "title": "Supplementary information for a round robin study of additively manufactured nickel alloy (IN625) tension specimens", "url": "http://www.nist.gov/manuscript-publication-search.cfm?pub_id=919811", "proceedings": "", "location": "", "published": "April 05, 2016", "issue": ""}