{"motivation": "\"for his discoveries concerning the nature and mode of action of oxidation enzymes\"", "last_name": "Theorell", "share": "1/1", "death_city": "Stockholm", "birth_country": "Sweden", "year": "1955", "birth_city": "Linköping", "death_country": "Sweden", "first_name": "Axel Hugo Theodor", "area": "medicine", "id": "359", "field": "", "speech": {"date": "1955-12-10 00:00:00", "url": "http://www.nobelprize.org/nobel_prizes/medicine/laureates/1955/theorell-speech.html", "location": "Stockholm", "words": "Eders Majestater, Kungliga Hogheter, Arade forsamling! Jag tror ingen har i dag skulle kunna ha en giltigare reell, om an inte formell anledning an jag att tacka Alfred Nobel for maten. I 19 ar har han givit mig och min familj vart dagliga brod, men inte bara brod, utan ocksa arbete i ett utomordentligt utrustat Nobelinstitut. Det kanske inte ar sa underligt, om jag aldrig kan passera Erik Lindbergs bronsbyst av Alfred Nobel utan att agna honom en varm och tacksam tanke, dar han star framfor ingangen till det Medicinska Nobelinstitutet. Sa kommer da, dessutom, denna dagens fantastiska upplevelse. \"Varlden ar sa stor, sa stor, Lasse, Lasse liten\" - den gamla barnvisan ringer i mina oron. Nar man i manga ar arbetat med att utdela Nobelpris, och sjalv blivit en av de utvalda, sa vet man att omdomet ar svart och objektiv rattvisa en omojlighet. Jag tanker inte har, som vi stundom hor pa denna dag och fran denna plats, lovorda prisutdelarna for deras objektivitet och lyckade val just i ar. Den saken ma andra bedoma. Men jag vill garna uttala mitt tack till Karolinska institutets lararkollegium. Vid Karolinska institutet gjorde jag alla mina medicinska studier, och nar Einar Hammarsten, fran borjan min larare men snart min van, talade till mig i Konserthuset hade jag en lyckokansla som en skolgosse som fatt laroverkets storsta premium - sa stort att det aldrig forut delats ut till en av dess egna. Min foregaende kannedom om Nobelprisutdelningens forprocedur gor att anledning finnes formoda, att flera biokemiskt sakkunniga maste ha medverkat i bedomningen av min prisvardighet. Vilka dessa an ma ha varit, sa hoppas jag att ett tack med anonym adress i denna forsamling kan ha en mojlighet att na sitt mal. Faltherren vinner icke slaget allena - och ingen vetenskapare far ett Nobelpris utan goda medarbetare. Det ar mig en kar plikt att har tacka alla mina duktiga medhjalpare fran nar och fjarran - \"antingen han ar skandinav eller ej\", som Nobel skriver i sitt testamente."}, "bornCountryCode": "SE", "lecture": {"date": "", "url": "", "location": "", "words": ""}, "bio": {"url": "http://www.nobelprize.org/nobel_prizes/medicine/laureates/1955/theorell-bio.html", "words": "Axel Hugo Theodor Theorell was born at Linkoping, Sweden, on July 6, 1903. He was the son of Thure Theorell, surgeon-major to the First Life Grenadiers practising medicine in Linkoping, and his wife Armida Bill. Theorell was educated for nine years at a State Secondary School in Linkoping and passed his matriculation examination there on May 23, 1921. In September, 1921, he began to study medicine at the Karolinska Institute and in 1924 he graduated as a Bachelor of Medicine. He then spent three months studying bacteriology at the Pasteur Institute in Paris under Professor Calmette. In 1930 he obtained his M.D. degree with a thesis on the lipids of the blood plasma, and was appointed lecturer in physiological chemistry at the Karolinska Institute. Since 1924, however, Theorell had been on the Staff of the Medico-Chemical Institution, first as an associate assistant and during the years 1928-1929 as a temporary Associate Professor. Here, under Professor Einar Hammarsten, he carried out his first work on the influence of the lipids on the sedimentation of the blood corpuscles. In 1931 he studied in Svedberg's institute at Uppsala University, the molecular weight of myoglobin with the aid of the ultracentrifuge. In 1932 he was appointed Associate Professor in Medical and Physiological Chemistry at Uppsala University, and here he continued and extended his work on myoglobin. From 1933 until 1935 Theorell held a Rockefeller Fellowship and worked with Otto Warburg at Berlin-Dahlem, and here he became interested in oxidation enzymes, a subject to which he has given his attention ever since. At Berlin-Dahlem he produced, for the first time, the oxidation enzyme called <<the yellow ferment>> and he succeeded in splitting it reversibly into a coenzyme part, which was found to be flavinmononucleotide, and a colourless protein part. Returning to Sweden in 1935, Theorell worked at the Karolinska Institute and in 1936 he was appointed Head of the newly established Biochemical Department of the Nobel Medical Institute, which was opened in 1937. For ten years this Institute was housed in the Karolinska Institute, but in 1947 it was able to occupy its own building. Since 1935, Theorell has, with Swedish and other collaborators, carried out researches on various oxidation enzymes, and he has contributed especially to our knowledge of cytochrome c, peroxidases, catalases, flavoproteins, and <<pyridine>>-proteins, particularly the alcohol dehydrogenases. For his work on the nature and effects of oxidation enzymes he was awarded the Nobel Prize for Physiology or Medicine for 1955. Theorell is a member of learned societies in Sweden, Denmark, Norway, Finland, the U.S.A., France, Italy, Poland, Belgium and India. He was Chairman of the Swedish Medical Society in 1947-1948 and 1957-1958, and served as Secretary of that Society during 1940-1946, he was a member of the Swedish Society for Medical Research during 1942-1950, the State Research Council for the Natural Sciences during 1950-1954, and the State Medical Research Council as from 1958. He was also Chairman of the Association of Swedish Chemists from 1947-1949. Since 1954 he has been Chief Editor of the journal Nordisk Medicin. He has been a member of many Government Committees and is Chairman of the Swedish National Committee for Biochemistry, of the Board of the Wenner-Gren Society and of the Wenner-Gren Center Foundation. His interest in music is shown by the facts that he is also a Member of the Swedish Royal Academy of Music and Chairman of the Stockholm Symphony Society. Theorell holds honorary doctorates of the Universities of Paris, Pennsylvania, Louvain, Brussels and Rio de Janeiro, and is a Foreign Member of the Royal Society of London, and the National Academy of Sciences of Washington. In 1931 he married Elin Margit Elisabeth Alenius. They had one daughter, Eva Kristina, who died in 1935, end three sons: Klas Thure Gabriel (b. 1935), Henning Hugo (b. 1939), and Per Gunnar Tores (b. 1942). Theorell now lives in Stockholm. From Nobel Lectures, Physiology or Medicine 1942-1962, Elsevier Publishing Company, Amsterdam, 1964 This autobiography/biography was written at the time of the award and first published in the book series Les Prix Nobel. It was later edited and republished in Nobel Lectures. To cite this document, always state the source as shown above.   Hugo Theorell died on August 15, 1982.", "title": "Hugo Theorell - Biographical"}, "timeline": {}, "affiliations": [{"city": "Stockholm", "name": "Karolinska Institutet, Nobel Medical Institute", "country": "Sweden"}], "gender": "male", "death_date": "1982-08-15", "diedCountryCode": "SE", "prize_title": "The Nobel Prize in Physiology or Medicine 1955", "birth_date": "1903-07-06", "co_winners": "Hugo Theorell", "contribution": ""}