{"url": "http://www.nist.gov/manuscript-publication-search.cfm?pub_id=919889", "abstract": "Objective: The aim of this study was to assess gadolinium deposition in the skin of a patient with normal renal function, based on estimated glomerular filtration rate (eGFR) values greater than 59 ml/min/1.73 m2, following exposure to large cumulative doses of gadolinium-based contrast agents (GBCAs). Materials and Methods: The patient underwent 61 contrasted brain MRI scans over the course of 11 years. Skin biopsies from the forearm and lower extremity were analyzed with inductively coupled plasma mass spectrometry (ICP-MS), laser ablation ICP-MS (LA-ICP-MS), and hydrophilic interaction liquid chromatography ICP-MS (HILIC-ICP-MS). Results: ICP-MS demonstrated high levels of gadolinium deposition (14.5 +- 0.4 [?] g/g), similar to previously reported gadolinium levels within the skin of patients with nephrogenic systemic fibrosis (NSF). LA-ICP-MS demonstrated deposition of gadolinium within the deep layers of skin. Speciation analysis using HILIC-ICP-MS demonstrated the presence of intact gadolinium-chelate species, although the majority of the gadolinium present could not be further characterized. Light microscopy demonstrated increased CD34 immunoreactivity in the connective tissue septations of the subcutaneous adipose tissue. The patient had no history of skin disorders and did not have a history of NSF, but did have severe joint contractures of unknown etiology. Conclusions: Our results, in contradiction to published literature, suggest that in patients with normal renal function, exposure to GBCAs in high cumulative doses, can lead to significant gadolinium deposition in the skin. This finding is in line with more recent reports of gadolinium deposition in the brain of patients with normal renal function. Future studies are required to address possible clinical consequences of gadolinium deposition in the skin, brain and potentially other organs in patients with normal renal function.", "meta": {"nist": {"volume": "51", "proceedings": "", "dates": "2016-06-13T00:00:00", "location": "", "pdf_filename": "", "authors": "William C. Davis; Donna R. Roberts; Scott M. Lindhorst; Cynthia T. Welsh; Mary N. Herring; Adam  Braun; Bruce H. Thiers;", "keywords": "gadolinium retention, skin, normal renal function", "citation": "Investigative Radiology", "issue": "5", "pages": "pp. 280 - 289"}}, "words": "", "date": "2016-05-02T00:00:00", "external_id": "nist_High-Levels-of-Gadolinium-Deposition-in-the-Skin-of-a-Patient-with-Normal-Renal-Function"}