{"abstract": "Natural Scene Statistics (NSS) produces powerful perceptually relevant tools that have been highly successful in image quality analysis of visible light images. These NSS capture statistical regularities in the physical world and thus can be applicable to Long Wave Infrared (LWIR) images in that regard. LWIR images are similar to visible light images and mainly differ by the wavelengths captured by the sensors. The distortions unique to LWIR are of particular interest to current researchers. We analyze a few common LWIR distortions and how they affect NSS models. Humans are the most important factor for assessing distortion and quality in IR images that are used in perception based tasks. Therefore, predicting human performance when a perception-based task needs to be performed can be critical to improving task efficacy. The National Institute for Standards and Technology (NIST) characterized human Targeting Task Performance (TTP) by asking firefighters to identify the locations of fire hazards in LWIR images under distorted conditions that correlate well with the features from NSS. We perform a study collecting human subjective quality scores that are also shown to correlate well with NSS features. We analyze and evaluate NSS of LWIR images under pristine and distorted conditions using four databases of LWIR images. Each database is captured with a different camera allowing us to better evaluate the statistics of LWIR images independent of camera model. We find that models of NSS are effective as estimating not only human opinion scores and task performance, but we also find that the same models are effective for measuring a given distortion in the presence of other independent distortions. We also find that NSS models provide a useful model for the local distortions present in LWIR images.", "citation": "IEEE Transactions on Image Processing", "volume": "", "pdf_filename": "", "authors": "Nicholas G. Paulter Jr.; Todd R. Goodall; Alan C. Bovik;", "keywords": "image quality, infrared images, long-wave infrared, natural scene statistics, perception-based tasks", "pages": "", "dates": "", "pdf_text": "", "title": "Natural Scene Statistics in Infrared Images", "url": "http://www.nist.gov/manuscript-publication-search.cfm?pub_id=917183", "proceedings": "", "location": "", "published": "December 12, 2014", "issue": ""}