{"abstract": "Since its discovery in 2004, graphene has been intensely studied due to its high elastic modulus, thermal conductivity, electrical conductivity, and gas impermeability. Although it is possible to use small quantities of graphene sheets for fundamental studies, graphene is more desirable in large quantities as a nanofiller for high performance nanocomposites. Large quantities of graphene are produced through oxidation of graphite. The resulting graphene oxide (GO) can be dispersed in various polar solvents in the form of single- and few-layer sheets, and then easily incorporated into various polymer matrices through solution mixing. These nanocomposites usually feature a percolation network that consists of randomly aligned graphene oxide platelets, which can impart excellent electrical and thermal conductivity to an otherwise non-conductive polymer matrix following reduction. In many cases, this random filler orientation is ineffective for improving the mechanical properties of graphene- or graphene oxide-based nanocomposites, which favor a layered structure with unidirectional filler alignment. This study demonstrates for the first time that it is possible to dramatically stiffen a glassy (> 1 GPa) polymer matrix by incorporating structually intact graphene in a layered structure. This oxidation-free assembly method could allow the full potential of graphene, and other two-dimensional nanosheets (e.g., molybdenum disulfide, niobium diselenide, and boron nitride), to be realized in mechanical, gas barrier, and various electronic applications.", "citation": "Advanced Functional Materials", "volume": "26", "pdf_filename": "", "authors": "Fangming  Xiang; Dorsa  Parviz; Tara M. Givens; Ping  Tzeng; Eric  Davis; Christopher M. Stafford; Micah J. Green; Jaime C. Grunlan;", "keywords": "graphene, thin films, layer-by-layer, modulus, polymer", "pages": "pp. 2143 - 2149", "dates": "", "pdf_text": "", "title": "Super Stiff and Highly Transparent Multilayer Thin Films Prepared through Hydrogen-Bonding Layer- by-Layer Assembly of Graphene and Polymer", "url": "http://www.nist.gov/manuscript-publication-search.cfm?pub_id=919613", "proceedings": "", "location": "", "published": "February 08, 2016", "issue": "13"}