{"abstract": "Due to the increasing use of silver nanoparticles (AgNPs) in consumer products, it is essential to understand how variables, such as light exposure, may change the physical and chemical characteristics of AgNP suspensions. To this end, the effect of 300 nm ultraviolet (UV) light on (20, 40, 60 and 80) nm citrate-capped AgNP suspensions has been investigated. As a consequence of irradiation, the initial yellow hue of the AgNP suspensions is transformed towards a near colorless solution due to the loss of the surface plasmon resonance (SPR) absorbance. The decrease in SPR absorbance followed a first order decay process for all particle sizes with a rate constant that increased linearly with the AgNP specific surface area and non-linearly with light intensity. The rate of loss of the SPR absorbance decreased with increasing citrate concentration, suggesting a surface-mediated transformation. Absorbance, atomic force microscopy and dynamic light scattering results all indicated that AgNP photolysis was accompanied by a diameter decrease and occasional aggregation. Furthermore, in situ transmission electron microscopy imaging using a specialized liquid cell also showed a decrease in the particle size and the formation of a core-shell structure in UV-exposed AgNPs. X-ray photoelectron spectroscopy analysis suggested that this shell consisted of oxidized silver. The SPR in UV-exposed AgNP suspensions could be regenerated by addition of a strong reducing agent (NaBH4), supporting the idea that oxidized silver is present after photolysis. Evidence for UV-enhanced dissolution and the production of silver ions was obtained with the Donnan membrane technique. This study reveals that the physico-chemical properties of aqueous AgNP suspensions will change significantly upon exposure to UV radiation, with implications for environmental health and safety risk assessments.", "citation": "Journal of Nanoparticle Research", "volume": "14", "pdf_filename": "", "authors": "Justin M. Gorham; Robert I. MacCuspie; Kate L. Klein; D H. Fairbrother; Richard D. Holbrook;", "keywords": "Silver nanoparticles, AgNPs, photolysis, nanoEHS, nanoparticle transformations, liquid TEM", "pages": "16 pp.", "dates": "", "pdf_text": "", "title": "UV-induced photochemical transformations of citrate capped silver nanoparticle suspensions", "url": "http://www.nist.gov/manuscript-publication-search.cfm?pub_id=911250", "proceedings": "", "location": "", "published": "September 14, 2012", "issue": "10"}