{"death_country": "", "bio": {"url": "http://www.nobelprize.org/nobel_prizes/economic-sciences/laureates/2001/spence-bio.html", "words": "Getting   started   I was born during the second World War in Montclair New Jersey.   This was more or less an accident (the location that is). My   father was based in Ottawa as a member of the War Time Prices and   Trades Board, the Canadian version of wartime price controls.   That work entailed frequent trips to Washington to coordinate   with their American counterparts. New Jersey is more or less half   way between the two capitals and my mother was visiting friends.   So although I grew up in Canada during and after the war until   leaving for college in the United States, I managed to also be an   American by birth.", "title": "A. Michael Spence - Biographical"}, "first_name": "A. Michael", "last_name": "Spence", "area": "economic-sciences", "gender": "male", "death_date": "", "share": "3", "motivation": "\"for their analyses of markets with asymmetric information\"", "birth_city": "Montclair, NJ", "affiliations": [{"city": "Stanford, CA", "name": "Stanford University", "country": "USA"}], "speech": {"date": "", "url": "", "location": "", "words": ""}, "birth_country": "USA", "diedCountryCode": "", "year": "2001", "birth_date": "1943-00-00", "lecture": {"date": "2001-12-08 00:00:00", "url": "http://www.nobelprize.org/nobel_prizes/economic-sciences/laureates/2001/spence-lecture.pdf", "location": "Stockholm", "words": " SIGNALING IN RETROSPECT AND THE INFOR-MATIONAL STRUCTURE OF MARKETSPrize Lecture, December 8, 2001by\nA. MICHAELSPENCE1Stanford Business School, Stanford University, 518 Memorial Way, Stanford,CA 94305-5015, USA.INTRODUCTIONWhen I was a graduate student in economics at Harvard, I had the privilegeof serving as rapporteur for a faculty seminar in the then-new Kennedy\nSchool of Government. Among other distinguished scholars, it included all of\nmy thesis advisers, Kenneth Arrow, Thomas Schelling, and Richard Zeck-\nhauser. In the course of that seminar there were discussions of statistical dis-\ncrimination and many other subjects that relate to the incompleteness of in-\nformation in markets. One of my advisers came in one day with the strong\nsuggestion that I read a paper he had just read called OThe Market for\nLemonsO by George Akerlof.2I always did what my advisers told me to do andhence followed up immediately. It was quite electrifying. There we all found\na wonderfully clear and plausible analysis of the performance characteristics\nof a market with incomplete and asymmetrically located information. That,\ncombined with my puzzlement about several aspects of the discussion of the\nconsequences of incomplete information in job markets, pretty much\nlaunched me on a search for things that I came to call signals, that would \ncarry information persistently in equilibrium from sellers to buyers, or more\ngenerally from those with more to those with less information.3The issue, ofcourse, was that signals are not terribly complicated things in games where\nthe parties have the same incentives, i.e. where there is a commonly under-4071This paper is based on a lecture delivered by the author in Stockholm on the occasion of the100thanniversary of the founding of the Nobel Prize. I would like to thank my fellow recipientsof the Nobel Prize in Economics this year, Professor George Akerlof and Professor Joseph Stiglitz,\nfor their work and their inspiration, and my thesis advisers, Professors Kenneth Arrow, Thomas\nSchelling and Richard Zeckhauser whose ideas and guidance got me launched on the study of\nmarket structure (particularly informational structure) and performance. My colleagues Profes-\nsors Edward Lazear and Mark Wolfson gave me a great deal of constructive input. I also owe a\ngreat debt to Professors James Rosse and Bruce Owen, with whom I learned and taught industrial\norganization and applied microeconomic theory at Stanford. It was a great group of young \npeople and a wonderful time to be in that part of the Theld. 2George Akerlof, OThe Market for Lemons: Qualitative Uncertainty and the Market Mechanism,Quarterly Journal of Economics.3I believe is was Robert Jervis who introduced the terms OindicesO and Osignals.O Indices are attri-butes over which one has no control, like gender, race, etc. Think of them as unalterable attri-\nbutes of something, not necessarily a person. Signals are things one does that are visible and that\nare in part designed to communicate. In a sense they are alterable attributes. I thought it was a\nuseful set of distinctions and terminology and I still do. stood desire to communicate accurate information to each other. Even inthat case (sometimes called the pure coordination case) however, there are\npotential problems of choosing among equilibria as illustrated in SchellingOs\nbrilliant analysis of the use of focal points and contextual information to solve\ncommunication/coordination problems when the parties have been de-\nprived of the ability to communicate directly.4In markets where the issue is of-ten undetectable or imperfectly detectable quality differentials, the align-\nment of incentives is typically imperfect and the incentive of the high-quality\nproduct owners to distinguish themselves and the incentive of the low-quality\nowners to imitate the signal so as to obscure the distinction is fairly clear. Of\ncourse there is more to it, as one needs to know such things as who is in the\nmarket persistently and hence who has an incentive to establish a reputation\nthrough repeated plays of the game. I am going to devote a good portion of\nthis lecture to these issues, in a sense to revisit signaling, and then turn to\nsome other aspects of the informational structure of markets that are raised\nby the parameter shifts caused by the proliferation of the internet as a com-\nmunication medium in the past few years.5I was asked recently by a somewhat incredulous questioner (actually a jour-nalist) whether it was true that you could be awarded the Nobel Prize in\nEconomics for simply noticing that there are markets in which certain parti-\ncipants donOt know certain things that others in the market do know. I\nthought it was pretty funny. It was as if this had somehow been a closely guard-\ned secret up until about 1970, at least in economics. I clearly cannot speak for\nthose who make the decisions about the Nobel Prize, but I suspect that the\ncorrect answer to that question is no. What did blossom at that time was a se-\nrious attempt by many talented economists to capture in applied microeco-\nnomic theory a whole variety of aspects of market structure and performance.\nThat work produced a partial melding of theory, industrial organization, la-\nbor economics, Thnance and other Thelds. An important early part of that ef-\nfort was the attempt to captureinformationalaspects of market structure tostudy the ways in which markets adapt, and the consequences of informa-\ntional gaps for market performance.Therefore, in answer to the question, we noticed that there are many mar-kets with informational gaps. These include most consumer durables, virtual-\nly all job markets, many Thnancial markets, markets for various types of food\nand pharmaceuticals, and many more. These informational gaps were widely\nacknowledged and those of us who taught applied microeconomic theory,\nfreely admitted that these gaps might change some of the performance cha-\nracteristics, not to mention the institutional structure, of markets in which4084Thomas Schelling, The Strategy of Conssict.5In economics and other social sciences, models abstract from reality and focus on structural fea-tures of organizations or markets that drive outcomes. There are embedded and usually unstated\nparameters that are not the focus of attention, as they do not normally change. When I refer to pa-\nrameter shifts caused by the internet, I mean changes in structural elements that formerly did not\nchange. For example, most markets have geographic dimensions and boundaries that are impli-\ncitly understood and are not the focus of attention. The internet however, has moved those bound-\naries by collapsing time and distance in the information/communication dimensions of markets. they appear. But I think it is fair to say that we did not have much systematicknowledge based on theory of what those changes might be. And so we\nthought that applied microeconomic theory deserved an attempt to build\nthese informational characteristics into models that capture the structure and\nperformance of these markets with reasonably accurate assumptions about the\nex ante informational conditions. It was a very exciting time for all of us who\nwere involved. One of the wonderful aspects of receiving this award is that it\nhas triggered in me, and I think others, fond memories of the sense of disco-\nvery and excitement. And in that context, I would like to take this opportuni-\nty to express my admiration and deep gratitude to the many extant young col-\nleagues with whom I worked and shared these ideas. They should, and\ncertainly in my mind, do share in the recognition triggered by awarding of the\ndistinguished Nobel Prize for what was accomplished during those years.The plan for this lecture is as follows. The overriding goal is not to look toostupid to the next generation of students and scholars. More seriously, fol-\nlowing the advice that my advisers once gave me, I will Thrst discuss the \nsimplest model that I can devise that illustrates in reasonably general form\nthe deThnitions and properties of signaling equilibria.6Next, we will allow thesignal (in this case education in the job market context), to contribute \ndirectly to the productivity of the individual as well as functioning as a signal.\nFollowing that, the paper examines a market in which there is signaling and\nboth separating and pooling in the equilibrium.The section after that examines a fairly general partial equilibrium model ofsignaling and discusses competitive equilibria and certain kinds of OoptimalO re-\nsponses to signals.7Those who are more interested in the general idea and lessin the general case can skip over this section without risk of missing any impor-4096John von Neumann, who deserves to be on a short list of the greatest minds of the 20thcentury,is reported to have said that you donOt understand a theory or an abstract structure until you have\nseen and worked through hundreds of examples of it. Even if he didnOt say that (and I think he\ndid), I agree with it. Few people can say that they had the idea that calculating machines \ndidnOt have to be hard-wired, that you could store instructions in memory and then execute them\nin order: that is, you could build a programmable computer.7These optimal responses problems are selection problems. In insurance markets, they can bemoral hazard or adverse selection problems, and in other contexts they are agency problems or\noptimal taxation problems. You want to confront people with schedules that cause them to make\nappropriate choices and in so doing to reveal themselves and the information that they privately\nhold ex ante. Generally the results are below what is achievable with perfect information, because\nwith perfect information, you donOt have to worry about the revelation problem. These problems\nhave the economic and mathematical properties of second-best taxation problems, of which per-\nhaps the Thrst to be analyzed was the OoptimalO income tax problem, by the Reverend Ramsey,\nthough the analysis seemed to have largely escaped notice until Jim Mirrlees, Tony Atkinson, and\nthen others rediscovered it. The idea is that the taxing authority cannot directly observe an indi-\nvidualOs earning power (think of it as maximum potential hourly wage) so they tax what they can\nsee and monitor, which is income. This produces a disincentive with respect to work that could\nhave been avoided if the tax were based on earning potential rather than actual earnings. The se-\ncond best optimizing calculation then trades off in the most efThcient way disincentives for work\nand the need to meet a revenue goal for the taxing authority. The mathematics of these problems\nare sometimes referred to as optimal control problems and sometimes the calculus of variations.\nIn later work, Holmstrim applies these models to a labor setting, incorporating WilsonOs work on\nsyndicates (optimal risk-sharing). Here the second-best optimizing calculation sacriThces optimal\nrisk- sharing employees and owners to provide incentives for employees to work diligently. tant properties. However, this is the section in which the formal relationship be-tween signaling models and models of self-selection and optimal taxation with\nimperfect information is examined, and that may be of interest to some readers.\nI also want to introduce in that context a new possibility that I discovered only re-\ncently and that is that one can have a signaling equilibrium in which the costs of\nthe signal appear to vary with the unseen ability characteristics in the wrong way.\nThat is to say the costs of education (absolutely and at the margin) rise with abi-\nlity, or more generally, with the unobserved attribute that contributes positively\nto productivity. For the most part, I will use the job market case for expositional\npurposes and comment on some other signaling situations more briessy later in\nthe essay. There is a risk in using job markets to illustrate signaling. In order to\nillustrate the fundamental properties of signaling models, I have stripped away\nother features of the market, particularly in the simpler models. But I have no-\nticed in the past that there is a tendency for the simpler models set in the job\nmarket context, to convey unintended messages such as (1) education does not\ncontribute to productivity, or (2) the information contained in the signal does\nnot increase efThciency. This essay is mainly about the theory of signaling and in-\nformation transfer in markets, and not mainly about human capital and labor\nmarkets. There are many who are more knowledgeable about the latter than I. The paper concludes with two sections. The Thrst of these discusses theubiquitous use of time and the allocation of time as a signal and as a screen-\ning device. The second focuses on the potentially rather large information pa-\nrameter shifts that the internet may have caused and speculates a little on\nhow applied models of markets, organizations, and boundaries between them\nmay have changed and on what is needed to capture the effects of these pa-\nrameter shifts in models of markets and the economy.THE SIMPLEST JOB MARKET SIGNALING MODELThe idea behind the job market signaling model is that is there are attributesof potential employees that the employer cannot observe and that affect the\nindividualOs subsequent productivity and hence value to the employer on the\njob. Let us suppose that there are just two groups of people. Group 1 has pro-\nductivity or value to any employer of 1, and Group 2 has productivity of 2. In\nthis example, these productivity values do not depend on the level of invest-\nment in the signal. If there were no way to distinguish between people in\nthese two groups then if both groups stay in the market, the average wage\nwould be 2 D !, where !is the fraction of the population in group 1, andeveryone would get that wage. If the higher productivity group through dis-\nsatisfaction or for any other reason, exits this labor market, the average pro-\nductivity and the wage drop to 1. This phenomenon when it occurs is some-\ntimes called the adverse selection problem, a label most commonly applied to\ninsurance markets. It is structurally the same problem that Akerlof described\nin his famous paper on used cars (lemons).84108George Akerlof, OThe Market for Lemons: Qualitative Uncertainty and the Market Mechanism,OQuarterly Journal of Economics, 1971. Now suppose that there is something called education, which we will de-note by E, that can be acquired or invested in. It is assumed to be visible, and\nits acquisition costs differ for the two types. Let us suppose that the cost of E\nyears of education for group 1 is E, and the cost for group 2 individuals is\nE/2. For this example I am going to assume that education does not affect\nthe individualOs productivity. I do this purely to keep it simple and not to sug-\ngest that human capital, including that acquired through education, is some-\nhow not relevant. In later sections, the assumption will be relaxed.Equilibrium in a situation like this, and in general, has two components.First, given the returns to and the costs of investing in education, individuals\nmake rational investment choices with respect to education. Second, employ-\ners have beliefs about the relation between the signal and the individualOs un-\nderlying productivity. These beliefs are based on incoming data from the mar-\nketplace. In equilibrium, the beliefs must be consistent, that is, they must notbe disconThrmed by the incoming data and the subsequent experience. There-fore, one could say that the beliefs must be accurate. But one should also no-tice that employersO beliefs/expectations determine the wage offers that are\nmade at various levels of education. These wage offers in turn determine the\nreturns to individuals from investments in education, and Thnally, those re-\nturns determine the investment decisions that individuals make with respect\nto education, and hence the actual relationship between productivity and\neducation that is observed by employers in the marketplace. This is a com-\nplete circle. Therefore it is probably more accurate to a say that in equili-\nbrium, the employersO beliefs are self-conThrming. This may sound like a minorrestatement but it is important. It is the self-conThrming nature of the beliefs\nthat gives rise to the potential presence of multiple equilibria in the market.In the example at hand, suppose that group 1 individuals set E1 = 0 and in-dividuals in group 2 set E2 = E*. Suppose further that employers, none ofwhom individually inssuence investment decisions by individuals9, believe thatif E < E* then productivity is 1 and if E\"E*, then productivity is 2. With theseassumptions, individuals in group 1 will rationally set E = 0 provided that2 D E* < 1Members of group 2 will rationally set E = E* provided thatTherefore the choices will be rational and the expectations conThrmed in themarket if 1 < E* < 2.Though it is a highly stylized example it has many of the general properties of4119Investment decisions are made by individuals in advance of knowing with whom they will workand employers are such that none of them individually inssuences materially the perceived offers\nin the market place. signaling equilibria. There is a continuum of equilibria, in each of whichthere is more investment in the signal than there would be in a world of full\ninformation. Because investment in the signal dissipates resources without\nimproving productivity, the result is inefThcient. Moreover the equilibria are\norderable by the Pareto criterion, that is, as you move from one equilibrium\nto another, everyone is either worse off or no better off. The signal actually\ndoes distinguish low- and high-productivity people and the reason it is able to\ndo so is that the cost of the signal is negatively correlated with the unseen\ncharacteristic that is valuable to employers, in this case productivity itself. The\nequilibrium is characterized by a schedule that gives the returns to education,\nthat is a wage for each level of education, and optimizing choices given that\nschedule by individuals in the two groups. The equilibrium is depicted in Figure 1. The wage schedule is the dark lineand jumps from a wage level of 1 to a wage level of 2 at e*. E* is between 1\nand 2 so that group 1 chooses the education level 0 and group 2 chooses E*.\nIt is not essential that net income for group 1 at e* is negative as it is in this\nexample. We could make the productivity levels for the two groups 3 and 4.\nThe same signaling result would occur with suitable adjustments in the level\nof the wage schedule.There are in fact other signaling equilibria. For example, there could be aminimal level of education that group 1 invests in. But unless it is a produc-\ntive investment, there is no reason to think that over time the market would\nnot discover this and eliminate it as an inefThciency that can be removed cost-\nlessly. In the spectrum of equilibria described above, probably the most inte-\nresting is the most efThcient one. That equilibrium is the one in which \nE* =1+#, where # is to be thought of as a small positive number. In this equi-librium, 412Figure 1 w$= %$= $, andw2=2, and N2= 1.5 D #/2,where Niis income net of signaling costs for group i. On the assumption that the market will Thnd equilibria that are Pareto-efTh-cient, one can ask whether there is a better equilibrium in the Pareto sense\n(everyone is better off) than the one described above. The answer is some-\ntimes yes. It involves pooling and it depends on the relative sizes of the two\ngroups. What is really going on here is that the market is, in a sense, acting as\nif it is trying to maximize the net income of the higher productivity group. In\nsome cases that is accomplished by recognizing that it is too expensive for\nthat group to distinguish itself. The alternative is to appear undifferentiated\nin a pool. That clearly beneThts group 1 as they are mistaken for the average\nproductivity, which is above 1. As a reminder, !is the fraction of the popula-tion in group 1. In a pooling situation the average productivity is 2 D ! >1.Group 1 would clearly prefer it. Group 2 prefers it as well if2 D ! >1.5 D #/2, or! < .5(1 D  #)Since # can be made as small as we want, there is a preferred pooling equilib-rium (in the Pareto sense) if in this example, group 1 is less than half the\npopulation. In general with discrete groups, pooling with lower level groups\nbecomes attractive if they are relatively small, because the higher level groups\ndonOt give up too much by being mistaken for the average and they avoid the\nsignaling costs. In a later section I will describe briessy a case in which one can\nobserve pooling and separating in the same equilibrium.If you wanted to make the result in this market more efThcient than theequilibria described above, you would tax education (assuming that such a\ntax is not costly to impose and administer), making it more expensive for\ngroup 2, and thereby make it possible to lower the level of education without\nlosing the informational content of the signal. The revenues generated could\nbe distributed equally to all participants in both groups independent of their\neducation choice. The lump-sum component of the tax will therefore not af-\nfect their signaling behavior.Let t be the tax rate on investment in education and let k be the lump-sumdistribution from the tax revenues. This distribution goes to everyone. Let the\nsignaling level of education be E*. Group one individuals will rationally\nchoose not to send the signal if 2 D (1 + t)E* + k< 1 + kand group 2 will rationally send the signal if 2 D (.5 + t)E* + k> 1 + k.We have an equilibrium then if413 We will pick the efThcient end of the signling spectrum by setting The lump sum distribution is equal to the tax revenues so thatThus the equilibrium net incomes areAs #becomes small and t becomes very large, k approaches (1 D !), andhence both net incomes approach (2 D !). This, the reader will recall, is thepooling equilibrium outcome in terms of net income. Here however, there is\nno upper limit on the size of group 1, namely !. Signaling costs (socially) arenegligible as E* approaches zero, though the private marginal costs of signal-\ning (including the tax) approach 1.To summarize, one can get rid of the inefThciency and keep the signalingand the informational content of the signals with an appropriate tax on the\nsignaling activity. The effect is to redistribute income in such a way as to re-\nproduce the results of the pooling equilibrium. It could be that the informa-\ntion the signal carries is itself productive. In that case it is important that the\nequilibrium actually be a separating one.10That is the case here. Separating isretained in this equilibrium. Groups are correctly identiThed. The use of a tax\non the signaling activity reduces the level of the signal required to distinguish\nthe groups, and hence reduces the inefThciency of the untaxed signaling equi-\nlibrium.THE TWO-GROUP MODEL WHEN EDUCATION ENHANCES HUMANCAPITAL AND ALSO SERVES AS A POTENTIAL SIGNALIt will naturally occur to the reader to ask what is the effect on the market sig-naling that we have just examined, at least in the context of labor markets,\nwhen the signal also contributes directly to productivity for the individual\nworker.11This section addresses the subject by modifying the two-group mo-del of the preceding section to allow education to be productive. I will make41410Information is directly productive, for example, if there is a job allocation or training decisionthat is made more efThciently with accurate knowledge of the type. In that case the pooling equili-\nbrium would be inefThcient.11Actually this issue does not just arise in labor markets. Generally signals can change the value ofthe product. For example, in the used car case, a warrantee changes the value of the bundle, the\ncar and the warrantee in addition to carrying information about the product itself.and. the model slightly more general in terms of functional forms. Let si(E) be thevalue of a worker of type I with education E to an employer. Here I = 1,2 and\nwe assume that s2(E) > s1(E), and s2(E)>s1(E). Let ci(E) be the cost of in-vesting in E units of education for group I and assume that c1(e) > c2(e), andthat c1(E)>c2(E). These assumptions simply capture the idea that the groupwith the higher productivity also has the lower costs of signaling. As before,\nthe individualOs type is not directly observable. We will also assume that Si(E)is concave, that Ci(E) is convex and hence that the net income function Ni(E)= Si(E) D Ci(E) is concave.There are three qualitatively different kinds of equilibria in this market.The Thrst is a fully efThcient separating equilibrium. It is easiest to see the types\nof equilibrium pictorially. In Figure 2, we have various forms of net income\nplotted as a function of E. Let V1(E) = S2(E) D C1(E). Our interest in the func-tion V clearly relates to the question of whether group 1 will adopt the group\n2 signal and hence create a problem with the separating equilibrium.In Figure 2, you will see the functions N1, N2, and V. The points E1* and E2*are the points that maximize N1 and N2. The point EDis the largest value of Esuch that V is larger than N1*, the maximum value of N1. In Figure 1, you cansee that E2* is to the right of ED. This means that as long as the wage offerschedule jumps up from s1(E) to s2(E) to the right of ED, individuals in group1 will have no incentive to imitate the signaling behavior of group 2. This is the fully efThcient separating equilibrium. The signal carries accurate415Figure 2 information, and the investments in education are the efThcient ones. Theoutcome is as if there was perfect information in the market place. In\nessence, the two groups are sufThciently different in terms of some combina-\ntion of the productivity of education as human capital and the costs of edu-\ncation that the fully efThcient outcome survives as an equilibrium. Note how-\never, that the negative relation between productivity and costs really matters.\nIf signaling costs were the same, then the functions N2and V would be thesame and we could not have this market outcome. When signaling costs are\nthe same one can never prevent group 1 from imitating group 2 behavior\nwhen it is to their advantage to do so.Now turn to Figure 3. It is essentially the same picture as Figure 2 exceptthat E2* is to the left of ED. This means that if the wage schedule jumps to s2(E)before E2*, the group 1 will imitate group 2 behavior and dismantle the se-parating equilibrium. To prevent this we will specify that the wage schedule\njumps up to s2(E) at ED+ #. Subject to a qualiThcation that I will come to in aminute, this is a separating equilibrium. To achieve the separation, the group\n2 investment in education is pushed up above the efThcient level, in order for\nthe individuals in that group to achieve the signaling effect and avoid imita-\ntion by group 1. So here we have the same kind of result that we had in the\nno-human-capital case. Here the return to investing in education has a sig-\nnaling component and a human capital component. The former can push\nthe levels of investment above the full information optimum. In the Thrst mo-\ndel the human-capital effect was zero, leaving only the signaling effect, an as-416Figure 3 sumption that ensures that overinvestment will occur in any separating equi-librium in which signaling occurs.There remain two issues. One is whether and under what circumstances,pooling will destroy the hypothesized separating equilibrium and the second\nis, OCan one tax the signal in such a way as to improve market performance?O\nPooling Thrst. Let !be the fraction of the total population in group 1. In apooling equilibrium, the wage for all will be !s1(E) + (1 D !)s2(E) for any le-vel of E that emerges. This cannot break a fully efThcient separating equili-\nbrium because group 2 cannot be better off. Thus if pooling breaks a sepa-\nrating equilibrium it can only be in the case where the more productive\ngroup has been forced, for signaling purposes, above its optimal level of E\nfrom the standpoint of investment in human capital. Let W(E) = !s1(E)+(1 D!)s2(E). By making !arbitrarily small we can make W as close to s2(E) as wewant. Now let us look again at Figure 2. If you start at EDand reduce E andmove to the left and up the curves N2and V, it is clear that both groups arebetter off. For small !, the net income functions W-c1and W-c2are close to Vand N2. Hence for a range of ! at the low end, pooling will break the sepa-rating outcome. For these cases, the natural choices of equilibrium levels of E\nare those that lie between the education levels that maximize W-c1and W-c2.As ! rises, eventually the function W-c2will fall below the level of group 2net income at the separating point ED, at which point the pooling outcome isnot capable of breaking the separating equilibrium. To summarize, in the\ncase of an inefThcient separating equilibrium, there exist pooling equilibria\nthat are Pareto-superior to the separating equilibrium provided the size of the\nlower productivity group is below some threshold level. If the market has a\nway of Thnding the pooling equilibria, they will break the separating one.We turn now to the problem of improving the efThciency of the market. Wesaw in the preceding section that in the case where there is no human capital\ncomponent of productivity, one can in principal come arbitrarily close to the\nefThcient outcome through appropriate taxes. The same is true when the sig-\nnal adds to the individualOs productivity as well as functioning as a signal. We\nhave already seen that in some cases the market equilibrium itself is efThcient\nin the sense of maximizing total net income as part of a separating equilibri-\num. We now want to show that one can achieve the same result in the case\nwhere the higher productivity group has been forced by signaling considera-\ntions to move above its efThcient level of investment in human capital.To achieve an efThcient outcome, we want to maximize total net income. Todo that we need to have si= cifor i = 1,2. To accomplish that if it is possible,we need a wage function that induces these choices. The wage function can\nbe thought of as a schedule of taxes on education superimposed on a wage\nfunction that sets wages equal to productivity. Since each individual in each\ngroup considers all possible levels of E in making its education investment de-\ncision, it turns out to be easier to solve this problem indirectly rather than di-\nrectly. Let us suppose therefore that counter to fact, there is a continuum of\ntypes speciThed by the parameter z, where productivity for type z is zs1+(1-z)s2and costs for type z are zc1+(1-z)c2. Let E(z) maximize417 z(s1D c1)+ (1 D z)(s2D c2).Note that E(z) declines as a function of z. Invert E(z) to get Z(E). If the wageschedule we are looking for is w(e), then individuals will have maximized by\nsetting w= zc1+ (1 D z)c2.Substitute Z(E) into the differential equation above and integrate with re-spect to E, setting the constant so that total wages equal total output. This\nwage schedule and/or the implied tax schedule will induce the efThcient\nchoices of E.12The reader notices that the optimal wage schedule above does not dependon the distribution of z in the population.13Therefore let us assume that al-most all the weight in the distribution is at either z = 0 or z = 1. This is the two\ngroup case we are studying. To summarize, with two groups and education as productive human capi-tal, one can have a signaling equilibrium with full efThciency or overinvest-\nment in education by the more productive group. You can also have a pooling\nequilibrium that dominates the separating equilibrium provided that the less-\nproductive group is not too large. And Thnally there exists a tax/subsidy\nscheme that produces a fully efThcient separating outcome as an equilibrium.A MODEL WITH SIGNALING, SELECTION AND POOLING14The model we are going to look at briessy in this section is of interest for tworeasons. First it illustrates a case in which there is both pooling and separating\ncomponents of the equilibrium, and second, it shows that the critical criteri-\non for having a separating component in an equilibrium is that the net bene-\nThts of issuing the signal are positively correlated with an unseen attribute that\ncontributes positively to productivity. This positive correlation can result as in\npreceding examples, from signaling costs that are negatively correlated with\nthe valued attribute. That is a sufThcient but not a necessary condition for a\nseparating equilibrium. In this very nice example the information is acquired\nat a Thxed cost and the positive correlation comes from subsequent discovery\nof the attribute post-employment.The idea behind the model is that the value of individuals to Thrms is not di-rectly observed, at least at the time of hiring. The value which we will denote\nby q is distributed on the interval [qmin,qmax]. Let the distribution of q in the41812Note that wD [zc1+ (1 D z)c2] = z(E)[c1D c2) < 0, so that the second order condition for amaximum is satisThed. The optimal tax schedule will actually consist of a rising tax on education\nat all levels of education combined with a lump sum distribution to everyone so that net tax re-\nvenues are zero. In this example, group 1 will receive a net subsidy and group 2 will pay a net tax.13This is a general property of the continuous case, when the objective is, as it is here, to maxi-mize net income by inducing the efThcient levels of investment in human capital.14This example was developed by Professor Edward Lazear. It illustrates nicely the coexistence ofpooling and separating in equilibrium and also a different structural condition that permits the\nsignaling and selection to occur. It can be found in his book, Edward Lazear, Personnel Economics. population be f(q). Individuals have a choice. They can work for Thrms that donot distinguish among them and hence pay everyone the same amount. Or\nthey can work for Thrms that incur an expense, denoted by e, as a result of\nwhich, the Thrm eventually learns the value of q for the individual and pays the\nperson accordingly. In equilibrium this cost, which is the same for everyone,\nis passed on to the individual in the form of a reduction in compensation.\nLabor markets are assumed to be competitive. For those individuals who\nchoose the Thrms where they are distinguished, the wage is q-e. If the indi-\nvidual chooses a Thrm that does not incur the cost and does not distinguish\namong workers, then the compensation is the average value of the individuals\nwho work for that Thrm.Let us suppose that the average value of the workers in the pooling Thrms isqD. If we consider the optimizing decisions of individuals, it is clear that if qD e> qDthen the individual will choose to work for the separating Thrm and converse-ly. Let q* = qD+ e. In equilibrium, qDis the actual average value of those whowork in the pooling Thrms, so thatwhere F(q) is the cumulative distribution function for the attribute q. Theequilibrium is illustrated in Figure 4.419Figure 4 Those with q &q* receive qDand are pooled, while those with q > q* receiveq - e and are identiThed and are in the separating part of the equilibrium. It is\npossible that everyone will be pooled. This occurs when e, the cost of disco-\nvery, is large enough that qmaxD e is less than the unconditional mean of thewhole distribution. Another view of the equilibrium is provided in Figure 5.Here we plot the functions q*, and E(q|q &q*) + e, as a function of q*. Thesecond function is upward-sloping and will cross the 45-degree line, unless e\nis large enough to keep the second function above the 45-degree line for all\nq*. The crossover point is the equilibrium level of q*.15The signal is the choice of which type of Thrm to go to and it is partially, butnot completely, informative about the individualOs value to the Thrm. I noted\nin the Thrst model that the signal retains its informational content in equilib-\nrium if the cost of the signal is negatively correlated with the (hard-to-ob-\nserve) valued attribute. In this case, the cost of the signal is a constant across\npeople but because of the subsequent discovery and adjustment, the net be-\nneTht to the individual of issuing the signal is positively correlated with the \nvalued attribute.It is possible that the information carried by the signal increases efThciency.That circumstance increases the return to going into the separating side of42015While the conditional expected value function is upward-sloping, its slope is not necessarily lessthan one, and depends on f(q). It is therefore in principal possible to have an odd number of\nmultiple crossovers. If there are three, the middle one will be unstable and the ones at the out-\nside will cross over with a slope of less than one and be stable. To see this, note that if at some\npoint of time, q*D e> qD, then q* will rise, and conversely.Figure 5 the market and has the overall effect of increasing the size of the group thatsends the signal. I should also note that it has been implicitly assumed here\nthat the information about productivity, once it is acquired, is public. That\nwould force the employer to pay the employee his or her productivity minus\nthe discovery cost. If, on the other hand, the discovery is private, there will be\na negotiation between the employer and the employee over the net income,\nand that will have the effect of lowering the net income of the employee re-\nlative to the case in which the information is public. Thus one should expect\nthe size of the pooling component of the market equilibrium to rise when the\ndiscovery is private.THE GENERAL CONTINUOUS MODEL16I would now like to establish some reasonably general properties of signalingmodels.17Following that we will look at improving the equilibrium perfor-mance of the market through taxes and subsidies, using the approach of op-\ntimal taxation with imperfect information. The variables are n, standing for\nsome attribute that is (a) not directly observable, and (b) valuable to em-\nployers, and y, which is years of education. The latter is observable and may\nbe valuable to employers. The functions with need are S(n,y) which speciThes\nan individualOs productivity or value to an employer as a function of educa-\ntion and n, which I will hence forth refer to as ability. The remaining func-\ntions are c(y,n) which speciThes the cost of education as a function of the same\ntwo variables and w(y) which is the wage offered to an individual who pre-\nsents him or herself in the market with education of y. Since this is quite fa-\nmiliar territory, I will proceed fairly quickly. The equilibrium is deThned by two\nconditions. First, given w(y), individuals maximize income net of education\ncosts with respect to y. Thus they maximize w(y) D c(y,n) by setting w(y) = cy(y, n).This holds for all n. The second order condition, w(y) D cyy(y, n)< 0 musthold.The second condition is that employersO experience in the market overtime must be consistent with the offers they are making, so that for all n(y) = s(y, n).Ignore the second-order conditions for the moment. Since by assumption 42116This section is somewhat technical. It is not difThcult mathematics but does require a generalknowledge of differential equations and the calculus of variations. It is not essential for those in-\nterested in learning the basic properties of signaling equilibria and can be skipped by readers\nwho are willing to accept that the properties cited in the earlier examples survive in the general\ncase. The second best optimizing calculations are of some interest in interpreting what is going\non in the market.17Much of the material in this section is taken from parts of the the paper, OCompetitive andOptimal Responses to Signals: An Analysis of EfThciency and Distribution,O by Michael Spence,\nJournal of Economic Theory,1974. sn> 0, one can in principle solve the equation above for n in terms of w andy, say n=N(w,y). Substituting in the Thrst order conditions, we have (1)(y) = cy(y, N(, y)).This is a Thrst-order, ordinary differential equation. It has a one-parameterfamily of solutions that do not cross each other. In principle each member of\nthis one-parameter family can be part of a market-signaling equilibrium.18If c(0,n) = 0 for all n and if cyn< 0, then assuming cy> 0, c(y,n) will be de-clining in n and that combined with an upward sloping w(y) (without which\nno one would invest in education), ensures that y is an increasing or at least a\nnon-decreasing function of n. Let the net income function be N(y, n) = w(y) D c(y, n).This function has the property that Nyis an increasing function of n, whichensures that if Ny= 0 for a particular value of n, then if you raise n, Nywill begreater than zero and the maximum will occur at a higher value of y.Differentiating (1) with respect to y we havewhich means that the second order condition is in fact satisThed. Without being too formal about it, education or any potential signal trans-mits information in equilibrium if its costs absolutely and at the margin de-\ncline as the unseen valued attribute increases. This is a sufThcient condition.\nIn a later section I will show by example that it is not a necessary condition.Since for every level of n, in equilibrium w(y) s(n, y), differentiating wehavebecause sn > 0 and     > 0. This implies that in equilibrium, the private returnto education is higher than its direct contribution to productivity, because of\nthe second term in the equation above. This second term is the signaling ef-\nfect. It is the part of the private return to the investment in education that is\ntied to the unobserved level of n. Since w= cy,the above inequality impliesthat syD cy< 0, so that in equilibrium for all n, the investment in education ishigher than it would be with perfect information. If n were observable, then\nindividuals would be paid s(n,y), and they would select education to maxi-\nmize s D c by setting sy= cy. Note that if sn0 for all n, then the signaling ef-fect goes away. The attribute n is still unobservable to employers but indivi-\nduals make efThcient education investment decisions as they have the infor-42218The solutions cannot cross because if they did, then the derivative at a given point in (w,y)space would have two values, which contradicts the statement that whas a well-deThned valueF(w,y) at every point. As a consequence, let us assume that the family of solutions is w(y,K) where\nK is a parameter. If wK > 0 anywhere, then it is true everywhere, since to assume the oppositewould mean that the solutions cross., mation they need to make the investment decision optimally, and they are theonly ones who need that information.As noted earlier, there is a one-parameter family of equilibrium wageschedules that do not cross. Let the parameter be k and denote the schedules\nby w(y,k). As the solutions do not cross, without loss of generality we can as-\nsume that wk> 0. Net income to the individual is N = w D c. Differentiatingpartially with respect to k, with n held constant, we have (2)Nk= wk+ (wyD cy)('y|'k) = wk> 0.Thus a shift from one equilibrium to another makes everyone better or worseoff together. The equilibria are orderable by the Pareto criterion. What hap-\npens as one moves from one equilibrium to another is that the extent of over-\ninvestment in the signal is increasing or declining for everyone. I have to con-\nfess that at the time, even after discovering that there might be multiple\nequilibria, I did not expect that there would be such a simple relationship\namong them in terms of market performance.We can use (2) above and the fact that wsto derive the effect of a shift inthe equilibrium on the levels of investment in education. N = w D c = s D c.\nDifferentiating with respect to k, holding n constant and using (2) we haveFinally, from the equilibrium condition w= cy, differentiating with respect tok with n Thxed, we haveThis gives us a pretty complete picture of what happens when the equilibriumwage schedule shifts up. It becomes ssatter, inducing lower levels of invest-\nment in education. Average wages decline and average education costs de-\ncline more, so that net incomes rise and everyone is better off. Figure 6 re-\npresents the family of equilibrium wage schedules. As they rise they become\nssatter and the range of investment in education shifts to the left. Figure 6\nshows the range of investment in education for each of the schedules. As the schedules rise and become ssatter, the ranges of investment in edu-cation move to the left, that is they fall.While it is perhaps interesting to note that the signaling effect causes over-investment in the signal by the standard of a world in which there is perfect\ninformation, that isnOt the world we live in. Thus it may be more interesting to\nexamine the equilibrium outcomes in comparison to various second-best out-\ncomes that acknowledge that there is an informational gap and asymmetry\nthat cannot simply be removed by a wave of the pen.I will begin by looking at the maximization of total net income. Here as weshall see, one can achieve the efThcient levels of investment in education for\nall n. The required tax in effect undoes the signaling effect. The reason that\nthis is a clean case is because a dollar of net income is of equal value regard-423.. less of the recipient, we do not get into the business of trading off income di-stribution against the objective of efThciency. Following this brief analysis, we\nwill look at social welfare functions that are not linear in net income. For\nthese, there will be a tradeoff between efThciency and distribution. I will show\nthat the market outcome is more akin to the outcome of maximizing a con-\nvex (that is to say anti-egalitarian) social welfare function. This is not a sur-\nprising result since the function of signaling is to distinguish low- from \nhigher- productivity individuals, which results in a move away from egalitarian\noutcomes. I do also want to emphasize at the outset that the purpose of this\nanalysis is not to propose or promote taxing or subsidizing signals but rather\nto help shed additional light on the properties of the competitive equili-\nbrium. MAXIMIZING TOTAL NET INCOMEWe will assume that the unobservable attribute n is distributed in the popula-tion according to the density function f(n), and the cumulative distribution\nwill be represented by F(n). The total net income then is Here N(y, n) = w(y) D c(y, n) as before. The constraints are two. Individualschoose rationally so that w= cyand total gross wages have to equal total pro-ductivity or value generated to employers:424Figure 6(3). Our goal here is to select a schedule w(y) that causes education choices y(n)for each n, that maximize total net income, net that is of education costs. This\nis actually pretty straightforward. Using (4), we can replace w(y) in (3) and\nchoose y(n) to maximizeThis is the simplest form of a calculus of variations problem.19The solution isa schedule y(n) that causes sy= cy, for all levels of n. The reader will note thatthe implied levels of investment in education are those which would occur if\nn were observable, that is in the hypothetical world of perfect information.\nThey are therefore also as a result the efThcient levels of investment in educa-\ntion for each n: education is invested in up to the point where at the margin\nits direct contribution to productivity (the human capital effect) is equal to\nthe marginal cost. That is to say, to maximize net income, the wage schedule\nis set so as to remove the signaling effect, though education still carries the in-\nformation and acts as a signaling. The private part of the return to the signal\n(which has to do with distinguishing one individual from another and hence\nfalls into the zero-sum/redistribution aspect of the market mechanism) is\nsimply removed by the optimal tax or wage schedule. To Thnd the required\nwage schedule, you invert the optimal schedule y(n) to r(y), substitute that in\nthe optimizing condition w(y) = cy(y, r(y)), and integrate to getThe parameter w(0) is then set to cause the breakeven condition (4) to bemet. Individuals are likely being paid their productivity in the market place,\ns(y,r(y)). Therefore one can get to the desired result by imposing a tax/sub-\nsidy on education of t(y) = s(y,r(y)) - w(y) where w(y) is deThned by (5) above.\nIf you differentiate t(y) with respect to y you have t(y) = sy+ snrD w= syD cy+ snr= snr.The last term in the equation is the signaling effect at the margin of a changein education. This then says that the optimal tax at the margin is equal to the\nsignaling effect. It takes that part of the private return to education away, leav-\ning only the human capital effect or the direct contribution to productivity.One can also achieve the same result with an income tax. Let income be I.Its relation to education is given by I = s(y,r(y)). Invert that function to get425(4)(5)19A good treatment of the calculus of variations can be found in Courant. You displace y by #((n),differentiate with respect to #and insist that the result be equal to zero for all ((n). Thisgives us                                             That in turn implies that sy= cyfor all n.... y=Y(I) and then set the income tax T(I) equal to I D w(Y(I)), where againw(y) is deThned by (5). Individuals will select income so as to maximize ID T(I)\nD c(Y(I),n) = w(Y(I) D c(Y(I),n), by setting w= cywhich is the desired result.20It is interesting for those of us who live in the United States that to a Thrstcrude approximation, our education costs are roughly similar in form to the\nefThciency-inducing tax schedule. Lower levels of education are subsidized\nand these subsidies decline at college and university levels because of the ex-\nistence of a large private sector in higher education. SECOND-BEST OPTIMA WITH ASYMMETRIC INFORMATIONWe turn now to a brief examination of the effects of investment in educationand on net incomes of maximizing some social welfare function. As before, \nN = w(y) D c(y,n) is net income and n is distributed in the population accord-\ning to f(n). Let V(N) be the social value of net income of N to any individual.\nFor the moment, we will place no restrictions on V(N) other than that it is up-\nward-sloping D more net income is better. We will adopt an additive social wel-\nfare function For the moment, we will make no assumptions about the shape of V(N) ex-cept that it is upward-sloping. The objective is to maximize Z subject to two\nconstraints. One is that individuals make a rational choice of educationw(y) = cy(y, n).The second constraint is that gross wages add up to total output or produc-tivity.Let us suppose that the particular function w(y) that is chosen induces achoice of y = r(n) for each level of the unobserved characteristic. Differen-\ntiating N(y,n) totally with respect to n givesLet N(n) = K. Integrating (7) with respect to n we haveNoting that w = N + c, and substituting in (6), the condition that total wagesequal total productivity across the whole population, we have 42620This analysis assumes that there are no adverse incentive effects of an income tax in terms ofthe choice between work and leisure. If there are such effects, then taxing income and taxing the\nsignal are not equivalent in terms of the outcome.(6)(7)(8).... The point of all this is simply to get rid of the function w(y). Thus we imagineselecting an upward-sloping function y = r(n) to maximize Z. By using (8) and\n(9) we are assured that both constraints in the problem are satisThed, and the\nwage or tax schedule is nowhere in sight. We can calculate it later using the\noptimal schedule r(n) by inverting that schedule to n = h(y), substituting for\nn in w= cyand integrating to get the w(y) that induce the signal choices thatsolve the optimizing problem.The solution to the problem is21If V(N) is a constant so that V(N) is linear, then the right side of (10) is zero.This is the case we have just looked at, where total net income is maximized\nby inducing the efThcient choices of investment in education. It is just a special\ncase of the more general problem and in that case, the optimal schedule is\ndeThned by sy= cy, for all n.If V(N) is very concave so that the Thrst derivative falls rapidly, then at thelimit the only thing that matters is the net income of the people with the low-\nest net income. This case is normally called the maximin case. In this case\n(10) becomes(11)(syD cy)f= D cyn(1 D F).The right side of (11) is positive, which means that investment in education isbelow the efThcient and full information level. At the top of the range of n,\n(1DF)/f approaches zero and the investment in education is efThcient.22The maximin outcome in terms of investment in the signal is also the resultthat would obtain if there were a monopsonist purchaser of labor services.\nThe reason is that the monopsonist wants to maximize the difference be-\ntween productivity and gross wages, subject to the constraint that the net in-\ncome of the individuals with the lowest net income not fall below some pre-\nspeciThed level. Thus the solution to the monopsonistOs problem is to maxi-\nmize the net income of the lowest level and then take it all away by lowering\nw(y) uniformly across all education levels. Mathematically you are just rever-\nsing the objective function and one of the constraints.427(9)(10)21The derivation of this is a another application of the calculus of variations. You displace thefunction r(n) by #((n), differentiate the whole thing with respect to #, and set the result equal tozero. After some reversing of orders of integration, you end up with an equation of  the formSince this must hold for all functions !(n), the optimizing condition isQ(r(n),n) = 0. The application of all that to this case yields condition (10).22This follows from the fact that (1-F)/f is the reciprocal of the derivative of -log(1-F)... The opposite extreme occurs when the welfare function is extremely con-vex so that its slope rises rapidly. In the limit that would mean valuing only the\nnet incomes of those with the highest net incomes, the maximax case. In this\ncase, the optimizing condition (10) becomes(12)(syD cy)f= cynF.In this case, the right side of (12) is negative, implying that like the marketequilibrium with imperfect information, the investment in education goes be-\nyond the point at which the direction contribution to productivity is reached.\nAt the bottom end of the range of n, F/f approaches 0 and thus at the lowest\nlevels the investment in education is efThcient.23For the cases where v(N) is not approaching an extreme (very convex orconcave), one can see from (10) that the right side approaches zero when n\napproaches its minimum and its maximum values. Provided that f(n) does\nnot go to zero at the extremes, this would mean that at the end values of n, in-\nvestment in education is efThcient, that is syD cy= 0. This is generally not a fea-ture of the competitive equilibrium, and thus we may conclude that the com-\npetitive equilibrium is generally not the solution to some optimizing problem\nwith this form of social welfare function. It is possible to rewrite the optimiz-\ning condition (10) in the following form.where E(*|D) is the conditional expected value. For concave functions theterm in the large square brackets on the right is always positive and thus in-\nvestment in education is below the efThcient level for all n except possibly at\nthe end points. For convex welfare functions, the derivative is rising and thus\nthe term in square brackets is negative. The levels of investment in education\nexceed the efThcient ones.24If you stand back from all this, the general pattern is fairly clear. The mar-ket equilibrium produces overinvestment in the signal because of the signal-\ning effect, which is a private beneTht to the investor, but yields no social bene-\nTht as its function is purely redistributive. The redistribution occurs in the42823This follows from the fact that F/f is the reciprocal of the derivative of log(F).24Those familiar with optimal tax problems will recognize the form of this optimizing condition.In the income tax problem, individual welfare measured in dollars is u(w,l) = wlD t(wl) D h(l-D l),where w is income per hour worked, l is working hours and t(wl) is a tax on income, and l-is aconstant- one can think of it as the total time available. Individuals maximize u with respect to lby setting wD twD h= 0. The government has a revenue constraint so that                       If v(u)is the welfare function then we want to maximize                 Here you change the optimizing\nschedule to y(w), get rid of tax function t(y) by noting that                impose the revenue con-\nstraint to determine u(0), and the displace the function y(w) to Thnd the optimum. The optimum\nis achieved when                                                                             Note that if v(u) is linear, then\nthe right side of this equation is zero. Work leisure choices are efThcient and the government rev-enue is raised by a lump sum tax, which does not distort the work-leisure choice. direction of increasing the gross and net incomes of those with higher levelsof education and productivity and hence income, the market equilibria tend\nto look more like the solutions to a second-best optimizing problem with a\nconvex social welfare function. These, not surprisingly, are the welfare func-\ntions that weight higher net incomes more highly than lower net incomes. THE CASE OF EDUCATION COSTS RISING WITH THE UNSEEN ATTRIBUTE: SIGNALING COSTS VARY THE WRONG WAY WITH \nRESPECT TO PRODUCTIVITYThe standard case of signaling in which the signal has the capacity to surviveand retain its informational content occurs when there is an unobservable at-\ntribute that is valuable to buyers (in the examples we are looking at, em-\nployers), and the costs of undertaking some activity that is observable are ne-\ngatively correlated with the valued attribute. The labor market examples,\nhowever, are slightly more complicated in that in that the unobserved at-\ntribute contributes to the individualOs productivity and so does the signal.\nThus, whatever the unobservable attribute is, it has two sources of value. One\nis the direct effect on productivity and the other is that lowering the costs of\nacquiring human capital also has value. Up to this point we have assumed that\nall of this works in the same direction. But it is possible that attributes that\nlower the cost of acquiring education might not be those that enhance pro-\nductivity or might even be attributes that have a negative effect on producti-\nvity. We know that if Sn = 0, then you can get a signaling equilibrium, thoughin that case the signal isnOt needed: it simply identiThes ex post those with \nlower education costs and hence higher levels of education. The question I pose now is, can you get a signaling equilibrium when cyn> 0,assuming that sn> 0? From the analysis of equilibria, we know that the secondorder condition for the individualOs choice of education is satisThed only ifThis means that if cyn> 0 one can have an equilibriumwith signaling only if                 So the question is, can that happen? The only\nway it could happen is if the human capital effect is large in the sense that itoverrides the negative signaling effect. Thus if sy0, it certainly cannot hap-pen. The signal makes no direct contribution to productivity and sends the\nwrong message about the unobserved attribute. Everyone will set y = 0. But\nthe answer to the question posed above is yes, provided that the human capi-\ntal effect is large enough to override the negative signaling effect. There can\nbe signaling equilibria in which signaling costs rise with the level of the un-\nobserved attribute that contributes to productivity. I will demonstrate this by\nexample in a moment. Intuitively this should make sense if the human capital\neffect is big enough, because then the attribute that is of real value to the in-\ndividual and to the employer is the one that drives education costs down. The\nkey is that the wage schedule has to be upward-sloping in the signal, and this\ncan happen if syis big enough even if sn> 0. In this context, the correct state-ment about the condition that allows for a signaling equilibrium is that the429 net beneTht of acquiring the signal has to be positively correlated with thegross effect on productivity. This could happen in segments of the population\nif very talented people face high opportunity costs associated with spending\ntime on education. This case may or may not be interesting from an empirical point of view,but it does illustrate that the more general formulation of the conditions for\nsignaling are in terms of gross and net beneThts and not just signaling costs. I\ndid not realize this when I Thrst worked on signaling equilibria. I thought then\nthat the absence of the intuitively plausible negative cost correlation condi-\ntion would destroy a signaling equilibrium. It is also of potential interest be-\ncause the signaling effect is reversed. If cyn> 0, then in equilibrium if there issignaling, dn/dy < 0, and thusTherefore the negative signaling effect causes the private return to educationto fall short of the social return and hence causes under-investment in edu-\ncation.25It remains to show by a constructive example that this can happen atleast in the theory, and perhaps also in the world.We will show that this can happen with an example. Let s(n, y) = ny(, and letc(n, y)=n!y), where !< 1. Following the standard equilibrium analysis, wehave(13)w= cy= )n!y)D1.In addition w= ny(, or n = wy(. Substituting in (13), we have the differentialequation in w(y) that deThnes the equilibrium wage scheduleswD!w= )y()D1D!().One of the solutions to this differential equation is26where K is a constant. If you then proceed to determine equilibrium choicesof education, they are given bywhere T is another constant. The second order condition is satisThed and thisall works if dy/dn < 0 and this will in fact be the case provided that !< 1, and)< (. That is to say, signaling occurs and there is a separating equilibrium, ifthe elasticity of productivity with respect to education is larger than the elasti-\ncity of education costs with respect to education. Or in simple ordinary lan-43025I thought Professor Gary Becker whose pioneering work in human capital, household produc-tion functions and much more, might appreciate this result.26As this is simply an illustrative example, there is not much point in studying all the equilibria inthe example.. guage, education is productive enough to justify its costs and override thenegative signaling effect.Another way to think about these relationships and this case is to changethe unobserved variable from n to t= nDD n, where nDis the highest level of n.In effect this deThnes the unobserved characteristic to be that which lowers \neducation costs. Now investment in education will rise with t, provided there\nis a separating equilibrium, because cyt < 0. But the effect of t on productivityis now negative, and if that effect is strong enough relative to the human ca-\npital effect, then that will prevent a separating version of the signaling equi-\nlibrium. The reason is that unless the human capital effect is large enough,\nthe signaling effect will cause the wage function to be downward-sloping in y.\nThere will be a pooling equilibrium at y = 0 and that of course entails in the\nhypothetical example, reasonably dramatic under-investment in the potential\nsignal even though it is productive human capital.THE INFORMATION CONTAINED IN THE SIGNAL CAN IMPROVEPRODUCTIVITYIt should be noted that the information carried by the signal can be produc-tive itself. This will occur if there is a decision that is made better or with\ngreater efThciency, with better information. In the job market context, one\ncould build this in as follows. Let productivity be v(n,y,d) where d is a decision\nthat the employer makes. It could be a decision about what type of job to as-\nsign to someone or a decision about required training. One can interpret the\npreceding analysis then, at least for equilibria in which the signal carries in-\nformation in equilibrium, as s(n,y) being the maximum of v(n,y,d) with re-\nspect to d for each level of n and y. Note that this component of value is dif-\nferent from the human capital effect. Unlike the human capital effect, this\nelement of value only exists if the signal is carrying information in equili-\nbrium. You would lose it in a partial or complete pooling equilibrium even if\nthat equilibrium included investment in education.In situations like the Lazear model that we examined earlier, in whichthere is both pooling and separating components of the equilibrium, the ad-\ndition of a decision that is made better with information will cause the value\nof the signal to rise, or more accurately the net beneThts to rise. Those net\nbeneThts are passed on to individuals by virtue of competition on the employ-\ner side. Thus the relative sizes of the separating and pooling components of\nthe equilibrium will shift in favor of the separating part. More people will opt\nto go to the Thrms that incur the expense of monitoring and learning produc-\ntivity over time.431 TIME AND THE ALLOCATION OF TIME AS A SIGNAL AND A SCREENING DEVICE27The principles that govern the survival of signals in markets can be applied to\nother contexts. The kind of mixed or imperfectly aligned incentive structure\nthat characterizes markets is common in many situations. In particular, situa-\ntions in which individuals have an unknown or imperfectly perceived level of\ninterest in someone or something are ubiquitous. In these situations, one\nfrequently observes that time spent by the individual is taken as a signal of in-\nterest. Literature and everyday experience suggest that the allocation of time\nis a ubiquitous and persistent signal sometimes used deliberately as a screen-\ning device. The persistence of spending time as a signal of interest in something is a re-ssection of the fact that time is in short supply and everyone knows it. There is\na non- zero shadow price on time, and hence the use of it in pursuit of some\nperson, goal or interest must mean that some implicit net beneTht test has\nbeen passed for those who spent the time and failed for others who did not. The use and interpretation of time as a signal is complicated and enrichedby the accurate observation that there are both perceived and actual differ-\nences across people in the shadow price on time. These differences are used\nto interpret the signal. The allocation of a small amount of time by an indi-\nvidual with a high perceived shadow price on time has the same weight as a\nlarger allocation of time by an individual with a lower perceived shadow price.\nAs an example, those who have had visible leadership positions in virtually\nany organization know that the events they attend are taken as signals of in-\nterest and support, and conversely, when they do not show up, they delibe-\nrately and sometimes inadvertently signal a lack of interest, support or en-\nthusiasm. It is noteworthy that the informational content of these common\nsignals is not necessarily related to whether the individual (the signaler) is ac-\ntually needed or has a role at the event. In fact, having a role at the event can\ndilute the signal because it complicates the interpretation of the reason for\nthe leaderOs presence.Time is also routinely used as a screening device or as part of the price ofadmission to events at which the number of places is in short supply. For en-\ntertainment and sporting events it is common to Thnd that a mixed system that\ninvolves both price and time is used to allocate the limited number of places\nat the event. The question that I address briessy in this section is why the\nmixed system would be used in preference to the pure price system. The in-\ntuitive answer is that willingness or ability to pay may be a poor signal of real\ninterest in the event, not withstanding the fact that failure to use the price sys-\ntem is inefThcient for two reasons.28The mixed system allocates places or ac-43227Part of this section is based on a nearly unknown (probably for good reason) paper by the author, OTime and Communication in Economic and Social Interaction,O Quarterly Journal ofEconomics.28There are performers who want people with a genuine interest, and not just those with an in-terest and high incomes at the events, and who feel that the quality of the event is affected by in-\nteraction between the performer and among members of the audience. cess to those who would (and often do if there is a secondary market) sell theplace to someone with a higher willingness to pay D when that happens both\nparties are better off. Second, the time that is used to acquire the places is a\ndead-weight loss under most circumstances. Notwithstanding the clear prob-\nlems with the failure to use the price system, the use of the mixed system is\nvery common, and must mean that some objective is being pursued that is\nnot respectful of the current distribution of income. For if the distribution of\nincome is viewed as optimal, it is hard to conjure up a rationale for incurring\nthe costs of the mixed system mentioned above.I am going to use a simple example to look at the effects of using a mixedsystem for this class of resource allocation problems. It is not meant to be a\ngeneral model, but rather to suggest what parameters are important in de-\ntermining the performance characteristics of the outcome. Let the value attached to an event by an individual be (. One can think ofthis as a dollar valuation based on a roughly equal distribution of income, or\nyou can think of it as a measure of value in a pure time system. What it is not\nis a current willingness to pay for access to the event. It is uniformly distri-\nbuted in the population, on the interval [0,1]. The value of money is *. It also is distributed uniformly in the population on the interval [0,1]. The as-\nsumption about the value of time at the margin is that it is equal to GD !*. Ifthe parameter a is zero, then it is a constant, if a > 0, then the marginal value\nof time is negatively correlated with the marginal value of income, and the\nconverse is also true. The fraction of the population that can have access to\nthe even is N, and we will assume that N < 0.5. Finally let p be the monetary\nprice for access to the event and let T be the time price. The set of people who attend the event is the people with combinationsof((, *) that satisfy the inequality(D *p D (G D !*)T = (D (pD !T)*D GT \" 0.Let S = GT and R = p D aT. Then the inequality above becomes (D R*D S \" 0.Let A = {((,*)):(D R*D S \"0}. Then because of the Thxed supply, the area ofthe region associated with A has to be N.Figure 7 is useful in analyzing the choices. Each of the lines inside the unitsquare represent combinations of R and S, so that the area above the line is\nN. The line through the origin represents the pure price system. As the time\nprice T is raised, S rises and R falls. It is easy to see without a complicated\nproof that as T rises, the average value of ( is rising while the total numbersstay the same, so that the total gross value to consumers is rising. This conti-\nnues until the line goes ssat, at which point R = 0. It is also clear that the in-\ncreases are largest for low levels of T or S, because initially one is trading low\nlevels of ( for much higher levels.It is possible that the mixed time and price system is commonly used simplyto achieve this result, namely allocating the spots to those who attach the\nhighest value to them, and that whoever makes these decisions doesnOt think433 about or care about the dead weight cost of the time component of the price.But perhaps a more interesting question is whether the use of the mixed sys-\ntem ever increases the net beneThts. We will assume that the dollar revenue is\ndistributed in a neutral way so that price component of the access charge ge-\nnerates neither net beneThts or costs. The time component of the access\ncharge however generates a dead weight cost. The net beneThts areThe second two terms are the dead-weight cost of the time component of theaccess charge. We have already observed that the Thrst term, the gross beneThts,\nare a rising function of S = GT, ressecting the use of time as part of the allo-\ncation mechanism. This is true independent of the sign or size of the para-\nmeter OaO. Moreover, one can see from Figure 7 that starting at S = 0, the\ngains from increasing S, or T, are largest at the start (that is near S = 0) be-\ncause as the lines rise and rotate right, low average levels of the valuation pa-\nrameter (are being knocked out and high ones are being brought in. Thedifference between the exits and the entries steadily declines as S increases,\nand the lines become ssatter.This brings us to the question of whether the net beneThts also increase atleast over some range as s increases. It is somewhat tedious but not difThcult to\nshow that in this example that the slope of gross beneThts at S = 0 is 434Figur 7 The derivative of net beneThts at S = 0 is29If the parameter a is zero, then one can see that in this example, the dead-weight costs outweigh the gain in gross beneThts. However if OaO is positive and\nlarge enough, then the net beneThts rise at least over some range. Why should\nthis occur intuitively? Here price is a badly ssawed signal of value. Time, if its\nmarginal cost is uncorrelated with price, is a better signal of value, but not\ngood enough to overcome the dead-weight cost. But if the marginal cost of\ntime is negatively related to the marginal value of income, then the combina-\ntion of price and time is a much better signal of value. And if marginal time\ncosts fall quite rapidly as the marginal value of income increases, then the\ncost of the time that is need to screen out the high income-low value purchasersis relatively low.To illustrate, Figure 8 shows the value of net beneThts as a function of S, fora case in which G = 2, N = .25 and a = 14. Here the reader should ignore the\nhigher levels of S, as they are associated with negative prices. Above a certain\nlevel of S, or time cost, the model starts redistributing income, which is\ncounter to the spirit of the analysis.30To summarize, while this simple example hardly disposes of the issue ofhow markets go about trying to solve complex allocation problems in a world\nof imperfect information, it does, I hope, suggest that the kinds of mixed sys-\ntems that we observe in reality may be quite innovative solutions to these\nproblems and probably should not be dismissed in all cases as mistakes made\nby people who donOt understand the virtues of the price system. There may\neven be more interesting and less wasteful alternative currencies, such as\nhours spent in public service work, that could be used in conjunction with the\nprice system to allocate highly valued access to important events. While such\nalternatives might not be as effective as time in undoing the effect of the price\nsystem, they may also have considerably less dead weight cost associated with\nthem.43529These results follow from the following facts. For R + S > 1,                  gross beneThts areand the dead weight time cost is                              Similarly,when R + S < 1, which occurs as S becomes larger, R= 2(1 D SD N), gross beneThts are (1/2)[(1 DS2) D RSD (R2/3], and the dead weight cost of the use of time is                      When R + S = 1, theline that separates those who are admitted from those who are not goes through the point (1,1)which is why the formulae shift at that point.30The existence of secondary market will to some extent reduce the beneTht of the mixed systembecause it will draw into to primary allocation system entrepreneurs who are there to use their\nrelatively low valuation on time to make an arbitrage proTht. They will bid up the price required\nto clear the primary market and hence drive some of those with high gross valuations of the\nevent from that market.. THE INTERNET AND THE CHANGING INFORMATIONAL STRUCTUREOF MARKETSThe proposition that the internet, or more accurately its relatively recent ac-cessibility to a broad spectrum of users, has changed the informational struc-\nture of many markets, industries and economies, is probably not controver-\nsial. One could argue about how rapid the change has been from quite\nsudden on the one hand to a gradual evolution from the telegraph (which\nwas the Thrst time that communication over distance did not require the phy-\nsical movement of something and hence became in a certain sense nearly in-\nstantaneous) through radio, the telephone, television, fax etc. on the other. It\nhas also been easy for some to dismiss all of this as a fad, relying on the boom-\nand-bust cycle that we have just observed. But in my judgment that would be\na mistake. We know from the economics of information that there are periods\nin which enough has changed so that we operate in a data-free environment,\nthat is, one in which there is temporarily little or no relevant data to constrain\nexpectation. The data trickle in and the beliefs and expectations start to line\nup with reality again. The more fundamental point is that investors and others were probably notwrong about the ultimate effect of this technology on markets and the eco-\nnomy, but almost everyone overestimated the speed with which individuals\nand organizations change their behavior, and we also underestimated the\namount of difThcult technical infrastructure that needed to be built in order\nto have the foreseen outcomes become a reality. We would undoubtedly have\nbeen better off if we had reminded ourselves of the important work of the\nlate Zvi Griliches on the diffusion of innovation, as that would have caused\nsome questioning of the assumption that what very intelligent people can436Figure 8 foresee will come about quickly. I wanted also to recognize ZviOs work as anearly and very important example of behavioral economics.Nevertheless there are powerful forces driving the outcomes and changingthe informational structure of markets. Three of the most important are\nMooreOs law, MetcalfeOs law and the dramatic reduction of the noise to signal\nration in Thber optic cable resulting in very large expansions in the through-\nput capacity of these pipes measured in signal processing terms. MooreOs law\nis well-known. It is an empirical observation that the number of transistors on\na chip doubles every eighteen months to twenty-four months. To a Thrst ap-\nproximation this has produced roughly a 10-billion-times cost reduction in\nthe Thrst Thfty years of the computer age, dated from about 1950. Or to put it\nanother way, things that were imaginable but unimaginably expensive in 1950\nare essentially costless today. Economic historians will be better able than I to\nsay whether there were comparable periods of change in the past with respect\nto costs of doing something important.MetcalfeOs law states that the value of a network to the entities attached to itis proportional to the square of the number of connected entities.31In eco-nomic terms this probably means that the value and hence the speed of con-\nnecting accelerates as the numbers increase. This is sometimes referred to as\nthe network effect. From signal processing theory we know that the capacity of a channel isproportional to the log of one plus the ratio of signal to noise. Through \nscientiThc and technical advances (in addition to being able to use lasers with\nmultiple wavelengths), the noise generated when the light ressects off the side\nof the Thberoptic cable is being reduced dramatically, causing very large in-\ncreases in data rates on existing Thber. In economic terms this translates into\nlarge cost reductions in providing bandwidth.These three effects interact with each other over time to produce accele-rating economic effects. Much of the recent economic impact of the internet\nis associated with reducing transaction costs of a variety of kinds. I will return\nto this subject in a moment. For most of these effects, one needs not just com-\nputing power, but also a reasonably ubiquitous reliable network that has stan-\ndardized protocols, is more or less always on. After all, transactions involve,\nalmost by deThnition, more than one party, though increasingly one or more\nof the parties are machines. It is interesting and not surprising therefore, that\nfor the Thrst forty years of the proliferation of computers, not much measur-\nable productivity increase was detectible in macroeconomic data. In the past\nten years, the period in which the expansion of the network occurred, there\nare noticeable measurable productivity gains. It seems very likely that the pro-43731This should be thought of as an empirical regularity as well. It can be derived as follows.Suppose that the value a person to each other person on a network is x. If there are n people on\nthe network and we add another person, the n people experience added value of nx and the new\nperson experiences value of nx. If V(n) is the value of a network, being the sum of its value to all\nconnected people, then V(n + 1) = V(n) + 2nx. Therefore V(n) = 2x[1 + 2 + ... + (n-1)]. Using\nGaussOs formula for the sum of the integers from one to n, we have V(n) = 2xn(n-1), which is the\nquadratic relationship that MetcalfeOs law asserts. ductivity gains (the ones we can detect) are associated with reduced transac-tion costs, improved performance of markets, the ability to create new mar-\nkets that were too expensive to create without the technology, and the im-\nportant ability to take time and cost out of the coordination of economic\nactivity, inside the Thrm and in the supply or value-added chain. That is what\nthe network, with high and reliable capacity, with growing numbers connec-\nted to it and with enough computing power to run the endpoints and the\nnodes has permitted. It is a cumulative effect that we are just beginning to\nsee.Building models in economics is an art and a science. The science part con-sists of determining analytically the consequences of the assumption that cre-\nate the structure of the model. The art consists in deciding what to put into\nthe structure and what to leave out. Putting in too much makes the models in-\ntractable and of little use in illuminating the determinants of market perfor-\nmance. Putting in either too little or the wrong structural features makes the\nresults, though tractable, uninteresting. A natural consequence of this is that\nparameters that donOt change much from market to market or over time tend\nto be suppressed, as a matter of good practice in applied microeconomic the-\nory. I mention all of this because it is possible and even likely that some para-\nmeters related to search costs, transaction costs, acquiring information, and\ngeography have shifted reasonably rapidly in the past few years (or are in the\nprocess of shifting), as a result of the increasing speed, ubiquity and connec-\ntivity of the internet. This potential shift in parameters creates the opportu-\nnity to revisit aspects of the informational structure of markets and organiza-\ntions, and in a sense, reintroduce the suppressed parameters as they have\nbecome interesting again. I would like to conclude this essay by suggesting a\nfew areas in which such an inquiry might yield some interesting results. One might have the impression from a Thrst course in economic theory thatmarkets combine supply and demand curves to produce prices, quantities\nand to determine who buys the good. There is nothing wrong with that view.\nBut in addition, a market economy performs lots of other functions. Potential\nbuyers and sellers need to Thnd each other. Often buyers and sellers need to\nacquire information about each other and about the product. If the buyers,\nsellers, and products are differentiated, then there is a matching problem\nthat in one form or another needs to be resolved in the marketplace. If sellers\nare charging different prices, then buyers need to consider engaging in some\nsort of reasonable search for the lower prices. These functions are not per-\nformed costlessly, and the costs of performing them are frequently lumped\ntogether under the heading of transaction costs. Broadly these costs are being\nchanged and lowered by the internet. BUYERS AND SELLERS FINDING EACH OTHERProbably the most obvious example of reduced transaction costs is that asso-ciated with the rapid expansion of the markets for collectibles and used pro-\nducts of all kinds. In this arena the overwhelmingly largest market making en-438 tity is eBay. There are on average 750,000 transactions or each day with an av-erage total daily dollar volume of 30 million.32Most of these markets simplydid not exist previously, and those that did exist were more costly to create,\nless efThcient, and less liquid. It is worth noting that the drop in the cost of\nbuyers and sellers Thnding each other is largely independent of physical geo-\ngraphy (recall that both distance and time are simultaneously compressed\nwith the internet technology). This partial removal of the geographic bounds\nof markets makes them more liquid and in a certain sense more competitive.\nHowever, there are elements of natural monopoly in the market-making func-\ntion. As the number of bidders increases the expected winning bid rises in\nthese auctions. Hence the marketplace that is in the lead will attract the sell-\ners, and the variety of products will attract the buyers.33Figure 9 shows the re-lationship between the number of bidders and the expected selling price in\nan ordinary auction.43932Figures from Jeff Skoll, cofounder of eBay. There are of course more markets open in any giv-en day than there are transactions.33There is a potential qualiThcation to this tendency. Intelligent software agents are in principlecapable of searching for low prices across marketplaces. If individuals were prepared to use these\nagents, that would eliminate the liquidity advantage of the larger market-makers. However, this\ndoes not appear to have happened, at least not to the extent that it signiThcantly diminishes eBayOs\nadvantage. The making of online markets is pretty clearly a potential area for research.Figure 9 SEARCHING FOR THE LOWEST PRICEThe late George Stigler recognized that Thnding the lowest price was an acti-vity that required resources and that there was a tradeoff between incurring\ncosts of further search and the expected beneThts of Thnding even lower prices.\nFor prices that are posted in an internet environment, the cost of Thnding the\nlowest price is pretty close to zero. In principle, this should eliminate price\ndispersion by eliminating one side of the tradeoff. There was a kind of natu-\nral partial protection from price competition, the magnitude of which is a\nfunction of the search costs. The reduction or elimination of these search\ncosts in the Thrst instance increases competition. However there is probably\nmore to this story. The decision to post a price is a strategic decision and in\nthe face of negligible search costs, it is possible that sellersO willingness to post\nprices will decline and that there will be more negotiated prices or prices that\nare tailored to the individual buyer.THE BOUNDARIES OF THE FIRMThere is a well-known and important literature in economics associated withRonald Coase and Oliver Williamson and others. It deals in part with the fun-\ndamental question of the question of what economic processes are contained\nwithin a Thrm and which are mediated by markets, that is, transaction between\nThrms. One aspect of this general set of questions has to do with outsourcing:\nthe decision to conduct a certain set of activities in-house or to contract with\nanother entity to have them conducted for the Thrm. Generally on the side of\noutsourcing is the likelihood that certain functions can be performed better\nby specialists who have the advantages of economies of focus and scale.\nCountering that are the contracting, monitoring and implementation costs of\nhaving a second party provide the service. Some of these countervailing costs\nare just transaction costs associated with complexity in communication. It is\nbecoming reasonably clear that the internet platform is reducing some of\nthese transaction costs and hence tipping the balance in a number of areas in\nthe direction of outsourcing. Many, if not most, informationally based ser-\nvices are efThciently deliverable and monitorable on the platform. We have in a sense, for the period of transition, a natural laboratory inwhich transaction cost parameters are being shifted, resulting in new experi-\nmental behavior on the part of Thrms. In general, the range of economic acti-\nvity that can be effectively coordinated across a complex multiThrm supply\nchain is just starting to be explored by companies and those who do research\non these subjects. The boundaries of the Thrm, transaction costs, supply chain\narchitecture and coordination, and outsourcing are all facets of a large mosaic\nin which incentives, communication and coordination, and the boundaries of\nthe Thrm are worked out. The outsourcing extends to the employment rela-\ntionship, where again the relative costs of in-house and the outsourced re-\nsources may have shifted. I hasten to add that these issues are far from being\nsettled in the world of practice and in the world of economic research.440 BIBLIOGRAPHYAkerlof, George. OThe Economics of Caste and of the Rat Race and Other Woeful Tales,OQuarterly Journal of Economics90 (November 1976): 599D617.D OGift Exchange and EfThciency Wage Theory: Four Views,O American Economic Review74(May 1984): 79D83.D OLabor Contracts as Partial Gift Exchange,O Quarterly Journal of Economics97 (November1982): 543D69.D OThe Market for `Lemons': Quality Uncertainty and the Market Mechanism,O QuarterlyJournal of Economics 84 (August 1970): 488D500.Alchian, Armen A., and Demsetz, Harold. OProduction, Information Costs, and EconomicOrganization,O American Economic Review 62 (December 1972): 777D95.Arnott, Richard J., and Stiglitz, Joseph E. OMoral Hazard and Nonmarket Institutions:Dysfunctional Crowding Out or Peer Monitoring?O American Economic Review81 (March1991): 179D90.Arrow, Kenneth J. Essays in the Theory of Risk Bearing. Chicago: Markham, 1971.D OHigher Education as a Filter,O Journal of Public Economy 2 (July 1973): 193D216.D OModels of Job Discrimination,O in Racial Discrimination in Economic Life, A. Pascal, ed.Lexington, Mass.: Lexington Books, 1972.D OThe Role of Securities in the Optimal Allocation of Risk Bearing,O Review of EconomicStudies 31 (1964): 91D96.D OThe Organization of Economic Activity,O in The Analaysis and Evaluation of PublicExpenditures: The PPB System, 1, Joint Economic Committee, 91stCongress, Washing-ton, DC, 1969.Atkinson, Anthony, OMaximin and Optimal Income Taxation,O Working Paper, circa 1971.\nBaker, George, Michael Gibbs and Bengt Holmstrim. OThe Internal Economics of theFirm: Evidence from Personnel Data,O Quarterly Journal of Economics, November, 1994:881D919.Becker, Gary S. The Economic Approach to Human Behavior. University of Chicago Press, 1976. Becker, Gary S. The Economics of Discrimination. Chicago: University of Chicago Press, 1957.HD 4903 .5 .U5B4.D OHuman Capital and the Personal Distribution of Income,O W. S. Wotinsky Lecture #1,University of Michigan, 1967.D Human Capital: A Theoretical and Empirical Analysis, with Special Reference to Education, 2d ed.New York: Columbia University Press for National Bureau of Economic Research, 1975.D OInvestment in Human Capital: A Theoretical Analysis,O Journal of Political Economy 70(October 1962): 9D49.Bergmann, B. OThe Effect on White Incomes of Discrimination in Employment,O Journal ofPolitical Economy 76 (March/April 1971): 294D313.Bergmann, Barbara. OOccupational Segregation, Wages and ProThts when EmployersDiscriminate by Sex,O Eastern Economic Journal2, pp. 103D110.Bhattacharya, Sudipto; Partha Dasgupta, and Dilip Mookherjee, OPatents and Choice ofTechnique in Research and Development,O Journal of Political Economy(March 1984).Bhattacharya, Sudipto, and J. Luis Guasch, OHeterogeneity, Tournaments, and Hierar-chies,O Journal of Political Economy96 (August 1988): 867D81.Bowles, Samuel. OSchooling and Inequality from Generation to Generation,O Journal ofPolitical Economy 82 (May/June 1972):S219DS251.Cain, Glen G. OThe Economic Analysis of Labor Market Discrimination: A Survey,O inHandbook of Labor Economics, O. Ashenfelter and R. Layard, eds. Amsterdam: NorthHolland, 1987.Carlton, Dennis W. OPlanning and Market Structure,O in The Economics of Information andUncertainty, ed. John J. McCall. Chicago: University of Chicago Press, 1982.Coase, Ronald H. OThe Nature of the Firm,O Economica4 (November 1937): 386D405.D OThe Problem of Social Cost,O Journal of Law and Economics (October 1960): 1D44.441 Cohen, K. J., and Cyert, R. M. Theory of the Firm: Resource Allocation in a Market Economy, 2ded. Englewood Cliffs, NJ: PrenticeDHall, 1975.Debreu, Gerard. The Theory of Value. Cowles Foundation Monograph No. 17. New Haven,CT: Yale University Press, 1959.Diamond, Peter, and Michael Rothschild, Uncertainty in Economics. New York: AcademicPress, 1978.Doeringer, P., and M. Piore, Internal Labor Markets and Manpower Analysis. Lexington, Mass.:D.C. Heath, 1971.Downs, Anthony. An Economic Theory of Democracy. New York: Harper & Row, 1957.Ekern, S. and R. Wilson, OOn the Theory of the Firm in an Economy with IncompleteMarkets,O Bell Journal of Economics and Management Science. 5 No. 1 (Spring 1974).Fama, Eugene. OAgency Problems and the Theory of the Firm,O Journal of Political Economy(April 1980): 288D307.Fogel, Robert William, and Stanley L. Engerman, Time on the Cross: The Economics of AmericanNegro Slavery(New York: W. W. Norton, 1989).Gibbons, Robert. OPiece-Rate Incentive Schemes,O Journal of Labor Economics5 (October1987): 413D29.Gibbons, Robert, and Lawrence F. Katz, OLayoffs and Lemons,O Journal of Labor Economics9(October 1991): 351D80.Griliches, Zvi. OEstimating Returns to Schooling: Some Econometric Problems,O Econo-metrica 45 (1977).Grossman, Sanford, and Joseph Stiglitz, OOn the Impossibility of Informationally EfThcientMarkets,O American Economic Review 70 (1980): 393D408.Hart, Oliver D. OOptimal Labour Contracts under Asymmetric Information: An Introduc-tion,O Review of Economic Studies 50 (1983): 3D35.Hirshleifer, J. OThe Private and Social Value of Information and the Reward to InventiveActivity,O American Economic Review 51 (September 1961): 561D74.Holmstrim, Bengt OMoral Hazard and Observability,O Bell Journal of Economics10 (Spring1979): 74D91.D OMoral Hazard in Teams,O Bell Journal of Economics 13 (Autumn 1982): 324D40.Jencks, Christopher, et al.Inequality. New York: Basic Books, 1972. LB 3062 .I42.Kreps, David M.; Paul Milgrom, John Roberts and Robert Wilson, ORational Cooperation inthe Finitely Repeated Prisoners' Dilemma,O Journal of Economic Theory27 (August 1982):245D52.Lazear, Edward Personnel Economics for Managers, Edward P. Lazear. New York: John Wiley &Sons, 1998.D \"Salaries and Piece Rates,\" Journal of Business59 (July 1986): 405D31.D OEducational Production,O Quarterly Journal of Economics, August, 2001.Leibenstein, Harvey. OAllocation EfThciency vs. OX-EfThciency,OO American Economic Review 56(June 1966): 392D415.Levhari, D., and Yoram Weiss, OThe Effect of Risk and Investment in Human Capital,OAmerican Economic Review 64 (December 1974): 950D63.McCall, J. J. OEconomics of Information and Job Search,O Quarterly Journal of Economics84(197?): 113D26.Mincer, Jacob. Schooling, Experience, and Earnings. New York: Columbia University Press forNBER, 1974.Mirrlees, James A. OAn Exploration in the Theory of Optimum Income Taxation,O Review ofEconomic Studies 38 (1971): 175D208.D OThe Optimal Structure of Incentives with Authority within an Organization,O Bell Journalof Economics 7 (Spring 1976): 105D31.D OThe Optimum Town,O Swedish Journal of Economics 74 (1972): 114D35.Modligiani, Franco, and Merton Miller, OThe Cost of Capital, Corporation Finance and theTheory of Investment,O American Economic Review(June 1958).Nelson, Phillip. OInformation and Consumer Behavior.O Journal of Political Economy 78(March/April 1970): 311D329.442 Pencavel, John. OWork Effort, On-the-Job Screening, and Alternative Methods of Remune-ration,O in Research in Labor Economics, vol. 1, Ronald Ehrenberg, ed. Greenwich, Conn.:JAI Press, 1977.Radner, Roy, and Michael Rothschild, OOn the Allocation of Effort,O Journal of EconomicTheory 10 (June 1975): 358D76.Ramsey, F.P. OA Contribution to the Theory of Taxation,O Economic Journal 37 (1927) 47D61.Riley, John G. OCompetitive Signalling,O Journal of Economic Theory 10 (April 1975): 174D86.Rogerson, William. ORepeated Moral Hazard,O Econometrica 53 (January 1985): 69D76.Ross, Stephen A. OThe Economic Theory of Agency: The Principal's Problem,O AmericanEconomic Review 63 (May 1973): 134D39.Rothschild, Michael, OSearching for the Lowest Price When the Distribution of Prices IsUnknown,O The Journal of Political Economy, Vol. 82, No. 4. (Jul.DAug., 1974): 689D711.D OModels of Market Organization with Imperfect Information: A Survey.O Journal of PoliticalEconomy81 (November/December 1973): 1283D1308.Rothschild, Michael, and Stiglitz, Joseph E. OEquilibrium in Competitive InsuranceMarkets: An Essay on the Economics of Imperfect Information,O Quarterly Journal ofEconomics 90 (November 1976): 629D49.D OIncreasing Risk: I. A DeThnition,O Journal of Economic Theory 2 (1970): 225D43.Salop, Joanne, and Steven Salop, OSelf-Selection and Turnover in the Labor Market,OQuarterly Journal of Economics 90 (November 1976): 619D27.Samuelson, Paul A. OFoundations of Economic Analysis.O Harvard Economic Studies. HB31. H33 v.80.Schelling, Thomas. The Strategy of Conssict. Cambridge: Harvard University Press, 1960.Simon, Herbert A. Models of Man. New York: John Wiley & Sons, 1957.Solow, Robert M. OInvestment and Technical Progress,O in Mathematical Models in the SocialSciences, Kenneth J. Arrow, S. Karlin, and P. Suppes, eds. Stanford: Stanford UniversityPress, 1960.Spence, Michael,Market Signaling: Informational Transfer in Hiring and Related Processes,Cambridge: Harvard University Press, l974.D \"Insurance, Information, and Individual Action,\" (with R. J. Zeckhauser), American Econo-mic Association, Papers and Proceedings, May l97l.Spence, Michael and Richard J Zeckhauser,\"The Effect of the Timing of ConsumptionDecisions and the Resolution of Uncertainty on the Choice of Lotteries,\" Econometrica,March l972.Spence, Michael, \"Job Market Signaling,\" Quarterly Journal of Economics, August l973.D \"Time and Communication in Economic and Social Interaction,\" Quarterly Journal ofEconomics, November l973.D \"Competitive and Optimal Responses to Signals: An Analysis of EfThciency andDistribution,\" Journal of Economic Theory, March l974.D \"Consumer Misperceptions, Product Safety and Producer Liability,\" Review of EconomicStudies, October l977.D \"Competition in Salaries, Credentials, and Signaling Prerequisites for Jobs,\" QuarterlyJournal of Economics, February l976.D \"An Economist's View of Information,\" in Annual Review of Information Science andTechnology, vol 9, l974,Carlos Cuadra, ed. American Society for Information Science.D \"The Economics of Internal Organization: An Introduction,\"Bell Journal of Economics,Spring l975.D \"Informational Aspects of Market Structures: An Introduction,\" Quarterly Journal ofEconomics. l976.D \"Markets and Imperfect Information,\" Portfolio, vol 5, number 5.D \"Product Differentiation and Consumer Choice in Insurances Markets,\" Journal of PublicEconomics,l979.D \"Signaling and Screening,\" in S. Rosen, ed. Low Income Labor Markets, National Bureau ofEconomics ( forthcoming).443 Stigler, George J. OThe Economics of Information,O Journal of Political Economy69 (June1961): 213D25.D OInformation in the Labor Market,O Journal of Political Economy 70 (October 1962): S94DS104.Stiglitz, Joseph E. OApproaches to the Economics of Discrimination,O American EconomicReview63 (May 1973): 287D95.D OIncentive and Risk Sharing in Sharecropping,O Review of Economic Studies 41 (April 1974):219D56.D OIncentives, Risk, and Information: Notes Toward a Theory of Hierarchy,O Bell Journal ofEconomics and Management Science 6 (August 1975): 552D79.D OThe Theory of `Screening', Education, and the Distribution of Income,O AmericanEconomic Review 65 (June 1975): 283D300.Stiglitz, Joseph E., and Andrew Weiss, OIncentive Effects of Terminations: Applications tothe Credit and Labor Markets,O American Economic Review 73 (December 1983): 912D27.Thurow, Lester. OEducation and Economic Equality,O Public Interest 28 (Summer 1972):66D81.Tversky, Amos, and Daniel Kahneman, OThe Framing of Decisions and the Psychology ofChoice,O Science211 (1981): 453D58.D OJudgment under Uncertainty: Heuristics and Biases,O Science 185 (September 1974):1124D31.Waldman, Michael. OJob Assignments, Signalling, and EfThciency,O Rand Journal of Economics15 (Summer 1984): 255D67.D OUp-or-Out Contracts: A Signalling Perspective,O Journal of Labor Economics8 (April 1990):230D50.Weiss, Andrew. EfThciency Wages: Models of Unemployment, Layoffs, and Wage Dispersion.Princeton: Princeton University Press, 1990.D OJob Queues and Layoffs in Labor Markets with Flexible Wages,O Journal of PoliticalEconomy88 (June 1980): 526D38.Wilson, Robert. OThe Theory of Syndicates,O Econometrica 68 (1968): 119D32.Williamson, Oliver E. OThe Vertical Integration of Production: Market Failure Considera-tions,O The American Economic Review, Vol 61, No. 2 (May 1971).D Corporate Control and Business Behavior, Englewood Cliffs: Prentice Hall, 1970.444"}, "death_city": "", "id": "745", "bornCountryCode": "US"}