{"death_country": "", "bio": {"url": "http://www.nobelprize.org/nobel_prizes/chemistry/laureates/2004/ciechanover-bio.html", "words": "The       formative years - childhood in the newly born state of Israel I was born in Haifa, a port city in the northern part of Israel, in October 1947, one month before Israel was recognized by the United Nations (UN) as an independent state. It took several additional months to establish the necessary institutions and for the British to leave, and on May 15th 1948, David Ben-Gurion, the founding father of the modern Jewish state and its first Prime Minister, made Israel a fact and declared its establishment as a democratic state and a home for every Jew in the world. The neighboring, but even more distant Arab countries, along with powerful Arab parties from within, did not accept the UN resolution and deliberately decided to alter it by force. A bloody and costly war erupted. It lasted a year, and more than 1% of the population of the newly born and defenseless state sacrificed their lives on its defense. I assume that the first two years of my life (1947-1949) were extremely difficult for my parents, Bluma (nee Lubashevsky) and Yitzhak, who immigrated from Poland with their families as adolescents in the mid-1920s. Why did their families leave Poland - their \"homeland\" - their houses, working places, property, relatives and friends, and decided to make their new home in a place with a vague, if any, clear future, that was part of the British Empire? They were idealists who enthusiastically followed the call of the Zionist movement that was established at the turn of the century by Benjamin Ze'ev Herzel - the seer of the Jewish State - to settle the land and make it - after two thousand years in the Diaspora, since the destruction of the temple in Jerusalem - a home for the Jews. Following the Jewish Congress in Basel (Switzerland) in 1896, Herzel declared: \"In Basel I founded the Jewish State\". At that time Israel was part of the Ottoman Empire and became in 1917 part of the British Empire. My parents came from religious families, and the move, I believe, had also religious roots: Jews, throughout their lives in the Diaspora, have not stopped dreaming of having their own country, with Jerusalem as its capital, a dream that was driven by a biblical decree and prophecy: \"Thus saith the Lord GOD: Behold, I will take the children of Israel from among the nations, whither they are gone, and will gather them on every side, and bring them into their own land\" (Ezekiel 37:21); \"And they shall dwell in the land that I have given unto Jacob my servant, wherein your fathers dwelt; and they shall dwell therein, they, and their children, and their children's children, for ever\" (Ezekiel 37:25); \"And I will rejoice in Jerusalem, and joy in my people; and the voice of weeping shall be no more heard in her, nor the voice of crying\" (Isaiah 65:19); \"And they shall build houses, and inhabit them; and they shall plant vineyards, and eat the fruit of them\" (Isaiah 65:21).", "title": "Aaron Ciechanover - Biographical"}, "first_name": "Aaron", "last_name": "Ciechanover", "area": "chemistry", "gender": "male", "death_date": "", "share": "3", "motivation": "\"for the discovery of ubiquitin-mediated protein degradation\"", "birth_city": "Haifa", "affiliations": [{"city": "Haifa", "name": "Technion - Israel Institute of Technology", "country": "Israel"}], "speech": {"date": "", "url": "", "location": "", "words": ""}, "birth_country": "British Protectorate of Palestine (now Israel)", "diedCountryCode": "", "year": "2004", "birth_date": "1947-10-01", "lecture": {"date": "", "url": "", "location": "", "words": ""}, "death_city": "", "id": "779", "bornCountryCode": "IL"}