{"death_country": "", "bio": {"url": "http://www.nobelprize.org/nobel_prizes/chemistry/laureates/1999/zewail-bio.html", "words": "On the banks of the Nile, the Rosetta   branch, I lived an enjoyable childhood in the City of Disuq,   which is the home of the famous mosque, Sidi Ibrahim. I was born   (February 26, 1946) in nearby Damanhur, the \"City of Horus\", only   60 km from Alexandria. In retrospect, it is remarkable that my   childhood origins were flanked by two great places - Rosetta, the   city where the famous Stone was discovered, and Alexandria, the   home of ancient learning. The dawn of my memory begins with my   days, at Disuq's preparatory school. I am the only son in a   family of three sisters and two loving parents. My father was   liked and respected by the city community - he was helpful,   cheerful and very much enjoyed his life. He worked for the   government and also had his own business. My mother, a   good-natured, contented person, devoted all her life to her   children and, in particular, to me. She was central to my \"walks   of life\" with her kindness, total devotion and native   intelligence. Although our immediate family is small, the Zewails   are well known in Damanhur.", "title": "Ahmed Zewail - Biographical"}, "first_name": "Ahmed H.", "last_name": "Zewail", "area": "chemistry", "gender": "male", "death_date": "", "share": "1", "motivation": "\"for his studies of the transition states of chemical reactions using femtosecond spectroscopy\"", "birth_city": "Damanhur", "affiliations": [{"city": "Pasadena, CA", "name": "California Institute of Technology (Caltech)", "country": "USA"}], "speech": {"date": "1999-12-10 00:00:00", "url": "http://www.nobelprize.org/nobel_prizes/chemistry/laureates/1999/zewail-speech_en.html", "location": "Stockholm", "words": " Ahmed Zewail's speech at the Nobel Banquet,   December 10, 1999 Your Majesties, Excellencies, Ladies and   Gentlemen,    Let me begin with a reflection on a personal story, that of a   voyage through time. The medal I received from his Majesty this   evening was designed by Erik Lindberg in 1902 to represent Nature   in the form of the Goddess Isis - or eesis - the Egyptian Goddess   of Motherhood. She emerges from the clouds, holding a cornucopia   in her arms and the veil which covers her cold and austere face   is held up by the Genius of Science1. Indeed, it is the genius of science   which pushed forward the race against time, from the beginning of   astronomical calendars six millennia ago in the land of Isis to   the femtosecond regime honored tonight for the ultimate   achievement in the microcosmos. I began life and education in the   same Land of Isis, Egypt, made the scientific unveiling in   America, and tonight, I receive this honor in Sweden, with a   Nobel Medal which takes me right back to the beginning. This   internationalization by the Genius of Science is precisely what   Mr. Nobel wished for more than a century ago. In visionary words, Mr. Nobel summed up the   purpose of the Prize: \"The conquests of scientific research and   its ever expanding field awake in us the hope that microbes - of   the soul as well as of the body - will gradually be exterminated   and that the only war humanity will wage in future will be war   against these microbes\". Mr. Nobel saw clearly what he wished for   the world and the value of scientific discovery and advancement.   Although there exist in the world today some microbes of the   soul, such as discrimination and aggression, science was and   still is the core of progress for humanity and the continuity of   civilization. From the dawn of history, science has probed the   universe of unknowns, searching for the uniting laws of nature.   The world applauds your Majesties and the Swedish people for your   appreciation, recognition, and celebration of discoveries of the   unknown, which, according to Alfred Nobel will \"leave the   greatest benefit to mankind\". I know of no other country that   celebrates intellectual achievements with this class and   passion. To the world, the Nobel Prize has become   the crowning honor for two reasons. For scientists, it recognizes   their untiring efforts which lead to new fields of discovery, and   places them in the annals of history with other notable   scientists. For Science, the Prize inspires the people of the   world about the importance and value of new discoveries, and in   so doing science becomes better appreciated and supported by the   public, and, hopefully, by governments. Both of these are noble   causes and we thank you. To me, there is a third cause as   well. If the Nobel Prize had existed 6,000 years   ago, when Egypt's civilization began, or even 2,000 years ago,   when the famous library and university (museum) at Alexandria   were established, Egypt would have scored very highly in many   fields. In recent times, however, Egypt and the Arab World, which   gave to Science Ibn-Sina (Avicenna), Ibn-Rushd (Averroes),   Ibn-Hayan (Geber), Ibn-Haytham (Al Hazen), and others, have had   no Prizes in science or medicine. I sincerely hope that this   first one will inspire the young generations of developing   countries with the knowledge that it is possible to contribute to   world science and technology. As expressed eloquently in 1825 by   Sir Humphrey Davy: \"Fortunately, science, like that nature to   which it belongs, is neither limited by time nor by space. It   belongs to the world, and is of no country and of no age.\" There   is a whole world outside the boundaries of the \"West\" and the   \"North\" and we can all help to make it the microbe-free world of   Mr. Nobel. I also hope that the Prize will help the region I came   from to focus on the advancement of science, the Science Society,   and on dignity and peace for humanity. Your Majesties, I do not know how to   express my own personal feelings and those of my family about   this recognition. Behind this recognition, there exists a larger   community of femtoscientists all over the world who tonight   declare themselves proud. My own science family at Caltech of   close to 150 young scientists represents the true army that   marched to victory and made the contribution possible; they, too,   must be proud of their effort. Personally, I have been enriched   by my experiences in Egypt and America, and feel fortunate to   have been endowed with a true passion for knowledge. I am   grateful that this highest crowning honor comes at a young age   when I can, hopefully, enjoy and witness its impact on science   and humanity. The honor comes with great responsibilities and new   challenges for the future, and I do hope to be able to continue   the mission, recalling the thoughtful words of the great scholar,   Dr. Taha Hussein:"}, "birth_country": "Egypt", "diedCountryCode": "", "year": "1999", "birth_date": "1946-02-26", "lecture": {"date": "1999-12-08 00:00:00", "url": "http://www.nobelprize.org/nobel_prizes/chemistry/laureates/1999/zewail-lecture.pdf", "location": "Stockholm", "words": "                                                                                               "}, "death_city": "", "id": "292", "bornCountryCode": "EG"}