{"death_country": "", "bio": {"url": "http://www.nobelprize.org/nobel_prizes/chemistry/laureates/2000/heeger-bio.html", "words": "I was born on a bitter cold morning   (20o F below zero) in Sioux City (Iowa) on January 22, 1936.   I was told that when my father went out in the cold that morning   to go to the hospital to visit his wife and newborn first son,   his car would not start. Despite advice to the contrary, he   walked to the hospital; his ears were frostbitten on the way.", "title": "Alan Heeger - Biographical"}, "first_name": "Alan J.", "last_name": "Heeger", "area": "chemistry", "gender": "male", "death_date": "", "share": "3", "motivation": "\"for the discovery and development of conductive polymers\"", "birth_city": "Sioux City, IA", "affiliations": [{"city": "Santa Barbara, CA", "name": "University of California", "country": "USA"}], "speech": {"date": "2000-12-10 00:00:00", "url": "http://www.nobelprize.org/nobel_prizes/chemistry/laureates/2000/heeger-speech.html", "location": "Stockholm", "words": " Alan Heeger's speech at the Nobel Banquet,   December 10, 2000 Your Majesties, Nobel Laureates, Members of   the Royal Swedish Academy of Sciences, Ladies and   Gentlemen,    Alan MacDiarmid, Hideki Shirakawa and I are greatly honored to   receive the Nobel Prize in Chemistry for \"the discovery and   development of conducting polymers\". We would like to dedicate   these few comments to the memory of Professor Bengt Ranby,   known for many years in Sweden as \"Mr. Polymer\". Polymer science has been recognized three   times previously by the Nobel Prize in Chemistry: * Hermann Staudinger in   1953, \"for his discoveries in the field of macromolecular   chemistry\".    * Karl   Ziegler and Giulio Natta, in 1963 \"for their discoveries in   the field of the chemistry and technology of high   polymers\".    * Paul   Flory, in 1974 \"for his fundamental achievements, both   theoretical and experimental, in the physical chemistry of   macromolecules\". Because the saturated polymers studied by   Staudinger, Ziegler, Natta, and Flory are insulators, they were   viewed as uninteresting from the point of view of electronic   materials. Professor Ranby, in his lecture at the   Nobel Symposium in 1991, designated electrically conducting   polymers as the \"fourth generation of polymeric   materials\". This fourth generation of polymers can exhibit   semiconducting or even metallic properties. In creating and expanding the fourth   generation of polymers, we attempted to understand nature with   sufficient depth that we could achieve materials with novel and   unique properties; properties that are not otherwise available.   This was (and is) an elegant and somewhat dangerous exercise;   elegant because it required the synthesis of knowledge from   chemistry, physics and materials science, and dangerous because   when working on the boundary of three disciplines, one is always   pushing beyond the knowledge and experience of this background.   That our research in this interdisciplinary field has had   sufficient impact on Chemistry to be recognized by the Nobel   Prize gives us, therefore, particular satisfaction.    From Les Prix Nobel. The Nobel Prizes 2000, Editor Tore Frangsmyr, [Nobel Foundation], Stockholm, 2001     "}, "birth_country": "USA", "diedCountryCode": "", "year": "2000", "birth_date": "1936-01-22", "lecture": {"date": "2000-12-08 00:00:00", "url": "http://www.nobelprize.org/nobel_prizes/chemistry/laureates/2000/heeger-lecture.pdf", "location": "Stockholm", "words": " 380 SEMICONDUCTING AND METALLIC POLYMERS: THE FOURTH GENERATION OF POLYMERIC MATERIALS Nobel Lecture, December 8, 2000 by ALAN J. HEEGER Department of Physics, Materials Department, Institute for Polymers and Organic Solids, University of California at Santa Barbara, Santa Barbara, CA 93106, USA. I. INTRODUCTION In 1976, Alan MacDiarmid, Hideki Shirakawa and I, together with a talented group of graduate students and post-doctoral researchers discovered ducting polymers and the ability to dope these polymers over the full range from insulator to metal [1,2). This was particularly exciting because it created a new field of research on the boundary between chemistry and condensed matter physics, and because it created a number of opportunities: Conducting polymers opened the way to progress in understanding the damental chemistry and physics of n:-bonded macromolecules; Conducting polymers provided an opportunity to address questions which had been of fundamental interest to quantum chemistry for decades: Is there bond alternation in long chain polyenes? What is the relative importance of the electron-elecron and the lattice interactions in n:-bonded macromolecules? Conducting polymers provided an opportunity to address fundamental issues of importance to condensed matter physics as well, including, for example, the metal-insulator transition as envisioned by Neville Mott and Philip Anderson and the instability of one-dimensional metals discovered by dolph Peierls ( the \"Peierls Instability\"). Finally -and perhaps most important -conducting polymers offered the promise of achieving a new generation of polymers: Materials which exhibit the electrical and optical properties of metals or semiconductors and which retain the attractive mechanical properties and processing advantages of polymers. Thus, when asked to explain the importance of the discovery of conducting polymers, I offer two basic answers: (i) They did not (could not?) exist. (ii) They offer a unique combination of properties not available from any other known materials.  Alan J Reeger 381 The first expresses an intellectual challenge; the second expresses a promise for utiltity in a wide variety of applications. Conducting polymers are the most recent generation of polymers[3]. Polymeric materials in the form of wood, bone, skin and fibers have been used by man since prehistoric time. Although organic chemistry as a science dates back to the eighteenth century, polymer science on a molecular basis is a development of the twentieth century. Hermann Staudinger developed the concept of macromolecules during the 1920's. Staudinger's proposal was openly opposed by leading scientists, but the data eventually confirmed the existence of macromolecules. Staudinger was awarded the Nobel Prize in Chemistry in 1953 \"for his discoveries in the field of macromolecular mistry\". While carrying out basic research on polymerization reactions at the DuPont company, Wallace Carothers invented nylon in 1935. Carothers' search showed the great industrial potential of synthetic polymers; a potential which became reality in a remarkably short time. Today, synthetic polymers are used in larger quantities than any other class of materials (larger by lume and larger by weight, even though such polymers have densities close to unity). Polymer synthesis in the l 950's was dominated by Karl Ziegler and Giulio Natta whose discoveries of polymerizarion catalysts were of great portance for the development of the modem \"plastics\" industry. Ziegler and Natta were awarded the Nobel Prize in Chemistry in 1963 \"for their ries in the field of the chemistry and technology of high polymers\". Paul Flory was the next \"giant\" of polymer chemistry; he created modem polymer science through his experimental and theoretical studies of macromolecules. His insights and deep understanding of macromolecular phenomena are summarized in his book, Principles of Polymer Chemistry, published in 1953, and still useful (and used) today. Flory was awarded the Nobel Prize in Chemistry in 1974 \"for his fundamental achievements, both theoretical and tal, in the physical chemistry of macromolecules\". Because the saturated polymers studied by Staudinger, Flory, Ziegler and Natta are insulators, they were viewed as uninteresting from the point of view of electronic materials. Although this is true for saturated polymers (in which all of the four valence electrons of carbon are used up in covalent bonds), in conjugated polymers the electronic configuration is fundamentally different. In conjugated polymers, the chemical bonding leads to one unpaired electron (the rc-elecron) per carbon atom. Moreover, re-bonding, in which the carbon orbitals are in the sp2p, configuration and in which the orbitals of successive carbon atoms along the backbone overlap, leads to electron delocalization along the backbone of the polymer. This electronic delocalization provides the \"highway\" for charge mobility along the backbone of the polymer chain. As a result, therefore, the electronic structure in conducting polymers is determined by the chain symmetry (i.e. the number and kind of atoms within the repeat unit), with the result that such polymers can exhibit conducting or even metallic properties. In his lecture at the Nobel sium (NS-81) in 1991, Professor Bengt Ranby designated electrically ducting polymers as the \"fourth generation of polymeric materials\"[3].  382 Chemistry 2000 The classic example is polyacetylene, (-CH)0, in which each carbon is a-bonded to only two neighboring carbons and one hydrogen atom with one 1t-electron on each carbon. If the carbon-carbon bond lengths were equal, the chemical formula, (-CH) 0 with one unpaired electron per formula unit would imply a metallic state. Alternatively, if the electron-electron interactions were too strong, (-CH) 0 would be an antiferromagnetic Mott insulator. The easy conversion to the metallic state on doping[ 1,2] together with a variety of dies of the neutral polymer have eliminated the antiferromagnetic Mott sulator as a possibility. In real polyacetylene, the structure is dimerized as a result of the Peierls Instability with two carbon atoms in the repeat unit, (-CH=CH)0L Thus, the 1t-band is divided into 1t-and n*-bands. Since each band can hold two trons per atom (spin up and spin down), the 1t-band is filled and the 1t*-band is empty. The energy difference between the highest occupied state in the 1t-band and the lowest unoccupied state in the 1t*-band is the 1t-1t* energy gap, Eg. The bond-alternated structure of polyacetylene is characteristic of gated polymers (see Fig. I). Consequently, since there are no partially filled bands conjugated polymers are typically semiconductors. Because Eg depends upon the molecular structure of the repeat unit, synthetic chemists are vided with the opportunity and the challenge to control the energy gap by sign at the molecular level. Although initially built upon the foundations of quantum chemistry and condensed matter physics, it soon became clear that entirely new concepts were involved in the science of conducting polymers. The discovery of linear excitations in this class of polymers, solitons in systems in which the ground state is degenerate and confined soliton pairs (polarons and polarons) in systems in which the ground state degeneracy has been lifted by the molecular structure, opened entirely new directions for the study of the interconnection of chemical and electronic structure. The spin-charge ration characteristic of solitons and the reversal of the spin-charge ship (relative to that expected for electrons as fermions) in polyacetylene challenged the foundations of quantum physics. The study of solitons in acetylene [ 4], stimulated by the Su-Schrieffer-Reeger (SSH) papers [5,6] dominated the first half of the l 980's. The opportunity to synthesize new conducting polymers with ed/ desired properties began to attract the attention of synthetic chemists in the l 980's. Although it would be an overstatement to claim that chemists can now control the energy gap of semiconducting polymers through molecular design, we certainly have come a long way toward that goal. Reversible \"doping\" of conducting polymers, with associated control of the electrical conductivity over the full range from insulator to metal, can be complished either by chemical doping or by electrochemical doping. rent with the doping, the electrochemical potential (the Fermi level) is moved either by a redox reaction or an acid-base reaction into a region of energy where there is a high density of electronic states; charge neutrality is maintained by the introduction of counter-ions. Metallic polymers are, there- Alan J Heeger Polyacetylene (PA) Polythiophene ~s I n (PT) Poly(3-alkyl) ~S 1, R\" thiophene \\ (P3AT) (R*methyl, butyl, etc.) Polypyrrole , nN I 'n (PPy) ~\"'7i;;-Poly isothianaphthene (PITN) Polyethylene dioxythiophene (PEDOT) !\\ 0 0 A Alkoxy*substituted Y poly para*phenylene vinylene (MEH-PPV) 0 -o Polyparaphenylene vinylene (PPV) Poly (2,5 dialkoxy) paraphenylene vinylene (e.g. MEH-PPV) Polyparaphenylene (PPP) Ladder*type polyparaphenylene (LPPP) OR ~I. R20 R2 R2 Polyparaphenylene +0--/; S* sulphide \\\\ (PPS) Polyheptadiyne (PHT) Poly (3-hexyl) thiophene 1J (P3HT) '/ \\ s \" H H Polyaniline, PAN! +0-~-0-N=0=Nv~+ 383 Figure 1. Molecular structures of a few conjugated polymers; note the bond-alternated structures. fore, salts. The electrical conductivity results from the existence of charge riers ( through doping) and from the ability of those charge carriers to move along the n-bonded \"highway\". Consequently, doped conjugated polymers are good conductors for two reasons: (i) Doping introduces carriers into the electronic structure. Since every repeat unit is a potential redox site, conjugated polymers can be doped n-type (reduced) or p-type (oxidized) to a relatively high density of charge carriers [ 7]. (ii) The attraction of an electron in one repeat unit to the nuclei in the neighboring units leads to carrier delocalization along the polymer chain and to charge carrier mobility, which is extended into three dimensions through interchain electron transfer. Disorder, however, limits the carrier mobility and, in the metallic state, limits the electrical conductivity. Indeed, research directed toward conjugated poly- 384 Chemistry 2000 mers with improved structural order and hence higher mobility is a focus of current activity in the field. Fig. 2 shows the early results on the conductivity ofpolyacetylene as a tion of the doping level; even in these early studies the conductivity increased by more than a factor of 107 to a level approaching that of a metal [2]. IOOO IOOf-L I + L I r ! i I 7 10**1-E I u 10*2 ~-c: I b I I 10*3 .. 10-4~ i I ,o-~-I I 10*61 000 005 i L L trans [CH (AsF, >y]x H H H H I I I I _,...c~c,.,c\"\"\"c/c\"\"\"-,,....c~ I I I I H H H H TRANS H H H H \\ / \\ I C=C ;=c I \\ \\ < ,,c-~ p= H H H H CIS j I 0 10 0 15 0 20 0 25 0 3( y Figure 2. Electrical conductivty of trans-(CH), as a function of (A~F,;) dopant concentration. The trans and ris polymer structures are shown in the inset. The electrochemical doping of conducting polymers was discovered by the MacDiarmid-Heeger collaboration in 1980 and opened yet another scientific direction [8]. The electrochemistry of conducting polymers has developed to a field of its own with applicaions that range from polymer batteries and electrochromic windows to light-emitting electrochemical cells[9]. Although I have emphasized the processing advantages of polymers, even as late as 1990, there were no known examples of stable metallic polymers which could be processed in the metallic form (a requirement for broad use in industrial products). This major outstanding problem was first solved with polyaniline, PANI. PANI has been investigated extensively for over 100 years and attracted interest as a conducting material for several important reasons; the monomer is inexpensive, the polymerization reaction is straightforward  Alan J Heeger 385 and proceeds with high yield, and PANI has excellent stability. As shown by Alan MacDiarmid and his collaborators in the mid-SO's, polyaniline can be rendered conducting through two independent routes; oxidation ( either chemically or electrochemically) of the leuco-emeraldine base or protonation of the emeraldine base through acid-base chemistry[lO]. Because the tion of counter-ions is involved in both routes; conducting polyaniline is a salt (a polycation with one anion per repeat unit). Processing high molecular weight polyaniline into useful objects and vices proved to be a difficult problem. Yong Cao, Paul Smith and I made portant progress in 1991 by using functionalized protonic acids to both vert PANI to the metallic form and, simultaneously, render the the resulting PANI-complex soluble in common organic solvents[ll]. The functionalized counter-ion acts like a \"surfactant\" in that the charged head-group is ly bound to the oppositely charged protonated PANI chain, and the \"tail\" is chosen to be compatible with non-polar or weakly polar organic liquids (in the case of solutions) or the host polymer (in the case of blends). The cessibility of PANI induced by the \"surfactant\" counter-ions has enabled the fabrication of conducting polymer blends with a variety of host polymers [ 12]. Since the blends are melt-processible as well, the counter-ion induced cessibility of of polyaniline provides a route to conducting polymer blends for use in industrial products. The \"surfactant\" counterions offer an unexpected advantage; they lead to the formation of a self-assembled network gy in the PANI polyblends[13]. Because of these interpenetrating networks, the threshold for the onset of electrical conductivity in blends with al insulating host polymers is reduced to volume fractions well below 1 % [14]. The PANI network is sufficiently robust that it remains connected and ducting even after the removal of the host polymer, thus opening another new direction; the fabrication of novel electrodes for use in electronic vices. The use of \"surfactant\" counter-ions was introduced with the goal of making PANI processible in the conducting form. The self-assembly of separated networks was an unexpected -but very welcome -bonus. Conducting polymers were initially attractive because of the fundamental interest in the doping and the doping-induced metal-insulator transition. However, the chemistry and physics of these polymers in their non-doped semiconducting state are of great interest because they provide a route to \"plastic electronic\" devices. Although polymer diodes were fabricated and characterized in the 1980's[15], the discovery oflight emitting diodes (LEDs) by Richard Friend and colleagues at Cambridge in 1990 [16] provided the stimulus for a major push in this direction. The polymer light-emitting diode is, however, only one of a larger class of devices in the emerging class of tic\" optoelectronic devices, including lasers, high sensitivity plastic odes (and photodiode arrays) and photovoltaic cells, ultrafast image sors (optical computers), thin-film transistors and all-polymer integrated circuits; in each case these sophisticated electronic components are ated from semiconducting and metallic polymers. All of these have a mon structure: They are thin film devices in which the active layers are fabric- 386 Chemistry 2000 ated by casting the semiconducting and/ or metallic polymers from solution ( e.g. spin-casting). II. DOPING Charge injection onto conjugated, semiconducting macromolecular chains, \"doping\", leads to the wide variety of interesting and important phenomena which define the field. As summarized in Fig. 3, reversible charge injection by \"doping\" can be accomplished in a number of ways. A. Chemical Doping by Charge Transfer The initial discovery of the ability to dope conjugated polymers involved charge transfer redox chemistry; oxidation (p-type doping) or reduction type doping) [l,2,7], as illustrated with the following examples: a. p-type (1) b. n-type (1t-polymer)n + [Na+(Napthtalide)*]Y [(Na+\\(1t-polymerfY)n + (Naphth)0 (2) When the doping level is sufficiently high, the electronic structure evolves to that of a metal. Electrical conductivity Conductivity approaching that of copper Chemical doping induces solubility Transparent electrodes, antistatics EMI shielding, conducting fibers Photochemical High-performance optical materials 1-d Nonlinear optical phenomena Photoinduced electron transfer Photovoltaic devices Tunable NLO properties Control ofelectrochemical potential Electrochemical batteries Electrochromism and \"Smart Windows\" Light-emitting electrochemical cells Electrochemical Interfacial Charge iniection without counterions Organic FET circuits Tunneling injection in LEDs Figure 3. Doping mechanisms and related applications.  Alan J Reeger 387 B. Electrochemical Doping Although chemical (charge transfer) doping is an efficient and ward process, it is typically difficult to control. Complete doping to the est concentrations yields reasonably high quality materials. However, attempts to obtain intermediate doping levels often result in inhomogeneous doping. Electrochemical doping was invented to solve this problem [8]. In chemical doping, the electrode supplies the redox charge to the conducting polymer, while ions diffuse into (or out of) the polymer structure from the nearby electrolyte to compensate the electronic charge. The doping level is determined by the voltage between the conducting polymer and the electrode; at electrochemical equilibrium the doping level is precisely fined by that voltage. Thus, doping at any level can be achieved by setting the electrochemical cell at a fixed applied voltage and simply waiting as long as necessary for the system to come to electrochemical equilibrium (as indicated by the current through the cell going to zero). Electrochemical doping is lustrated by the following examples: a. p-type (1t-polymer)n + [Li+(BF4-)]sol'n [(1t-polymer)+Y(BF4-\\Jn + Li(electrode) (3) b. n-type (1t-polymer)n + Li(electrode) [(Li+)/1t-polymerfY]n + [Li+(BF4-)]sol'n (4) C. Doping of Polyaniline by Acid-Base Chemistry Polyaniline provides the prototypical example of a chemically distinct doping mechanism[lO]. Protonation by acid-base chemistry leads to an internal redox reaction and the conversion from semiconductor ( the emeraldine base) to metal (the emeraldine salt). The doping mechanism is shown matically in Fig. 4. The chemical structure of the semiconducting emeraldine base form of polyaniline is that of an alternating copolymer. Upon tion of the emeraldine base to the emeraldine salt, the proton induced spin unpairing mechanism leads to a structural change with one unpaired spin per repeat unit, but with no change in the number of electrons[I 7,18]. The result is a half-filled band and, potentially, a metallic state where there is a positive charge in each repeat unit (from protonation) and an associated counterion (e.g. c1-, HS04-, DBSA-etc). This remarkable conversion from semiconductor to metal has been well-described, but it is not well understood from the view of basic theory. There are no calculations which show that the metallic (emeraldine salt) final state is lower in energy than the semiconductor and no detailed understanding of the rearrangement reactions sketched in Fig. 4. D. Photodoping The semiconducting polymer is locally oxidized and (nearby) reduced by photo-absorption and charge separation ( electron-hole pair creation and separation in to \"free\" carriers): (1t-polymer)n + hv [{1t-polymer)+Y + {1t-polymerJ-Y]n (5)  388 Chemistry 2000 where y is the number of electron-hole pairs ( dependent upon the pump rate in competition with the recombination rate). The branching ratio between free carriers and bound excitons (and the closely related issue of the tude of the exciton binding energy) is a subject of continuing discussion [ 19] Following photoexcitation from the ground state (lAg in the notation of molecular spectroscopy) to the lowest energy state with proper symmetry ( l B), recombination to the ground state can be either radiative cence) or nonradiative. Some families of conjugated polymers exhibit high luminescence quantum efficiencies (for example, PPV and PPP and their soluble derivatives); others do not (for example, polyacetylene and the thiophenes). A number of mechanisms have been identified that lead to low quantum efficiencies for photoluminescence. Rapid bond relaxation in the excited state and the formation of solitons with states at mid-gap prevent diative recombination in polyacetylene [ 4]. The existence of an Ag state or a triplet excited state below the lBu state will favor nonradiative recombination (in both cases, direct radiative transitions to the ground state are forbidden). Interchain interactions in the excited state (\"excimers\") also lead to diative channels for decay [20-22]. I : Reaction+with protonic acid adds 2H Geometrical (bond length) Relaxation (Quinoid to Benzenoid) -{) H /----'=' H +-0 H + -)-H , I L L i I -t v_/; ----~ -~\\_)-N \\ /;--N-<_/; N-,n-\\\"-~I I Redistribution of charge V and spin; halving of unit cell Figure 4. Protonation induced spin unpairing in polyaniline; conversion from insulator to metal with no change in the number of electrons.  Alan J Heeger 389 E. Charge Injection at a metal-semiconducting polymer (MS) interface Electrons and holes can be injected from metallic contacts into the re*-and re-bands, respectively: a. Hole injection into an otherwise filled re-band (re-polymer)0 -y(e-) (re-polymer)+J b. Electron injection into an empty re*-band (re-polymer\\,+ y(e-) (re-polymerf~ (5) (6) In the case of charge injection at an MS interface, the polymer is oxidized or reduced ( electrons are added to the re* band or removed from the re-band). However, the polymer is not doped in the sense of chemical or mical doping, for there are no counter-ions. This distinction becomes ticularly clear when comparing charge injection in the polymer light-emitting diode[l6,23] (where there are no ions) with that in the polymer ting electrochemical cell where electrochemical doping with associated distribution of ions provides the mechanism for charge injection [9]. As indicated in Fig. 3, each of the methods of charge-injection doping leads to unique and important phenomena. In the case of chemical and/ or trochemical doping, the induced electrical conductivity is permanent, until the carriers are chemically compensated or until the carriers are purposely moved by \"undoping\". In the case of photo-excitation, the photoconductivity is transient and lasts only until the excitations are either trapped or decay back to the ground state. In the case of charge injection at a ductor (MS) interface, electrons reside in the re*-band and/ or holes reside in the re-band only as long as the biasing voltage is applied. Because of the self-localization associated with the formation of solitons, polarons and bipolarons, charge injection leads to the formation of localized structural distortions and electronic states in the energy gap [ 4]. In the case of \"photo-doping\", the redistribution of oscillator strength associated with the sub-gap infrared absorption and the corresponding bleaching of the band (re-re*) transition provide a route to nonlinear optical (NLO) response. Real occupation of low energy excited states[ 4,24] and virtual occupation of higher energy excited states (in the context of perturbation theory) [25] lead to, respectively, resonant and nonresonant NLO response. By charge-injection doping at an MS interface, the polymer semiconductor can be used as the active element in thin film diodes[l5] and field effect sistors (FETs) [26-28]. Tomozawa et al. [15] demonstrated the first example of an electronic device component fabricated by casting the active polymer rectly from solution; even these early diodes exhibited excellent voltage characteristics. Dual carrier injection in metal/polymer/metal tures provides the basis for polymer light-emitting diodes (LEDs)[23]. In polymer LEDs, electrons and holes are injected from the cathode and anode, respectively, into the undoped semiconducting polymer; light is emitted when the injected electrons and holes meet in the bulk of the polymer and recombine with the emission ofradiation[16].  390 Chemistry 2000 Thus, as summarized in Fig. 3, doping is a common feature of conducting polymers; doping leads to a remarkably wide range of electronic phenomena. III. NOVEL PROPERTIES GENERATE NEW TECHNOLOGY As emphasized in the Introduction, conducting polymers exhibit novel perties; properties not typically available in other materials. I focus on a few of these as illustrative examples: (a) Semiconducting and metallic polymers which are soluble in and sible from common solvents; (b) Transparent conductors; (c) Semiconductors in which the Fermi energy can be controlled and shifted over a relatively wide range. In each case, the property is related to a fundamental feature of the chemistry and/ or physics of the class of conducting polymers. These novel properties enable a number of applications including polymer LEDs, conducting mers as electrochromic materials, polymer photodetectors, and polymer tovoltaic cells. A. Semiconducting and metallic polymers which are soluble in and processible from common solvents Because the interchain electron transfer interactions of conjugated polymers are relatively strong compared with the Van der Waals and hydrogen bonding interchain interactions typical of saturated polymers, conducting polymers tend to be insoluble and infusible. Thus, there was serious doubt in the early years following the discovery that re-conjugated polymers could be doped to the metallic state as to whether or not processing methods could be oped. Significant progress has been made using four basic approaches: I. Side-chain functionalization; principally used for processing ting polymers from solution in organic solvents or from water; 2. Precursor route chemistry, principally used for processing polyacetylene and PPV into thin films; 3. Counter-ion induced processing, principally used for processing line in the metallic form from organic solvents; 4. Aqueous colloidal dispersions created by template synthesis, principally used for processing polyaniline and poly( ethylenedioxythiophene), PEDOT. The addition of moderately long side chains onto the monomer units ed in derivatives of polythiophene, the poly( 3-alkylthiophenes), or P3ATs; see Fig. 1. Since the side chains decrease the interchain coupling and increase the entropy, these derivatives can be processed either from solution or from the melt. Similarly, side chain functionalization of poly(phenylene vinylene), PPV, (see Fig. I) has progressed to the point where a variety of ing polymers and copolymers are available with energy gaps that span the ible spectrum [29]). Water solubility was achieved by incorporating polar  Alan J Reeger 391 groups such as (CH2)nS03-M+ into the side chains (so-called 'self-doped' mers) [30,31]. The ability to fabricate optical quality thin films by spin-casting from tion has proven to be an enabling step in the development of plastic tronic devices such as diodes, photodiodes, LEDs, LECs, optocouplers, and thin film transistors[32]. The counter-ion induced processibility of \"metallic\" polyaniline utilizes functional counter-ions such a dodecylbenzenesulfonate to render the mer soluble[ll]. The charge on the S03-head group forms an ionic bond with the positive charge (proton) on the PANI chain; the hydrocarbon tail \"likes\" organic solvents. Processing PANI in the conducting form resulted in materials with improved homogeneity and crystallinity, and with ingly improved electrical conductivities [33]; The solubility of \"metallic\" PANI in organic solvents has also enabled the fabrication of conducting blends of PANI with a variety of insulating host polymers[l 1,12]. These polymer blends exhibit a remarkably low percolation threshold as a result of the spontaneous formation of an interpenetrating network morphology[ 13]. Template-guided synthesis of conducting polymers was first reported by S.C. Yang and colleagues[34]. The molecular template, in most cases, acids such as polystyrene sulfonic acid, binds the monomer, for example line, to form molecular complexes which are dispersed in water as colloidal particles. Upon polymerization, the aniline monomers form polyaniline and remain attached to the template to form the template-polyaniline complex. By judicious choice of the template molecule and the polymerization tions, stable sub-micron size colloidal particles of polyaniline-template gate can be formed during polymerization. The stabilization against tion arises from the Coulomb repulsion between particles, which is a result of the surface charge provided by the extra sulfonic acid groups in polystyrene sulfonic acid. Very stable dispersions of polyaniline-polystyrene sulfonic acid complexes can be made with particle sizes less than 1 um[34]. Transparent films with a specific resistivity of 1-10 0-cm can be cast from such dispersions. Poly(ethylenedioxythiophene)-polystyrene sulfonate (PEDOT-PSS) can be prepared as a stable dispersion in water[34,35]. Films of PEDOT-PSS are mi-transparent and can be spin-cast with a surface resistance of ly 500 0/square and with 75% transmission. B. Transparent metallic polymers Metals reflect light at frequencies below the plasma frequency, ffip' defined as ffi 2 = 4nNe2/m* (7) p where N is the number of electrons per unit volume, e is the electron charge, and m * is the effective mass ( the \"optical mass\") of the electrons in the solid. At frequencies above the plasma frequency, metals are transparent[36]. For conventional metals (Na, Cu, Ag etc.), N is of order 1023 per unit volume. As a result, the plasma frequency is in the ultraviolet; therefore, conventional  392 Chemistry 2000 metals appear shiny and \"metallic-looking\" in the spectral range over which the human eye is sensitive. Metallic polymers have a lower density of electrons; both the length of the repeat unit along the chain and the interchain spacing are relatively large compared to the interatomic distances in conventional metals. Typically, therefore, for metallic polymers N is of order 2-5 x 1021 cm-3. Thus, for lic polymers, the plasma frequency is at approximately 1 eV[37,38]. The flectance of high quality, metallic polypyrrole ( doped with PF 6) is shown in Fig. 5. Metallic polymers exhibit high reflectance (and thus look \"shiny\") in the infrared, but they are semitransparent in the visible part of the spectrum. The residual absorption above the plasma frequency arises from interband (re-re*) transitions between the partially filled re-band and the lowest energy re*-band. Optical quality thin films of metallic polymers are useful, therefore, as transparent electrodes [39]. For example, polyaniline [ 40], polypyrrole [ 41] and PEDOT[ 42] have been used as transparent hole-injecting electrodes in polymer LEDs (the initial demonstration of mechanically flexible polymer LEDs utilized PANI as the anode [ 40]). Transparent conducting films can be used for a variety of purposes; for example, as antistatic coatings, as trodes in liquid crystal display cells or in polymer LEDs, or for fabricating electrochromic windows. 1.0...-----r----.-------.----0.8 0.6 T::300K 1.0--.------.----0.a 0.2 o.o~__,,...,___,..,,_....,.~-,...__... 0.0 0.1 0.2 0.3 0.4 0.5 Eoergy(eV) -Metallic Regime *-***** Insulating Regime 0*0 0 ____ 1..___ __ _.2 ___ -_..;_-*_*-*_**-_***-****-**-..... Energy(eV) Figure 5. Reflectance spectra of PPy-PF6 near the metal-insulator transition; inset shows the low energy spectra with expanded scale.  Alan J Heeger C. Semiconductors in which the Fermi energy can be shifted across the energy gap 393 In comparison with traditional inorganic semiconductors, semiconducting polymers cannot be considered materials with ultra-high purity. As a result, though many device concepts have been demonstrated using semiconducting polymers as the active materials[32], there was early skepticism that these novel semiconductors could be used in commercial applications. In some ways, however, semiconducting polymers are more robust than their inorganic counterparts. In particular, whereas pinning of the Fermi energy by surface states is a major problem in conventional semiconductors, the Fermi energy can be controlled and shifted all the way across the energy gap in conjugated polymers. The absence of Fermi level pinning and the ability to shift the chemical potential all the way across the energy gap are fundamentally important; these novel features of semiconducting polymers underlie the operation of polymer LEDs, polymer LECs, and polymer diodes. One might have expected chemical reactions between the metal electrode and the polymer to lead to interface states which pin the Fermi level, as in organic semiconductors. Experiments have shown, however, that these facial interactions do not lead to pinning of the Fermi level. For example, electroabsorption measurements were used to determine the built-in electric field in metal-semiconductor-metal (MSM) structures of the kind used for polymer LEDs[ 43]. The results indicated that the maximum internal field is nearly equal to the single particle energy gap; the built-in field directly tracked the difference in work functions of the two meal electrodes, as nally proposed by Parker[23]. Thus, the Fermi level is not pinned by surface states. The absence of Fermi level pinning in semiconducting polymers is a major advantage: Conceptually, it greatly simplifies the device physics, and technologically, it greatly simplifies the device fabrication. IV. SEMICONDUCTING POLYMERS: ELECTRONIC STRUCTURE AND BOND RELAXATION IN EXCITED STATES A. Band Structure, Electron-Lattice Interaction, Electron-Electron Interaction and Disorder Although the linear and nonlinear optical properties of conducting polymers have been investigated for over a decade, there is still controversy over the scription of the elementary excitations. Are the lowest energy elementary citations mobile charge carriers (charged polarons) either injected at the contacts or created directly via inter-band photoexcitation, or are the lowest energy excitations bound neutral excitons [ 19]? The answer is of obvious portance from the perspective of our basic understanding of the physics of conducting polymers. The answer is also important for applications based on these materials. The central issue relates to the strength of the electron-electron tions relative to the bandwidth, relative to the electron-phonon interaction  394 Chemistry 2000 and relative to the strength of the mean disorder potential. Strong electron interactions ( electron-hole attraction) lead to the creation ized and strongly correlated negative and positive polaron pair; neutral laron excitons. Well screened electrons and holes with associated lattice distortions (charged polarons) on the other hand, are more appropriately scribed using a band picture supplemented by the electron-phonon tion. Molecular solids such as anthracene [ 44] are examples of the former, where the absorption is dominated by excitonic features; whereas inorganic semiconductors such as Si and GaAs are examples of the latter (where rigid band theory is a good approximation). The electronic structure of conjugated polymers was described by SSH[5,6] in terms of a quasi-one-dimensional tight binding model in which the n-electrons are coupled to distortions in the polymer backbone by the electron-phonon interaction. In the SSH model, photoexcitation across the n-n* band gap creates the self-localized, nonlinear excitations of conducting polymers; solitons (in degenerate ground state systems), polarons, and larons [ 4]. Direct photogeneration of solitons and polarons is enabled by the Franck-Condon overlap between the uniform chain in the ground state and the distorted chain in the excited state [ 45,46]. When the ground state is degenerate, as in the PPVs, charged polaron pairs can either separate as bile charged polarons or form bound polaron-excitons; i.e. neutral larons bound by a combination their Coulomb attraction and their shared distortion. Photoluminescence can be described in terms of the radiative cay of polaron-excitons. Conjugated polymers are n-bonded macromolecules, molecules in which the fundamental monomer unit is repeated many, many times. Thus, N, the Staudinger index as in (CH)N, is large. Since the end-points are not tant when N is large, then-electron transfer integral (denoted as \"W' in cular orbital theory[ 47], and \"t\" in tight-binding theory) tends to delocalize the electronic wavefunctions over the entire macromolecular chain. This dency toward delocalization is limited by disorder (which tends to localize the wavefunctions) and by the Coulomb interaction, which binds electrons when transferred to a nearby repeat unit to the positive charge left behind; i.e. to the \"hole\". In principle, disorder can be controlled. Chain extended and chain aligned samples can be prepared. Indeed, by utilizing the method of cessing of blends of conjugated polymers in polyethylene [ 48], a high degree of structural order has been attained[45,46]. Thus, as a starting point, it is useful to consider idealized samples in which the macromolecular chains are chain extended and chain aligned. The relative importance of the Coulomb interaction versus the band ture is a classic problem of the field. In tight-binding theory, the n-electron band structure extends over a band width, W = 2zt where z is the number of nearest neighbors. Thus, for linear polymers with z = 2 and t ::e 2.5 eV, W ::e 10 e V [ 4]. Since the size of the monomer, typically 5-10 A along the chain axis, is the smallest length in the problem, the monomer length is the effective  Alan J Reeger 395 \"Bohr radius\". Thus, on general grounds, one expects the electron-hole ing energy to be reduced from 13.5 eV (the electron-proton Coulomb ing energy in the H-atom where the Bohr radius is 0.53A) by a factor of 10-20 simply because of the change in length scale. Dielectric screening provides an additional reduction factor of E, where E 3 ( typical of conjugated polymers) is the dielectric constant for an electric field along the chain. Thus, the ing energy is expected to be no more than a few tenths of an eV. Since the typical band widths and band gaps are all in the eV range, one can start with a one-electron band approach and treat the Coulomb energy as a tion. In this description, the electron-hole bound states are Wannier excitons which are de localized over a number of repeat units. There are obvious cases where this argument breaks down. For example, one finds that in structures containing benzene rings, specific sub-bands have bandwidth near zero (nodes in the wavefunction reduce the effective transfer integral to zero). When electrons and holes occupy such narrow bands, the corresponding citons are easily localized by the Coulomb interaction onto a single monomer. Thus, in general, one can expect both \"Wannier -like\" excitons and like\" excitons for electrons and holes originating from different bands in the same polymer. B. Electronic Structure of Polyacetylene Trans-polyacetylene, trans-(CH)x, was the first highly conducting organic polymer[l ,2]. The simple chemical structure, -CH-units repeated (see Fig. 6a), implies that each carbon contributes a single p, electron to the 1t-band. As a result, the n-band would be half-filled. Thus, based upon this structure, an individual chain of neutral polyacetylene would be a metal; since the trons in this idealized metal could move only along the chain, polyacetylene would be a one-dimensional (Id) metal. However, experimental studies show clearly that neutral polyacetylene is a semiconductor with an energy gap of approximately 1.5 eV. Rudolf Peierls showed many years ago[49] that Id tals are unstable with respect to a structural distortion which opens an energy gap at the Fermi level, thus rendering them semiconductors. In the Peierls stability, the periodicity (A= n/kF) of the distortion is determined by the nitude of the Fermi wave-vector (kF). Since kF = 1t/2a for the half-filled band of trans-(CH)x, the Peierls distortion doubles the unit cell, converting polyacetylene into trans-(-HC = CH-)x, see Fig. 6b where, schematically, the dimerization is drawn as alternating single bonds and double bonds. The 1t-band of (CH)x is split into two sub-bands, a fully occupied n-band (the valence band in semiconductor terminology) and an empty n*-band (the conduction band), each with a wide bandwidth (-5 eV) and significant persion. The resulting band structure and associated density of states, shown in Fig. 7, results from the opening of the bandgap that originates from the doubling of the unit cell as a result of the bond alternation caused by the Peierls instability of the Id metal. Shortly after the initial discovery of doping and the metal-insulator tion in polyacetylene, the SSH description of the electronic structure was pro- 396 Chemistry 2000 a) b) c) d) e) f) L Figure 6. Polyacetylene a) undimerized structure, b) dimerized structure due to the Peierls stability, c) cis-polyacetylene, d) degenerate A and B phases in trans-polyacetylene, e) soliton in trans-polyacetylene. posed [ 5,6]. The construction of the remarkably successful SSH Hamiltonian was based on two assumptions: (a) The re-electronic structure can be treated in the tight-binding approximation with a transfer integral t::::, 2.5 eV, and (b) The chain of carbon atoms is coupled to the local electron density through the length of the chemical bonds. (8) where tn,n+I is the bond-length dependent hopping integral from site n to n+l, and un is the displacement from equilibrium of the nth carbon atom. The first assumption defines the lowest order hopping integral, t0, in the tight-binding term that forms the basis of the Hamiltonian. The second sumption provides the first-order correction to the hopping integral. This term couples the electronic states to the molecular geometry, giving the tron-phonon (el-ph) interaction where a is the el-ph coupling constant. The bond-length dependent hopping integral is physically correct, as indicated by bond alternation observed in polyacetylene[50,51]. The precise form ofEqn. 8, in which the dependence of the hopping integral on the C-C distance is nearized for small deviations about t0, is the first term in a Taylor expansion.  Alan J Reeger 397 I) f----------1------_ ;\\ _ k ......,J /2a / v c -2to -2to E Figure 7. Electronic structure of semiconducting polyacetylene. Left: Band structure. Right: Density of states. The energy opens at k = rr/2a as a result of the Peierls distortion. The resulting SSH Hamiltonian is then written as the sum of three terms [5,6]: where Pn are the nuclear momenta, u,, are the displacements from brium, mis the carbon mass, and K is an effective spring constant. The c\\,u and c,,,u are the fermion creation and annihilation operators for site n and spin u. The last two terms are, respectively, a harmonic \"spring constant\" term which represents the increase in potential energy that results from ment from the uniform bond lengths in (CH)x and a kinetic energy term for the nuclear motion. The spontaneous symmetry breaking due to the Peierls instability implies that for the ground state of a pristine chain, the total energy is minimized for lun I> 0. Thus, to describe the bond alternation in the ground state, (10) With this mean-field approximation, the value u0 which minimizes the energy of the system can be calculated as a function of the other parameters in the Hamiltonian[4-6]. Qualitatively, however, one sees that u0and-u0 both mize the energy for trans-polyacetylene since the bonds all make the same angle with respect to the chain axis. Hence, the energy as a function of u has a double minimum at +-u0, as shown in Fig. 8. The corresponding structures of the two degenerate ground states are shown in Fig. 6d. The double minimum of Fig. 8 implies that nonlinear excitations, solitons, will be important. In polymers with a nondegenerate ground state, the degeneracy indicated in Fig. 8 is lifted; for a nondegenerate ground state polymer, the absolute mum energy occurs at a single value of u.  398 Chemistry 2000 u Figure 8. Total energy of the dimerized polyacetylene chain; note the double minimum ciated with the spontaneous symmetry breaking and the two-fold degenerate ground state. C. The electronic structure of poly(phenylene vinylene) Poly(phenylene vinylene), PPV, and its soluble derivatives have emerged as the prototypical luminescent semiconducting polymers. Since PPV has a degenerate ground state, structural relaxation in the excited state leads to the formation of polarons, bipolarons, and neutral excitons. Prior to treating the structural relaxation in the excited state, however, one needs to develop a satisfactory description of the electronic excited states. In PPV, with eight carbons in the main-chain repeat unit, the re-band is split into eight sub-bands. Since each band can hold precisely 2 electrons per peat unit, the four re-sub-bands with the lowest energy are filled and the four re*-sub-bands are empty. Thus, I begin with a description at the one-electron level; i.e. from the point of view of band theory. Brazovskii and Kirova and Bishop[52,53] treated the band structure of PPV with a tight-binding Hamiltonian, using standard values for the hopping tegrals. The el-ph coupling, Eqn. 8, can be included after defining the basic band structure of the semiconductor. From this simple ansatz, basis states which reflect the intrinsic symmetry of the phenyl ring and the dimer were calculated and used to expand the wavefunction. The basis states hybridize as a result of ring-to-dimer hopping, thus yielding the 6 + 2 = 8 subbands in the re-system of PPV. The resulting band structure, Fig. 9, has a number of important features. Six of the subbands ( three occupied and three unoccupied), labeled D and D* in Fig. 9, are broad, and the corresponding wavefunctions are delocalized along the chain. The other two bands labeled L and L * ( one occupied and one unoccupied), are narrow and the corresponding wavefunctions have plitudes which are localized on the ring. The L and L * sub bands derive from the two ring states whose wavefunctions have nodes at the para linkage sites; as a result, these states do not participate in hopping and the subbands do not acquire the resulting dispersion. On the contrary, the delocalized D and  Alan J Reeger 399 ,------.-----,----,----,----.,-------,,--*-*-,-*-**********-6 D3* 4 .,.-.....-------------~-D2* -----L\"' ----*--> 2 . .._., ,...._~ .., __ ,.. ....... ----........ _ .. -.. ---........ ,. ---,...-~ /~ ...... ./' \"\"--------D I * ;;,-, b(j () (l) t:: ;.Ll -2 ~-*****--**-* .. **-*-**. ---* -----~ -4 -----L -------------------D2 -6 03 -~------*----~~-~~.......::...::~ -4 0 2 4 Quasimomentum~ q Figure 9. Electronic band structure of PPV. D* sub bands have relatively high dispersion (-1. 7 eV), indicating good calization over both ring and dimer states. Starting from this simple yet physically robust model of the band structure, the discussion of the electronic structure can be extended to include the fect of the Coulomb interaction. The delocalized nature of Dl and Dl * plies that, for electron correlation effects involving these subbands, it is propriate to compute an effective mass from the dispersion curves and then compute the corresponding one-dimensional (ld) hydrogenic levels. From the k2-dependence of the dispersion near the zone center, the effective ses in Dl and Dl * are m* = 0.067 me. Using the well-known result for the binding energy of a hydrogenic-like state in ld, the exciton associated with the lowest energy electronic transition (Dl -Dl *) has a binding energy and effective radii given by: Eb = Eb *ln\\atla.J ab= ab *[ln(atla.JI1, (Ila) where * 4 ti2e E * = !!!.___!:__ ah*=--, (l lb) h 821i2 m*e2 PS is the dielectric susceptibility, h is Planck's constant, m* is the electron fective mass at the zone center in k-space (for PPV, m* 0.067 m), e is the electron charge and a.1. 2 A (the \"width\" of the chain). From Eqn. 11, Eb~ 0.1-0.2 eV (depending on the value assumed for a.1.) and a radius of proximately 30 A. In addition to this weakly-bound Wannier-Mott exciton, there are two  400 Chemistry 2000 other excitons in this model. The degenerate Dl-Ll * and Ll-Dl * transitions are treated by assuming an immobile (massive) carrier in the L or L * band and a mobile carrier in the D or D* subband. The resulting bound state has a binding energy of -0.8 eV, and is a more tightly bound (but still what delocalized) exciton. Finally, the L-L* transition forms a very tightly bound Frenkel exciton, localized on the phenyl ring. With the electronic excitations established, they can be compared to the data obtained from optical absorption measurements. An unambiguous test of the agreement between the proposed electronic structure (Fig. 9) and periment requires data from chain extended and chain oriented samples of macromolecular PPVs. With macromolecular samples, chain end boundary conditions are not important; with oriented polymers, the polarization of the various absorptions with respect to the chain axis can be determined. Recent polarized absorption studies ofhighy oriented PPVand PPP indicate that the one-electron model is a good starting point[54,55]. D. Solitons, Polarons and Polaron Excitons: The Elementary Excitations of Conducting Polymers Although bond relaxation in the excited state is implicitly allowed through the bond-length dependent hopping integral in the SSH model, the effect of bond relaxation, and the formation of solitons, polarons and bipolarons, has not been explicit in the previous section. These important concepts are marized in the following paragraphs. In the related experimental studies, trans-polyacetylene and polythiophene were used as the model systems for the degenerate ground state polymer and the nondegenerate ground state polymer, respectively[ 4]. a. Solitons Charge storage on the polymer chain leads to structural relaxation, which in turn localizes the charge. The simplest example of the dramatic effect of this structural relaxation is the soliton in trans-polyacetylene. The soliton is a main boundary between the two possible degenerate ground state tions oftrans-(-CH = CH-)N' the \"A\" Phase and the \"B\" Phase. For simplicity, we often draw the chemical structure of the soliton as an abrupt change from A Phase to B Phase, as shown in Fig. 6e. In agreement with the predictions of the SSH model [ 4], however, the experimental evidence indicates that the structural relaxation in the vicinity of the domain boundary extends over proximately fourteen carbon atoms, as illustrated in Fig. 6f. The ing spin and charge distributions are similarly delocalized. The value of a picture like Fig. 6e quickly becomes evident when one tries to understand the quantum numbers of the soliton and the reversed spin relationship that characterizes the solitons of polyacetylene (see Fig. lOc). Since the non-bonding, or mid-gap, state formed by the chain tion can then be mapped to a specific atomic site, the resulting distribution of charge and spin can be easily addressed; if the state is unoccupied ( doubly cupied), the carbon atom at the boundary is left with a positive (negative)  Alan J Heeger 401 charge, but there are no unpaired spins; the charged soliton is positively (negatively) charged and spinless. Single occupation of the soliton state tralizes the electronic charge of the carbon nucleus, while introducing an paired spin onto the chain. The localized electronic state associated with the soliton is a non bonding state at an energy which lies at the middle of the re-re* gap, between the bonding and antibonding levels of the perfect chain. On the other hand, the defect is both topological and mobile due to the tional symmetry of the chain. Such a topological and mobile defect is cally referred to as a soliton[4-6]. The term \"soliton\" (S) refers neously to all three types of solitons; the quantum numbers for spin and charge enter only when referring to a specific type (for example, neutral solitons found as defects from the synthesis of undoped material or charged solitons created by photoexcitation), and even then, the spin is only implicit. Another feature of the soliton terminology is the natural definition of an ti-soliton\" (AS) as a reverse boundary from B Phase back to A Phase in Figs. 6e and 6f. The anti-soliton allows for conservation of soliton number upon doping or upon photoexcitation. b. Polarons and Bipolarons In cases such as poly( thiophene), PPV, PPP and cis-polyacetylene where the two possible bond alternation patterns are not energetically degenerate, fined soliton-antisoliton pairs, polarons and bipolarons, are the stable linear excitation and the stable charge storage states[56,57]. A polaron can be thought of as a bound state of a charged soliton and a neutral soliton whose mid-gap energy states hybridize to form bonding and anti-bonding levels. The neutral soliton contributes no charge and a single spin, as noted above, and the charged soliton carries charge of +-e and no spin; the resulting polaron then has the usual charge-spin relationship of fermions; q = +- e and s = 1/2. The polaron is illustrated schematically for PPP in Fig. lOa and lOb. The positive (negative) polaron is a radical cation (anion), a quasiparticle consisting of a single electronic charge dressed with a local geometrical laxation of the bond lengths. Similarly, a bipolaron is a bound state of two charged solitons of like charge ( or two polarons whose neutral solitons hilate each other) with two corresponding midgap levels, as illustrated in Fig. I la and 11 b. Since each charged soliton carries a single electronic charge and no spin, the bipolaron has charge +- 2e and zero spin. The positive (negative) bipolaron is a spinless dication ( dianion); a doubly charged bound state of two polarons bound together by the overlap of a common lattice tortion ( enhanced geometrical relaxation of the bond lengths). c. Solitons and Polarons in Conjugated Polymers: Experimental Results The models outlined above for solitons, polarons and bipolarons make crete predictions of experimentally observable phenomena, and indeed oretical progress would not have been possible without concurrent mental investigation. Optical probes of the mid-gap electronic states (see Fig. lOc) and magnetic measurements of spin concentrations and spin distribu- 402 Chemistry 2000 tions conu*ibuted greatly to the refinement and verification of theoretical dictions. For a detailed review of the experimental results, the reader is ferred to the Review of Modern Physics article on this subject[ 4]. (a) (b) ( c) P olaron fF 112, er= -I eJ f N e gati ve S oliton fFD, q= -I el P osi ti ve S oliton FD, q= lei Figure 10. a. Schematic picture ofa polaron in PPP; b. Band diagrnm ofan eleCLron polaron; fo,* a hole polaron, the lower gap state is single occupied and t11e upper gap state is empty: c. Band diagrams for positive and negative solitons with associated electronic U'llnsitions. (a) (b) Bi pol aron s=O, q= -2Je I Figure 11. Bipolarons in polymer \"'ith non-degenerate ground suue. a. Schematic picture ora ncgativt: bipolaron in PPP: b. Band diagrnm for a nega1.ive bipolaron. For a positive hipolaron, both gap states are unoccupied.  Alan J Reeger 403 V. PHOTOINDUCED ELECTRON TRANSFER The discovery of photoinduced electron transfer in composites of conducting polymers (as donors, D) and buckminsterfullerene, C60, and its derivatives (as acceptors, A) opened a number of new opportunities for semiconducting polymers [58,59]. A schematic description of the photoinduced electron transfer process is displayed in Fig. 12. A broad range of studies has been carried out to fully characterize this toinduced charge transfer, culminating with a study of the dynamics of toinduced electron transfer from semiconducting polymers to C60 using fs time resolved measurements [60,61]. These studies have demonstrated that the charge transfer occurs within 50 femtoseconds after photo-excitation. Since the charge transfer rate is more than 1000 times faster than any peting process ( the luminescence lifetime is greater than 300 picoseconds), the quantum efficiency for charge separation approaches UNI1Y! Moreover, the lifetime of the charge transferred state is metastable[62,63]. RO I I I I I I Figure 12. Illustration of photoinduced electron transfer from a conjugated semiconducting polymer to C60. Semiconducting polymers are electron donors upon photoexcitation ( trons promoted to the antibonding n* band). The idea of using this ty in conjunction with a molecular electron acceptor to achieve long-lived charge separation is based on the stability of the photoinduced nonlinear citations (such as polarons) on the conjugated polymer backbone. minsterfullerene, C60, is an excellent electron acceptor capable of taking on  404 Chemistry 2000 as many as six electrons[64]; C60, therefore, forms charge transfer salts with a variety of strong donors. It is reasonable, therefore to consider electron fer from photo-excited semiconducting polymer to C60. Fig. 13 shows a matic energy level diagram of the photoinduced electron (or hole) transfer process, which can be described in terms of the following steps: Step 1: Step 2: Step 3: Step 4: Step 5: O + A-+ 1L30* + A, (excitation on O); l,30* +A--+ 1L3(0 -A)*, (excitation delocalized on 0-A complex); l,3(0 -A)*--+ 1L3(08+ -A&-)*, (charge transfer initiated); 1,3(01>+ -A0-)*--+ 1L3(o+L -AL), (ion radical pair formed); 1L3(o+L -AL)--+ o+L + AL, (charge separation); where the donor (0) and acceptor (A) units are either covalently bound tramolecular), or spatially close but not covalently bonded (intermolecular); I and 3 denote singlet or triplet excited states, respectively. Photoinduced Electron Transfer CB :::: 2 eV VB + .... .........._< 1 picosecond --4---LUMO # HOMO cL . . ~1. , ,.:.em1conuiJcting Polymer Photoinduced Hole Transfer LUMO _.. \"Hi:~~ I H CB VB Semi c oncb;cting Polymer Figure 13: Energy band diagram for photoinduced electron transfer and photoinduced hole transfer between semiconducting polymers and C6().  Alan J Heeger 405 Since the partial charge transfer at Step 3 is strongly dependent on the rounding medium there is a continuous range for the transfer rate, 0 <D < 1. At Step 4, 8 = 1, i.e. a whole electron is transferred. At each step, the D-A tem can relax back to the ground state either by releasing energy to the tice\" (in the form of heat) or through light emission (provided the radiative transition is allowed). The electron transfer step (step 4) describes the mation of an ion radical pair; this does not occur unless I0* -AA -Uc < 0, where I0L is the ionization potential of the excited state (D*) of the donor, AA is the electron affinity of the acceptor, and Uc is the Coulomb energy of the separated radicals (including polarization effects). Stabilization of the charge separation (step 5) can be enabled by carrier delocalization on the o+ (and/ or A) species and by structural relaxation. The symmetrical process of hole transfer from the photoexcited acceptor to the donor is described in an analogous way, and can be driven by photoabsorption in spectral regions where the acceptor can be photoexcited but not the donor. Even though the photoinduced electron transfer reaction is energetically favorable, energy must be conserved in the process. In semiconducting mers, the excess energy is readily taken up by promoting the hole to a higher energy state in the n*-band. Ultimately, therefore, the ultrafast nature of the photoinduced electron-transfer process results from the delocalized nature of the n-electrons. Once the photoexcited electron is transferred to an acceptor unit, the resulting cation radical (positive polaron) species on the conjugated plymer backbone is relatively stable. Thus, photoinduced electron transfer from the conjugated polymer donor onto an acceptor moiety can be viewed as 'photodoping\" (se Fig. 3). The forward-to-reverse asymmetry of the duced charge separation in the conducting polymer/C60 system is less remarkable; the asymmetry is orders of magnitude greater than that served in the photosynthesis of green plants. Definitive evidence of charge transfer and charge separation was obtained from light-induced ESR (LESR) experiments[58,63,65]. Upon illuminating the conjugated polymer/C60 composites with light with hv > ETC-TC* where ETC-TC* is the energy gap of the conjugated polymer (donor), two photoinduced ESR signals can be resolved; one at g = 2.00 and the other at g = 1.99 [58,63]. The higher g-value line is assigned to the conjugated polymer cation (polaron) and the lower g-value line to C60-anion. The assignment of the lower g-value line to C60-is unambiguous, for this low g-value was measured earlier[64]; the higher g-value is typical of conjugated polymers. The LESR signal vanishes above 200K; this rules out permanent photochemical changes as the origin of the ESR signal and demonstrates the reversibility of the photoinduced tron transfer. The integrated LESR intensity shows two peaks with equivalent intensities. The temperature dependence of the LESR signal intensity shows Arrhenius behavior with activation energy of approx. 15 meV. This result gests a phonon assisted back relaxation mechanism of the photoinduced charge separated state [ 63]. In MEH-PPV /C60 composites, the strong photoluminescence of MEH-PPV is quenched by a factor in excess of 103, and the luminescence decay time is  406 Chemistry 2000 reduced from ,0 = 550 ps to 'rad<< 60 ps (the instrumental resolution) cating that charge transfer has cut-off the radiative decay[58,62,63]. An mate of the transfer rate, 1/,ct' can be obtained from the quenching of the photoluminescence; (12) where l/,0 and 1/,rad are the radiative decay rates, 10 and Icomp are the grated photoluminescence intensities of MEH-PPV and the MEH-PPV /C60 composite, respectively. The data imply, therefore, that 1/'tct > 1012; i.e. tron transfer occurs on the sub-picosecond time scale. The ultrafast charge transfer process was subsequently time resolved [ 60,61]; the data directly firm that charge transfer occurs in less than one hundred femtoseconds. The photoinduced electron transfer process serves to sensitize the conductivity of the semiconducting polymer[66]. Time-resolved transient photocurrent measurements indicate that the addition of as little as 1 % of C60 into the semiconducting polymer results in an increase of initial tocurrent by an order of magnitude. This increase of the photocarrier ation efficiency is accompanied by an increase in lifetime of the photocarriers upon adding C60. Thus, the ultrafast photoinduced electron transfer from the semiconducting polymer onto C60 not only enhances the charge carrier neration in the host polymer but also serves to prevent recombination by parating the charges and stabilizing the charge separation. Conjugated polymers with higher electron affinities (e.g. cyano-substituted PPV) function as the acceptor component with MEH-PPV as the donor [67,68]. Through control of the morphology of the phase separation into an interpenetrating bicontinuous network of D and A phases, high interfacial area was achieved within a bulk material: a \"bulk D/ A heterojunction\" that yields efficient photoinduced charge separation[67-70]. These all-polymer phase separated blends were successfully used in fabricating solar cells with efficiencies that approach those fabricated from amorphous silicon [ 69]. VI. METALLIC POLYMERS AND THE METAL-INSULATOR TRANSITION A. Metallic Polymers with High Performance Electrical and Mechanical Properties An early (and continuing) goal of the field of conducting polymers was the creation of materials with high electrical conductivity and with the excellent mechanical properties of polymers. This goal has been achieved; more portantly the conditions for realizing this combination of properties are derstood and can be applied to new materials. Electrical conductivity results from the existence of charge carriers and the ability of those carriers to move. In principle, broad 1t-electron bandwidths (often several eV) can lead to relatively high carrier mobilities[ 4]. As a result of the same intra-chain 1t-bonding and the relatively strong inter-chain tron transfer interaction, the mechanical properties (Young's modulus and tensile strength) of conjugated polymers are potentially superior to those of  Alan J Heeger 407 saturated polymers. Thus, metallic polymers offer the promise of truly high performance; high conductivity plus superior mechanical properties. This combination of high electrical conductivity and outstanding ical properties has been demonstrated for doped polyacetylene[70-75]. Unfortunately, since doped polyacetylene is not a stable material, the achievement of stable high performance conducting polymers remains an portant goal. B. Metal-Insulator Transition in Doped Conducting Polymers a. The Role of Disorder loffe and Regel[76] argued that as the extent of disorder increased in a metallic system, there was a limit to metallic behavior; when the mean free path becomes equal to the inter-atomic spacing, coherent metallic transport would not be possible. Thus, the Ioffe-Regel criterion is defined as kl, ,,, l; (13) where kFis the Fermi wave number and Lis the mean free path. The metallic regime corresponds to kl,>> 1. Based on the loffe-Regel criterion, Mott posed[77,78] that a metal-insulator (M-I) transition must occur when the order is sufficiently large that kl,< 1. In recognition of Anderson's early work on disorder induced localization, Mott called this M-I transition the \"Anderson transition\" [79]. In the limit where kl,<< 1 (i.e. where the strength of the random disorder potential is large compared to the bandwidth), all states become localized and the system is called a \"Fermi glass\" [80]. A Fermi glass is an insulator with a continuous density of localized states occupied cording to Fermi statistics. Although there is no energy gap, the behavior is that of an insulator because the states at the Fermi energy are spatially ized. The scaling theory of localization demonstrated that the disorder-induced M-I transition was a true phase transition with a well defined critical point[81]. MacMillan[82] and Larkin and Khmelnitskii[83], showed that near the cal regime of Anderson localization a power law temperature dependence is to be expected for the conductivity. The M-I transition in conducting polymers is particularly interesting; cal behavior has been observed over a relatively wide temperature range in a number of systems, including polyacetylene, polypyrrole, vinylene), and polyaniline [33]. In each case, the metallic, critical and lating regimes near the M-I transition have been identified. The critical regime is tunable in conducting polymers by varying the extent of disorder (i.e. by studying samples with different Pr= p( l.4K) / p (300K)), or by ing external pressure and/ or magnetic fields. The transitions from metallic to critical behavior and from critical to insulating behavior have been duced with a magnetic field, and from insulating to critical and then to lic behavior with increasing external pressure [33]. In the metallic regime, the zero temperature conductivity remains finite with magnitude that depends on the extent of the disorder. Metallic behavior  408 Chemistry 2000 has been demonstrated for conducting polymers with CT(T) remammg stant as T approaches zero[33]. Well into the metallic regime where the mean free path extends over many repeat units, the residual resistivity will become small, as in a typical metal. However, this truly metallic regime, with k/ >> l has not yet been achieved. b. Infrared Reflectance Studies of the Metallic State and the Metal-Insulator Transition Infrared (IR) reflectance measurements have played an important role in clarifying the metal physics of conducting polymers. High precision ce measurements were carried out over a wide spectral range on a series of PPy-PF6 samples in the insulating, critical, and metallic regimes near the M-I transition [84]. Since the reflectance in the infrared (IR) is sensitive to the charge dynamics of carriers near the Fermi energy (EF), such a systematic flectance study can provide information on the electronic states near EF and how those states evolve as the system passes through the M-I transition. The data demonstrate that metallic PPy-PF6 is a 'disordered metal' and that the M-1 transition is driven by disorder; similar results were obtained for line[37,85]. Fig. 14 shows CT( ro) for a series of PPy-PF 6 samples (A-F) as obtained from Kramers-Kronig transformation of R(ro) at room temperature. For the most metallic samples, R(ro) exhibits metal-like features; a free carrier plasma sonance as indicated by a minimum in R(ro) near 1 eV and high R(ro) in the far IR. As PPy-PF6 goes from the metallic to the insulating regime via the ical regime (Samples A through F), CT ( ro) is gradually suppressed in the IR. In the insulating regime (F), CT ( ro) remains well below that of the metallic ple (A) throughout the IR. The CT(ro) spectra are in excellent correspondence with the transport results ( this is especially clear at low frequencies in Fig. 14); the better the quality of the sample, as defined by the higher CT<lc (300K), the higher R(ro) in the IR[84]. In the far-IR (below 100 cm-I), the Hagen-Rubens (H-R) approximation provides an excellent fit to R(ro) [36], (14) where CTH-R is the ro-independent conductivity. The CTH-R values obtained from the Hagen-Rubens fits are in remarkably good agreement with the measured values ofCTrlc(300K). The excellent fits and the agreement between CTH-R and CT<lc(300K) imply a weak ro-dependence in the corresponding optical tivity, CT(ro), for ro < 100 cm-I. The CT(ro) data are fully consistent with the \"localization-modified Drude model\" (LMD) [86] ( 15) where kF is the Fermi wave-number and l is the mean free path. In this el, the zero frequency limit determines the constant C (precisely at the M-1 Transition, C=l) while a fit to CT(ro) determines ki The suppressed CT(ro) as ro approaches zero arises from weak localization induced by disorder[84]. The  -. E u I c -t:i 600 400 200 Alan J Reeger --Experiment -Fit A D E F soo---.--.--...--E 'e JOO ... C: 200 b 100 F C1Jp [rnrL J t [I0*15s] 15990 0.70 15220 0.6i 13700 0.64 12200 0.64 kFI 1.38 1.18 1.01 0.94 o--~~------~~ ......... ........ ~~~--~~---409 o 2000 4000 6000 8000 10000 Frequency(cm\"1) Figure 14. Frequency dependent conductivity, cr(ro), for Ppy-PF6. The inset shows the far-IR data in greater detail. cr(w) data from the various regimes were fit with the functional dependence predicted by the LMD model; Fig. 14 illustrates the excellent agreement of the fits to the data with the parameters summarized in the inset (except for the phonon features around 400-2000 cm-1 which are not included in the LMD model). There are small deviations for w < 100 cm-1 (more important in the less metallic samples), below which phonon-assisted hopping makes a measurable contribution to cr(w) and to the de conductivity. The parameters obtained from the fits are reasonable. The screened ma frequency, QP = m/ (i\\,J 112 = 1.5 x 104 cm-1, is in good agreement with the frequency of the minimum in R( w), and 1 is typical of disordered metals (1 -10-14-10-15 s). The quantity kflis of particular interest for it characterizes the extent of disorder and is often considered as an order parameter in calization theory[87,88]. For all four samples represented in Fig. 14, k1.l :::e 1, implying that all are close to the M-I transition. As the disorder increases and the system moves from the metallic regime (sample A with krl = 1.38) to the critical regime (sample E with kfl = 1.01), k/ approaches the Ioffe-Regel it[76], precisely as would be expected. In the insulating regime (sample F) k/ = 0.94 < 1, consistent with localization of the electronic states at J,,~, Thus, the IR reflectance data obtained for metallic polymers indicate that  410 'i .e \"\" -ts > .... .. u i 0 u 30000 10000 L L o9 0 0 Chemistry 2000 L L L L 00 0 LL O O Cf> L c9 0 cP a' 10 20 Draw ratio Figure 15. Electrical conductivity of iodine-doped polyacetylene (parallel to the draw axis) vs. draw ratio; solid points, thin films of thickness 3-5 um; open circles, films of thickness 25-30 um. they are disordered metals near the disorder-induced M-1 transition. There is remarkable consistency between the conclusion obtained from transport studies and from IR reflectance measurements. C. Striving Toward More Perfect Materials -Chain Extension, Chain Alignment and Inter-chain Order Experimental studies have established that for conducting polymers, the trical properties and the mechanical properties improve together, in a lated manner, as the degree of chain extension and chain alignment are proved. Polyacetylene remains the prototype example. Fig.15 shows the correlation between the electrical conductivity (er) and the draw ratio (A) for iodine doped polyacetylene films; the conductivity creases approximately linearly with the draw ratio[73]. The slope of er versus A is approximately a factor of two larger for the thinner films ( evidently the details of polymerization and/ or doping result in more homogeneous, higher quality material for the thinner films). X-ray diffraction studies of these drawn films exhibited a high degree of structural order that improves with the draw ratio; the structural coherence length perpendicular to the draw direction increases by about a factor of two as the films are drawn, from 10 nm at A= 4 to 20 nm at A= 15[73]. Consistent with the chain orientation and the improved structural order, the anisotropy ( er1/ er _1) in the electrical conductivity increased with the draw ratio, proaching 250 as A~ 15 (although er11 increased dramatically as a function of A, er _1 remains essentially constant). These data set a lower limit on the sic anisotropy and demonstrate that heavily doped polyacetylene is a highly anisotropic metal with relatively weak interchain coupling.  Alan J Reeger 411 Does the weak interchain coupling imply poor mechanical properties? The answer is \"No\"; for films with'),.,= 15, Young's modulus reaches 50 GPa and the tensile strength approaches I GPa, mechanical properties that are teristic of high performance materials. More importantly, the data strate a direct correlation between the electrical conductivity and the chanical properties. The linear relationship implies that the increase in both the conductivity and the modulus (or tensile strength) with draw ratio result from increased uniaxial orientation, improved lateral packing and enhanced interchain interaction. The correlations between the electrical conductivity and the mechanical properties observed for polyacetylene are general. This correlation has been demonstrated in every case studied [ 31], and can be derstood as a general feature of conducting polymers. Although the electrical conductivity is enhanced by the relatively high bility associated with intra-chain transport, one must have the possibility of ter-chain charge transfer to avoid the localization inherent to systems with a Id electronic structure [77]. The electrical conductivity becomes mensional (and thereby truly metallic) only if there is high probability that an electron will have diffused to a neighboring chain prior to traveling between defects on a single chain. For well-ordered crystalline material in which the chains have precise phase order, the interchain diffusion is a coherent process. In this limit, the condition for extended anisotropic transport is the following[89]: (16) where L is the coherence length, a is the length of the chain repeat unit, t0 is the intra-chain 1t-electron transfer integral, and t3d is the inter-chain tron transfer integral. A precisely analogous argument can be constructed for achieving the trinsic strength of a polymer material; i.e. the strength of the main-chain valent bonds. If E0 is the energy required to break the covalent main-chain bond and E3d is the weaker inter-chain bonding energy (from Van der Waals forces and hydrogen bonding), then the requirement is coherence over a length L such that[90] (17) In this limit, the large number, L/a, of weak interchain bonds add ly such that the polymer fails by breaking of the covalent bond. The direct analogy between Eqns. 15 and 16 is evident. When the interchain structural order is \"nematic\" (i.e. without precise phase order), the conditions become L/a >> (t0/t3d)2 and L/a >> (E0/E3d)2, respectively[89]. Thus, the ment of high performance materials with nematic order requires even greater longer range intra-chain coherence. In fact, for conjugated polymers, E0 results from a combination of cr and 1t bonds (the latter being equal to t0) and E3d is dominated by the interchain transfer integral, t3d. Thus, the inequalities imply that, quite generally, the conductivity and the mechanical properties will improve in a correlated man- 412 Chemistry 2000 ner as the degree of chain alignment is increased. This prediction is in lent agreement with data obtained from studies of the nes), the poly(phenylene vinylenes), poly(thienylene vinylene) and tylene [31]. Assuming that the linear correlation persists to even higher draw ratios, the extrapolated modulus of 300 GPa for polyacetylene would imply that the trical conductivity of perfectly oriented polyacetylene would be ly 2 x 105S/ cm [91]. However, this extrapolated value might still be limited by structural defects (e.g. sp3defects, etc.) rather than by intrinsic phonon tering. A theoretical estimate of the intrinsic conductivity, limited by phonon tering, yields the following expression [89]: (18) where CTn is the conductivity parallel to the chain, his Plancks's constant, a is the strength of the electron-phonon interaction, Mis the mass of the repeat unit of length a, and t0 is the transfer integral (2-3 eV). Using parameters tained from experiment, Eqn. 17 predicts cr11 = 2 x 106 S/ cm at room rature [89], more than an order of magnitude greater than that achieved to date. The exponential dependence upon T arises from the fact that tering must involve a high energy phonon with wave number near the zone boundary. The high conductivity values and the exponential increase in ductivity on lowering the temperature predicted by Eqn. 17 indicates that the achievement of metallic polymers in which the macromolecules are chain tended and chain aligned is a major opportunity. D. The Possibility of Superconductivity in Metallic Polymers Superconductivity has not yet been observed in doped conjugated polymers. Might one expect superconductivity? If so what are the materials ments? There is every reason to be optimistic that superconductivity will be ered in doped conjugated polymers: (i) They are metals; (ii) The coupling of the electronic structure to the molecular structure is well known. Upon doping, the bond lengths change such that charge is stored in solitons, polarons and bipolarons. Thus, the electron-phonon interaction which is responsible for superconductivity in conventional metals, leads to important effects in metallic polymers. In this context, doubly charged bipolarons can be thought of as analogous to real-space Cooper pairs. As shown above, however, currently available metallic polymers are barely metallic; their electronic properties are dominated by disorder with mean free paths close to the loffe-Regel criterion for disorder induced localization. It is interesting to compare the transport properties of available metallic  Alan J Reeger 413 polymers with those of the underdoped High Tc superconductors at doping levels where ki -1. For example, when YBa2Cu307_,; is underdoped to values of 8 such that the resistivity increases as the temperature is lowered with Pr= p(l.4K)/p(300K) \"\" 2 (i.e. with temperature dependence similar to that found in the best metallic polymers), the disorder associated with the random occupation of the oxygen sites quenches the superconductivity. The phase diagrams of MBa2Cu307--0 (where M = Y, Dy, etc.) have been thoroughly studied[92]. For large 8, MBa2Cu307_,; are antiferromagnetic sulators; increasing the oxygen concentration introduces carriers into the Cu02 planes and results in a transition from the antiferromagnetic insulating phase to the metallic and superconducting phase. The changes in resistivity which occur during this evolution from insulator to metal (and ductor) have been followed in detail in a continuous set of resistivity surements carried out on ultrathin films[93,94]. Thus, the prototypical Tc \"superconductors\" show behavior characteristic of the disorder-induced metal-insulator transition. Near the metal-insulator transition, the p vs T curves look remarkably similar to those obtained from \"metallic\" polyaniline, polypyrrole, and PPV. At doping levels near the metal-insulator transition there is no sign whatever of the fact that these copper-oxide systems exhibit superconductivity with the highest known transition temperatures. The point is quite clear. One cannot expect to make any progress toward superconductivity in metallic polymers until there is a major improvement in materials quality to the point where the mean free path is much longer than the characteristic monomer repeat units. When this has been achieved, k1,1>> 1 and the resistivity will be truly metal-like, decreasing as the temperature creases. The unresolved question is how to realize the required ments in structural order? This remains as a major challenge to the field. Although the required structural order is lacking in materials that are rently available, there is evidence that in metallic polyaniline, the electronic states near the Fermi energy interact strongly and selectively with a specific optical phonon mode [95]. The 1598 cm*1 Raman-active vibrational mode (A symmetry) exhibits a distinct resonance enhancement associated with g the mid-IR absorption in metallic polyaniline. Since the mid-IR oscillator strength results from the intraband free-carrier Drude absorption, the nant enhancement suggests that the symmetry of the electronic tions near EF matches the vibrational pattern of the 1598 cm*1 normal mode. Quantum chemical calculations of the electronic wavefunctions and analysis of the normal modes verified that this is in fact true[95]. Since the coupling of the electronic states near Er to lattice vibrations is known to lead to conductivity in metals, the demonstration of resonant coupling to a specific vibrational mode provides some optimism; at least this is the kind of feature that one would like to see. The story of superconductivity in metallic polymers has not yet begun. If and when superconductivity is discovered in this class of materials, that covery will create a new research opportunity that will be both exciting and potentially important.  414 Chemistry 2000 VIL APPLICATIONS Solid state photonic devices are a class of devices in which the quantum of light, the photon, plays a role. They function by utilizing the electro-optical and/ or opto-electronic effects in solid state materials. Because the interband optical transition (absorption and/ or emission) is involved in photonic nomena and because photon energies from near infrared (IR) to near violet (UV) are of interest, the relevant materials are semiconductors with band gaps in the range from 1 to 3 eV. Typical inorganic semiconductors used for photonic devices are Si, Ge, GaAs, GaP, GaN and SiC. Photonic devices are often classified into three categories: light sources (light emitting diodes, diode lasers etc.), photodetectors (photoconductors, photodiodes etc.) and energy conversion devices (photovoltaic cells). All three are important. Because photonic devices are utilized in a wide range of applications, they continue to provide a focus for research laboratories all over the world. Most of the photonic phenomena known in conventional inorganic conductors have been observed in these semiconducting polymers[32]. The dream of using such materials in high performance \"plastic\" photonic devices is rapidly becoming reality: High performance photonic devices fabricated from conjugated polymers have been demonstrated, including light emitting diodes, light emitting electrochemical cells, photovoltaic cells, tors, and optocouplers; i.e. all the categories which characterize the field of photonic devices. These polymer-based devices have reached performance levels comparable to or even better than their inorganic counterparts. This Nobel Lecture is, perhaps, not the proper place to discuss in detail the many current and anticipated applications of semiconducting and metallic polymers; there is simply neither time in the presentation nor space in the written document to do justice to the subject. Suffice it to say here that I am convinced that we are on the verge of a revolution in \"Plastic Electronics\". I refer those interested to recent reviews that focus on these important opments [97]. VIII. CONCLUDING COMMENTS I am greatly honored to receive the Nobel Prize in Chemistry for \"the ery and development of conducting polymers\". The science of ing and metallic polymers is inherently interdisciplinary; it falls at the section of Chemistry and Physics. In creating and expanding this \"fourth generation\"of polymers, we attempted to understand nature with sufficient depth that we could achieve materials with novel and unique properties; properties that are not otherwise available. This was (and is) an elegant and somewhat dangerous exercise; elegant because it required the synthesis of knowledge from the two disciplines, and dangerous because one is always pushing beyond the knowledge and experience of his background. I started out as a physicist; however, I am what I have become. I have evolved, with the help of many colleagues in the international scientific community, into an in- Alan J Reeger 415 terdisciplinary scientist. That my work and that of my colleagues Alan MacDiarmid and Hideki Shirakawa has had sufficient impact on Chemistry to be recognized by the Nobel Prize gives me, therefore, particular satisfaction. REFERENCES 1. H. Shirakawa, EJ. Louis, A.G. MacDiarmid, C.K. Chiang and AJ. Heeger, Chem. Commun. 578, (1977). 2. C.K. Chiang, C.R. Fincher, Jr., Y.W. Park, AJ. Heeger, H. Shirakawa and EJ. Louis, Phys. Rev. Lett. 39, 1098 (1977). 3. B. Ran by in Chapter 3 of Conjugated Polymers and Related Materials: Th.e Interconnection of Chemical and ElPSctronic Structures, Edited by W.R. Salaneck, I. Lundstrom and B. Ran by, Oxford University Press, Oxford, (1993). 4. AJ. Heeger, S. Kivelson,J.R. Schrieffer and W.P. Su, Rev. Mod. Phys.60, 781 (1988). 5. W.P. Su,J.R. Schrieffer and AJ. Heeger, Phys. Rev. Lett. 42, 1698(1979). 6. W.P. Su,J.R. Schrieffer and AJ. Heeger, Phys. Rev. B22, 2099 (1980). 7. C.K. Chiang, S.C. Gau, C.R. Fincher,Jr., Y.W. Park, A.G. MacDiarmid, Appl. Phys. Lett. 33,18 (1978). 8. PJ.Nigrey, A.G. MacDiarmid and AJ. Heeger, Chem. Commun. 96, 594 (1979). 9. Q. Pei, G. Yu, C. Zhang, Y. Yang and AJ. Heeger, Science, 269, 1086 (1995). 10. W.R. Salaneck, I. Lundstrom, W.S. Haung and A.G. MacDiarmid, Synth. Met.13, 291 (1986). 11. Y. Cao, P. Smith andAJ.Heeger, Synth. Met. 48, 91 (1992). 12. Y. Cao, P. Smith and AJ. Heeger, U.S. Patent 5,232,631. 13. C.Y. Yang, Y. Cao, P. Smith and AJ. Heeger, Synth. Met. 53, 293 (1992). 14. M. Reghu, Y. Cao, D. Moses, and AJ. Heeger, Phys. Rev. 8497,1758 (1993). 15. H. Tomozawa, D. Braun, S. Philips, AJ. Heeger and H. Kroemer, Synth. Met.22, 63 (1987); H. Tomozawa, D. Braun, S.D. Philips, R. Worland, and AJ. Heeger, Synth. Met. 28, C687 (1989). 16. J.H. Burroughes, D.D.C. Bradley, A.R. Brown, R.N. Marks, R.H. Friend, P.L. Bums and A.B. Holmes, Nature, 347, 539 (1990). 17. A.G. MacDiarmid and AJ.Epstein in \"Conjugated Polymeric Materials: Opportunities in Electronics, Optical Electronics and Molecular Electronics\", Ed. by J.L. Bredas and R.R. Chance (Kluwer Academic Publishers, Dordrecht, 1990), p.53. 18. F. Wudl, R.O. Angus, F.L.Lu, P.M. Allemand, DJ. Vachon, M. Nowak, Z.X. Liu,and AJ. Heeger,J. Amer. Chem. Soc. 109, 3677 (1987). 19. N.S. Sariciftci, \"Primary Photoexcitations in Conjugated Polymers\" (World Scientific Publishing Co., Singapore, 1998). 20. S.A.Jenekhe, andJ.A. Osaheni, Science, 265, 765 (1994). 21. J. Comil, D.A. do Santos, X. Crispin, R. Sil bey and J.L. Bredas, J. Amer. Chem. Soc. 120, 1289 (1998). 22. LJ. Rothberg, M. Yan, F. Papadimitrakopoulos, M.E. Galvin, E.W. Kwock and T.M. Miller, Synth. Met. 80, 41 (1996). 23. I.D. Parker,]. Appl.Phys. 75, 1656 (1994). 24. E.S. Maniloff, D. Vacar, D.W. McBranch, H. Wang, B.R. Mattes,]. Gao and AJ. Heeger, Opt. Commun., 141, 243 (1997). 25. L.Y. Chiang, A.F. Garito and DJ. Sandman, Proceedings of the Materials Research Society, Vol. 247 (Materials Research Society, Pittsburgh, 1992). 26. F. Gamier, R. Hajlaoui, A. Vasser and P. Svrivastava, Science, 265, 1684(1994). 27. J.H. Burroughes, C.A.Jones and R.H. Friend, Nature, 335, 137 (1988). 28. CJ. Drury, C.MJ. Mutsaers, C.M. Hart, M. Matters, and D.M. de Leeuw, Appl. Phys. Lett. 73, 108 (1998). 29. F. Hide, M. Diaz-Garcia. B. Schwartz, M. Andersson, Q.Pei and AJ. Heeger, Science, 73, 1833 (1996).  416 Chemistry 2000 30. M. Kobayashi, N. Colaneri, M. Boysel, F. Wudl, and AJ Heeger,]. Chem. Phys., 83, 5717 (1985). 31. AJ. Heeger and P. Smith in \"Conjugated Polymers\", Ed. by J.L. Bredas and R. Silbey (Kluwer Acad. Publishers, Dordrecht, 1991), p. 141. 32. G. Yu and AJ. Heeger in \"The Physics of Semiconductors\", Ed. by M. Schieffer and R. Zimmerman (World Scientific Publishing Co., Singapore, 1996), Vol. 1. 33. R. Menon, C.O. Yoon, D. Moses and AJ. Heeger in \"Handbook of Conducting Polymers\" 2nd Edition, Ed. by T.A. Skotheim, R.L. Elsenbaumer and J.R. Reynolds (Marcel Dekker, Inc., New York, 1998), p. 85. 34. L. Sun and S.C. Yang, Polymer Preprints,33, 379 ( 1992) .G. Heywang and F. Jonas, Adv. Mater. 4, 116 (1992). 35. ]. Friedrich and K. Werner, U.S. Patent 5,300,575. 36. C. Kittel, \"Introduction to Solid State Physics\", (John Wiley and Sons, Inc. New York, 1986). 37. K.Lee, AJ. Heeger and Y. Cao, Phys. Rev. B48, 14884 (1993). 38. K. Lee, R. Menon, C.O. Yoon and AJ. Heeger, Phys. Rev. B52, 4 779 ( 1995). 39. Y. Cao, G.M. Treacy, P. Smith and AJ. Heeger, Appl. Phys. Lett. 60, 2711 ( 1992). 40. G. Gustafsson, Y. Cao, G.M. Treacy, F. Klavetter, N. Colaneri, and AJ. Heeger, Nature, 357, 477 (1992). 41. ]. Gao, AJ. Heeger,J.Y. Lee and C.Y. Kim, Synth. Met. 82, 221 (1996). 42. Y. Cao, G. Yu, C. Zhang, R. Menon and AJ. Heeger, Synth. Met. 87, 171 (1997). 43. I.H. Campbell, T.W. Hagler, D.L. Smith and J.P. Ferraris, Phys. Rev. Lett., 76, 1900 (1996). 44. M. Pope and C.E. Swenberg, \"Electronic Prosesses in Organic Crystals\" (Clarendon Press, Oxford, 1982). 45. T.W. Hagler and AJ. Heeger, Chem. Phys. Lett., 189, 333 (1992). 46. T.W. Hagler,K. Pakbaz,, K. Voss, and AJ. Heeger, Pjys. Rev. B44, 8652 ( 1991). 47. A. Streitweiser, \"Molecular Orbital Theory for Organic Chemists\" (John Wiley and Sons, New York, 1961). 48. P. Smith, PJ. Lemstra,J.P.L. Pijpers and A.M. Kile, Colloid and Polym. Sci. , 259, 1070 (1981). 49. R.E. Peierls, \"Quantum Theory of Solids\" (Clarendon Press, Oxford, 1955). 50. C.R. Fincher,C.E. Chen, AJ. Heeger, A.G. MacDiarmid, and]. B. Hastings, Phys. Rev. Lett.48, 100 ( 1982). 51. C.S. Yannoni and T.C. Clarke, Phys. Rev. Lett. 52 1191 (1983). 52. S. Brazovskii, N. Kirova and A.R. Bishop, Opt. Mater. 9, 465 ( 1998). 53. N. Kirova, S. Brazovskii, and A.R. Bishop, Synth. Met. 100, 29 (1999). 54. E. K. Miller, D. Yoshida, C.Y. Yang and AJ. Heeger, Phys. Rev. B59, 4661 (1999). 55. E.K. Miller, C.Y. Yang and AJ. Heeger, Phys. Rev. B62, 6889 (2000). 56. K. Fesser, A.R. Bishop and D. Campbell, Phys. Rev. B27, 4804 (1983). 57. S.A. Brazovski and N. Kirova,JETP, 33, 4 (1981). 58. N.S. Sariciftci, L. Smilowitz, AJ. Heeger and F. Wudl, Science, 258, 1474 (1992). 59. S. Morita, A.A. Zakhidov and Y. Yoshino, Sol. State Commun., 82, 249 (1992). 60. B. Kraabel, D. McBranch, N.S. Sariciftci, D. Moses, and AJ. Heeger, Mo!. Cryst. and Liq. Cryst., 256, 733 (1994); B. Kraabel, J.C. Hummelen, D. Vacar, D. Moses, N.S. Sariciftci and AJ. Heeger,J. Chem. Phys. 104, 4267 (1996). 61. G. Lanzani, C. Zenz, G. Cerullo, W. Graupner, G. Leising, U. Scherf, S. De Silvestri, Synth. Met. 111-112, 493 (2000). 62. L. Smilowitz, N.S. Sariciftci, R. Wu, C. Gettinger, AJ. Heeger and F. Wudl, Phys. Rev. B47, 13835 (1993). 63. N.S. Sariciftci and AJ. Heeger, Int.]. of Mod. Phys. BS, 237 (1994). 64. P.M. Allemand, G. Srdanov, A. Koch and F. Wudl, J. Amer. Chem. Soc. 113, 1050 (1991). 65. K. Lee, R.Jansson, N.S. Sariciftci and AJ. Heeger, Phys. Rev. B49, 5781 (1994).  Alan J Heeger 417 66. C.H. Lee, G. Yu, D. Moses, K Pakbaz, C. Zhang, N.S. Sariciftci, AJ. Heeger and F. Wudl, Phys. Rev. 848, 15425 (1993). 67. G. Yu and AJ. Heeger,J. Appl. Phys., 78, 4510 (1995). 68. JJ.M. Halls, C.M. Walsh, N.C. Greenham, E.A. Marseglia, R.H. Friend, S.C. Moratti andA.B. Holmes, Nature,376, 498 (1995). 69. G. Yu,]. Gao,J.C. Hummelen, F. Wudl and AJ. Heeger, Science, 270, 1789 (1995). 70. C.Y. Yang and AJ. Heeger, Syn th. Met. 83, 85 ( 1996). 71. K Akagi, M. Suezaki, H. Shirakawa, H. Kyotani, M. Shimamura, and Y. Tanabe, Syn th. Met. 28, Dl (1989). 72. ]. Tsukomoto,Jpn.J. of Appl. Phys. 29, 1 (1990). 73. Y. Cao, P. Smith and AJ. Heeger, Polymer, 32, 1210 ( 1991). 74. T. Schimmel, W. Reiss, J.Gmeiner, M. Schworer, H. Naarmann, and N. Theophilou, Sol. State. Commun. 65, 1311 (1998). 75. S. Tokito, P. Smith andAJ. Heeger, Polymer, 32, 464 (1991). 76. A.F. loffe and A.R. Regel, Prog. Semicond. 4, 237 ( 1960). 77. N.F. Mott and E.A. Davis, \"Electronic Processes in Noncrystalline Matrials (Oxford Univ. Press, Oxford, 1979). 78. N.F. Mott, \"Metal-Insulator Transition\" (Taylor & Francis, London, 1990). 79. P.W. Anderson, Phys. Rev. 8109, 1492 (1958). 80. P.W. Anderson, Comm. on Sol. State Phys., 2, 193 (1970). 81. E. Abrahams, P.W. Anderson, D.C. Licciardello and T.V. Ramakrishnan, Phys. Rev. Lett., 42, 695(1979). 82. W.L. McMillan, Phys. Rev. B24, 2739 (1981). 83. A.I. Larkin and D.E. khmelnitskii, Sov. Phys.JETP, 56, 647 (1982). 84. K Lee, E.K Miller, A.N. Aleshin,R. Menon, AJ. Heeger, J.H. Kim, C.0. Yoon and H. Lee, Adv. Mater. 10, 456 (1998). 85. K Lee, AJ. Heeger and Y. Cao, Synth. Met. 69, 261 (1995). 86. N.F. Mott and M. Kaveh, Adv. Phys. 34, 329 (1985). 87. T.G. Castner, in \"Hopping Transport in Solids\", Ed. byM. Pollak and B.I. Shlovskii (Elsevier Science, Amsterdam, 1991). 88. P.A. Lee and T.V. Ramakrishnan, Rev. Mod. Phys., 57, 287 (1985). 89. S. Kivelson and AJ. Heeger, Synth. Met. 22,371, (1987). 90. AJ. Heeger, Faraday Discuss., Chem. Soc. 88, 1 (1989). 91. S. Tokito, P. Smith and AJ. Heeger, Polymer, 32, 464 (1991). 92. J.M. Tranquada in \"Earlier and Recent Aspects of Superconductivity\", Ed. by J.G. Bednorz and KA. Muller (Springer-Verlag, Berlin, 1990). 93. T. Wang, KM. Beauchamp, D.D. Berkley, B.R.Johnson,J.X. Liu,]. Zhang, and A.M. Goldman, Phys. Rev. 843, 8623 (1991). 94. G. Yu, C.H. Lee, AJ. Heeger, N. Herron, E.M. McCarron, L. Cong, G.C. Spalding, C.A. Nordman, and A.M. Goldman, Phys. Rev. 845, 4964 (1992). 95. N.S. Sariciftci, AJ. Heeger, V. Krasevec, P. Venturini, D. Mihailovic, Y. Cao,]. Libert and]. L. Bredas, Synth. Met. 62, 107 (1994). 96. M.D. McGehee, E.K Miller, D. Moses and AJ. Heeger, in \"Advances in Synthetic Metals: Twenty Years of Progress in Science and Technology\", Ed. by P. Bernier, S. Lefrant and G. Bidan (Elsevier Science S.A., Lausanne, 1999). 97. M.D. McGehee and AJ. Heeger, Adv. Mater, 22, 1655 (2000). Erratum Page 405, line 19 should read as: energy state of the 1t*-bandref_ Ultimately, therefore, the ultrafast nature of the where rePS refers to M.J. Rice and Yu. N. Gartstein, Phys. Rev. B53, 10764 (1996). "}, "death_city": "", "id": "729", "bornCountryCode": "US"}