{"motivation": "\"for his analysis of consumption, poverty, and welfare\"", "last_name": "Deaton", "share": "1/1", "death_city": "", "birth_country": "United Kingdom", "year": "2015", "birth_city": "Edinburgh", "death_country": "", "first_name": "Angus", "area": "economic-sciences", "id": "926", "field": null, "speech": {"date": "2015-12-10 00:00:00", "url": "http://www.nobelprize.org/nobel_prizes/economic-sciences/laureates/2015/deaton-speech_en.html", "location": "Stockholm", "words": "Your majesties, Your Royal Highnesses, Your Excellencies, Laureates, Ladies and Gentlemen. When I was a boy living in Edinburgh in Scotland, especially in December, when the hours of daylight were few, and it was cold, and often wet, I used to dream of escaping to a tropical magic kingdom. I searched the public libraries and museums for books and objects about sunny, warm, and exotic places; reading was the magic carpet that took me away from the cold and dark. Little did I know that when the magical day came, as it did today, it would indeed be in a kingdom, but one that was even further north, even colder, and with even fewer hours of daylight. Of course, the true magic kingdom that the wee boy sought was inside his head, inside books, and inside museums. I want to thank Sweden, not only for this honor, but also for being a kingdom that cares so much about learning, about intellectual pursuits, and about scientific achievement. You are a lantern of hope in a world where so much of what we care about is under threat. I became an economist by accident, with little formal training, an absence that I regretted for many years, but can perhaps stop regretting now. I drifted from one topic to another, learning as I went. Because I had not been taught, I was free not only of what I should have known, but also of at least some prejudices and preconceptions. Along the way, I was helped by distinguished mentors, several of whom have stood here before me, and by distinguished collaborators, several of whom are here tonight. I have the great good fortune that one of my collaborators in work, Anne Case, is also my collaborator in life. One of my greatest pleasures in recent years has been seeing the subject matter of economics broaden and expand. It has not given up its core themes, its measurement or its mathematics, but it has re-embraced its origins in history, psychology, political science, sociology and philosophy. It has become a richer and more humane subject. But this award is also a great tribute to my tribe within the tribe, those of us who worry about measurement, about how to provide coherent accounts of what we measure, and continue to work on one of the oldest topics in economics, the study of prices, of market behavior, and of human welfare.   Watch the Banquet Speech"}, "bornCountryCode": "GB", "lecture": {"date": "2015-12-08 00:00:00", "url": "", "location": "Stockholm", "words": ""}, "bio": {"url": "", "words": "", "title": ""}, "timeline": {}, "affiliations": [{"city": "Princeton, NJ", "name": "Princeton University", "country": "USA"}], "gender": "male", "death_date": "", "diedCountryCode": "", "prize_title": "The Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel 2015", "birth_date": "1945-10-19", "co_winners": "Angus Deaton", "contribution": null}