{"death_country": "", "bio": {"url": "", "words": "", "title": ""}, "first_name": "Arthur B.", "last_name": "McDonald", "area": "physics", "gender": "male", "death_date": "", "share": "2", "motivation": "\"for the discovery of neutrino oscillations, which shows that neutrinos have mass\"", "birth_city": "Sydney", "affiliations": [{"city": "Kingston", "name": "Queen's University", "country": "Canada"}], "speech": {"date": "2015-12-10 00:00:00", "url": "http://www.nobelprize.org/nobel_prizes/physics/laureates/2015/mcdonald-speech_en.html", "location": "Stockholm", "words": " Arthur B. McDonald's speech at the Nobel Banquet, 10 December 2015.  Arthur B. McDonald delivering his banquet speech.  Copyright (c) Nobel Media AB 2015 Photo: Dan Lepp Your Majesties    Your Royal Highnesses    Exellencies    Dear Laureates,    Students,  Ladies and gentlemen, Today I am speaking for Prof. Kajita and our two scientific Collaborations, SuperKamiokande and SNO, of which there are a number of representatives here with us today. We would like to express our profound thanks to your Majesties, to the Nobel Foundation and to the Swedish Academy of science for this enormous honour that you have bestowed. We are very grateful for the honour and for the wonderful hospitality that we have all enjoyed during our time in Stockholm. It has been said that behind every success there is effort, behind the effort there is passion and behind the passion there are people with the courage to try. Prof. Kajita and I have been very fortunate to have many highly skilled and courageous collaborators and we thank them for their contributions to our success. There are several founders of our collaborations who have passed away that we would particularly like to remember: Yoji Totsuka for SuperKamiokande and Herb Chen for SNO. We will be forever thankful for their contributions to the success of our experiments. I am also very glad that another of our founding spokespersons for SNO, George Ewan, is here to celebrate with us today. We would also like to express our thanks and love to our spouses and families and to those of our collaborators who have been so supportive of our work over many years. We are very appreciative of the tremendous support that we have received from our international funding partners, as well as from the mining companies in Japan and Canada and from Atomic Energy of Canada Limited through the loan of heavy water for SNO. Our experiments have exhibited properties for neutrinos that were unknown before, including flavor change and a finite mass. We are very pleased to have changed the perspective on neutrinos in the most fundamental theories of physics and look forward to further experiments that can lead the way to a more complete understanding of those theories and of our Universe. Thank you sincerely for this great honour.   Watch the Banquet Speech"}, "birth_country": "Canada", "diedCountryCode": "", "year": "2015", "birth_date": "1943-08-29", "lecture": {"date": "2015-12-08 00:00:00", "url": "", "location": "Stockholm", "words": ""}, "death_city": "", "id": "920", "bornCountryCode": "CA"}