{"motivation": "\"for the development of super-resolved fluorescence microscopy\"", "last_name": "Betzig", "share": "1/3", "death_city": "", "birth_country": "USA", "year": "2014", "birth_city": "Ann Arbor, MI", "death_country": "", "first_name": "Eric", "area": "chemistry", "id": "909", "field": " physical chemistry", "speech": {"date": "", "url": "", "location": "", "words": ""}, "bornCountryCode": "US", "lecture": {"date": "2014-12-08 00:00:00", "url": "http://www.nobelprize.org/nobel_prizes/chemistry/laureates/2014/betzig-lecture.pdf", "location": "Stockholm", "words": "111Single Molecules, Cells, and Super-Resolution OpticsNobel Lecture, December 8, 2014by Eric BetzigJanelia Research Campus, Howard Hughes Medical Institute, 19700 Helix Dr., Ashburn, VA 20147, USA.One of the nicest things about winning the Nobel Prize is hearing from all of the people in my past and having the time to re^ect on the important role theytmve each played in getting me to the happy and ful,lling life I have now. To all of my friends and colleagues from grade school up to my peers who nomi-nated me for this honor, you have my deepest thanks.I was ,rst introduced to super-resolution back in 1982 when I went to Cor-nell University for graduate school and met my eventual thesis advisors, Mike Isaacson and Aaron Lewis. Mike had recently developed a means of using elec-tron beams to fabricate holes as small as 30 nanometers (Figure 1A). He and Aaron ,gured that if we could shine light on one side of the screen, then the light that initially comes out of the hole from the other side would create a sub-wavelength light source that we could then scan point-by-point over a sample and generate a super-resolution image [1] (Figure 1B). .e ultimate goal was to try to create an optical microscope that could look at living cells with the resolu-tion of an electron microscope. I wanted to become a scientist to do big, impact-ful things, and that certainly ,t the bill, so I said, fiPlease sign me up.flAt the time, many people told us that this idea would never work, either because it violated Abbetms law, or even worse, the Uncertainty Principle. I didntmt ,nd their arguments compelling, but all doubt was removed from my mind in 1984 when we learned about the work of Ash and Nicholls. In 1972, they used 112 The Nobel PrizesFIGURE 1. Apertures and near-,eld optics. (A) Electron beam-fabricated apertures in a silicon nitride membrane, with diameters as shown. Column at le@ shows light transmis-sion through these apertures [1]. (B) .e concept of near-,eld scanning optical micros-copy (NSOM) as a path to super-resolution [2]. (C) 50 nm aperture in a tapered glass pipette coated with opaque aluminum [3], made using techniques developed for patch clamp recording [4].FIGURE 2. Breaking the di\"raction barrier in the near ,eld. (A) Microwave resonator with sub-wavelength aperture as used by Ash and Nichols in 1972 [5]. (B) Resolved grat-ings having periods of 1/30, 1/40, and 1/60 (top to bottom) of the 3 cm microwave wave-length. (C) Images of letters having linewidths of 1/15 of the wavelength.3-centimeter microwaves and were able, by near-,eld techniques, to get resolu-tion of 1/60 of the wavelength ~ in test patterns in a beautiful paper in Nature [5] (Figure 2). In fact, the idea for near-,eld microscopy goes back even further, to E.H. Synge in 1928 [6], and many people have independently come up with the idea since..e ,rst far ,eld demonstration of breaking the Abbe limit of ~/(2NA) (NA being the numerical aperture of the objective) in the far ,eld goes back even further, to the work of Lukosz [7]. By introducing grating masks at planes con-jugate to the object and the image, he was able to image test patterns at three times Abbetms limit [8] (Figure 3A). .is was the forerunner of what is known today as structured illumination microscopy. Lukosztm demonstration was at very Single Molecules, Cells, and Super-Resolution Optics 113low NA, so the features were still much larger than the wavelength of light, but it nevertheless demonstrated that Abbetms law was not inviolate.In fact, far-,eld super-resolution has a very long history, particularly in the semiconductor business, where the nonlinear interaction of light with photo-resist has been a staple of making linewidths far smaller than the Abbe for a generation (Figure 3B) [9]. Even more impressive, though, is how visible light is used to inspect semiconductor wafers, and how by having a priori knowledge of the pattern you hope to create, developing a model for the di\"raction of light from that pattern, and comparing the actual data you get against the model, people today are able to measure features in the pattern down to about 1/1000 of the wavelength of light (Figure 3C) [9]. .is is used day in and day out in high volume semiconductor manufacturing.So really, at some level, super-resolution is not new at all, and there are peo-ple in Silicon Valley who are probably laughing at us here today for thinking that wetmre the guys who invented this, when it has been a staple for such a very long time. Nevetheless, in my mind Ash and Nichols deserve the liontms share of the credit for being the ,rst to not just push slightly beyond the NA-dependent Abbe limit of ~/(2NA), but to shatter the di\"raction barrier completely by going way beyond the seemingly more fundamental limit of seeing beyond half the wavelength of light, and getting to ~/60 with the near-,eld technique.Speaking of shattering, the types of apertures we were making in those thin membranes would break all the time; they were hard and time-consuming to make, and they were costly. So eventually we abandoned that and, using an idea FIGURE 3. Breaking the di\"raction barrier in the far ,eld. (A) Di\"raction-limited (top) and super-resolved test patterns in 1D (middle) and 2D (bottom) as seen by Lukosz in 1967, using linear grating or square grid masks inserted in the image path [8]. Resolu-tion is increased to three times the Abbe limit. (B) Exploiting nonlinearity in photoresist development and double patterning to create features beyond the Abbe limit during the production of integrated circuits [9]. (C) Exploiting the a priori knowledge of a desired circuit pattern, and comparing the distribution of scattered light from the actual pattern to the predicted distribution, to measure features sub-nm features to sub-A precision in high volume semiconductor manufacturing [9]. 114 The Nobel Prizesfrom my fellow grad student Alec Harootunian, we instead pulled glass micro-pipettes, similar to the method that was developed just a few years before in patch clamping for single ion channel recording. We would then coat these with aluminum to create an opaque structure, except for the little hole at the end that would then be our aperture [3] (Figure 1C).So with that, I built the monstrosity you see here (Figure 4A), which was my ,rst near-,eld optical microscope. I cringe now at how complex and crazy this thing was, but at least it gave me the ability to learn the system-engineering skills I would need to become a true engineering physicist, and eventually I was able to surpass the di\"raction limit [10] (Figures 4B,C [11]) with this microscope that I built for my Ph.D. thesis..at microscope was frankly a pain in the ass to work with, and reliably the resolution gain was about a factor of two beyond Abbetms limit. But it was good enough to get me my dream job at Bell Labs. I started trying to develop the tech-nique further and, for the ,rst two years, progress was really slow. But thanks to the patience and encouragement of my boss, Horst Stormer, I eventually came to realize that that pipette probe was not a really good design, because the light that was sent down the taper was largely retro-re^ected back before it ever got to the tip, and the little bit of light that did make it to the tip was in electromagnetic modes that didntmt couple well to the aperture.Postdoc Jay Trautman and I, then, instead created a probe that consisted of an adiabatically-tapered optical ,ber, which would guide the light very ef-,ciently to the tip region, and then e~ciently couple that light to the evanescent modes in the aperture (Figure 5A,B). .is made a probe that was 10,000 times brighter than the earlier ones, and also then allowed us to routinely get to about 50-nanometer resolution [12] (Figure 5C). In the following year I also invented a means to dither the probe back and forth sidewaysSoscillate itSand then as it would come close the surface, the oscillation would be damped. By that, I could regulate the distance of the tip from the sample [13] (Figure 5D).FIGURE 4. My ,rst near-,eld microscope. (A) .e microscope itself. (B) Test-pattern comparison of di\"raction-limited imaging versus super-resolved NSOM. (C) Another resolved test pattern, i.e., an early lesson in learning how to sell my work [11]. Single Molecules, Cells, and Super-Resolution Optics 115With these two innovations, near-,eld became fairly routine. In 1992, we had the world record for data-storage density, when we could read and write bits as small as 60 nanometers in a magneto-optic material [15] (Figure 6A). We also demonstrated super-resolution photolithography (Figure 6B) and nanoscale spectroscopy [16], and exploited various contrast mechanisms [14], including FIGURE 5. Making NSOM a real tool. (A) Electron micrograph and (B) Optical micro-graph of an adiabatically tapered, aluminum coated single mode optical ,ber used as a near-,eld probe [14]. (C) Resolution comparisons with the probe. Le@ to right: electron, conventional optical, and near-,eld optical micrographs [12]. (D) Schematic diagram of shear force feedback for regulating, at the nm scale, the distance from the aperture at the end of the probe to the specimen [13].FIGURE 6. .e golden age of NSOM. (A) Single bits of information (top) in a magneto-optic ,lm recorded and read out by NSOM, compared with bits (white) recorded with conventional optics [15]. (B) Near-,eld photolithography [14]. (C) Fluorescence imag-ing of phase transitions in phospholipid monolayers [17]. (D) Histological stained sec-tion from the monkey hippocampus [14]. 116 The Nobel Prizesrefractive index, absorption (Figure 6C), polarization, and ^uorescence [17] contrast (Figure 6D). In fact, to this day, near-,eld remains the only di\"raction-unlimited technique which can use the full panoply of optical contrast mecha-nisms and isntmt dependent on a switching mechanism in ^uorescence.Nevertheless, the mechanism thattms probably most important for biology is ^uorescence, because it o\"ers protein-speci,c contrast. In 1993, we were the ,rst to demonstrate super-resolution ^uorescence imaging of cells when we looked at the actin cytoskeleton in the ^at lamellar region of ,xed ,broblasts [18] (Figure 7). What was particularly exciting about this, though, was that the signal-to-noise ratio we achieved on these single actin ,laments, coupled with our knowledge of the aperture diameter, suggested that it should be possible to image single ^uorescent molecules. .is was a very hot topic at the time, be-cause just a few years previously W.E. Moerner [19] and Michel Orrit [20] had broken to this ultimate level of sensitivity at cryogenic temperatures, and several groups, such as those of Dick Keller [21] and Rudolf Rigler [22], had already shown at room temperature in solution that you could see bursts of ^uorescence from single molecules..e key to these later experiments was the idea that you had to restrict the excitation volume to reduce the background. .attms what near-,eld excels atScon,ning the excitation volume. As soon as Rob Chichester and I decided to try to look at single molecules, on our very ,rst try we got really great results. But the weird thing was, instead of seeing a bunch of round spots, they would instead look like these crazy arcs or ellipses or other things, and these would FIGURE 7. Super-resolution ^uorescence imaging of cells. Conventional wide,eld (le@) and super-resolved NSOM (right) images of cytoskeletal actin in the same region of a ,xed mouse ,broblast cell [18]. Single Molecules, Cells, and Super-Resolution Optics 117change as we changed the polarization of the light [23] (Figure 8A). I still re-member running excitedly to Horsttms o~ce and trying to understand this, and together with his help, realizing that what we were seeing was the interaction of the electric dipole moment of the molecule with the evanescent ,elds inside of the near-,eld aperture (Figure 8B,C). And that was what was giving rise to these patterns.And so, what that means is that we could turn the experiment around and think of the molecule as the light source and the aperture as the sample. By choosing molecules that were oriented along the x, y, and z axes, we could then map out the nanoscopic electric ,elds inside the aperture (Figure 9A, center column). We then compared this to a theory for near-,eld di\"raction that Hans Bethe had developed back in 1944 [24] and were able to show very good agree-ment (Figure 9A, other columns). Once we had that, then we could use Bethetms model to predict what kind of pattern we would see for any orientation of mole-cule, compare that to our data, and hence ,nd the dipole orientation (Figure 9C) FIGURE 8. Single molecule microscopy at room temperature. (A) .ree views of the same ,eld of carbocyanine dye molecules on PMMA as imaged by NSOM with three di\"erent polarizations as shown at top. (B) 1D schematic of the interaction of the electric ,eld e emerging from the near-,eld aperture with the electric dipole moment p of a single molecule. (C) Resulting intensity I(x) @ ,e(x) \" p,2 recorded as the aperture is scanned across the molecule [23].FIGURE 9. Mapping nanometric electric ,elds and measuring single dipole orientations. (A) Electric ,eld components (rows) predicted near a sub-wavelength sized aperture at di\"erent distances (columns) from the aperture, compared to experimental components (center column) measured with single molecules. (B, C) Orientations of single molecules determined by matching measured to predicted emission patterns [23]. 118 The Nobel Prizesof every molecule in the ,eld of view (Figure 9B). And given that information, we were then able to ,t these crazy shapes to the theory and ,nd the positions of these molecules down to about 12 nanometers in x and y, and about 6 nanome-ters in z. .is became very in^uential for what was to happen later.In another pivotal experiment, I joined forces with my best friend and col-league at Bell, Harald Hess. Harald had made a name for himself at Bell a few years earlier by building a world-class cryogenic scanning tunneling microscope with which, among other things, he discovered the core states at the centers of the vortices in the Abrikosov ^ux lattice of type-II superconductors. Haraldtms and my interest was to combine my near-,eld probe with his low-temperature scope to be able to study excitons, which are the sources of light generation in semiconductor heterostructures, such as in this laser pointer, that won the No-bel Prize in 2000. Our goal was to combine the high spatial resolution obtain-able with my near-,eld probes with the high spectral resolution we could get in Haraldtms rig by running near absolute zero (Figure 10A).When we did this [25], we were surprised to ,nd that the normally smooth spectrum that you see instead would break up into these crazy sharp lines. And furthermore, as we drove the probe even small distances from point to point, this spectrum would change completely (Figure 10B). What we eventually real-ized is that we were seeing that the excitons could not emit anywhere, but were con,ned to only certain speci,c points of exciton recombination, and the color of the light emitted at one of these points was based on the local thickness of the quantum well at that point. What was probably more important later on was that even though there might be a dozen or more of these emitting sites under-neath our tiny near-,eld probe, we could still study them individually because they glowed in di\"erent wavelengths. So if we built up this higher dimensional FIGURE 10. Near-,eld cryogenic spectroscopy of quantum wells. (A) Experimental sche-matic, showing a near-,eld probe (le@) exciting a multiple quantum well structure (bot-tom), with the resulting emission measured at a spectrometer (right). (B) Comparative near-,eld and far-,eld spectra at a single point (top), and spectral changes with position (bottom). (C) Images of emission from single exciton recombination sites isolated form one another in a 3D space of position x,y and wavelength ~ [25]. Single Molecules, Cells, and Super-Resolution Optics 119space of x, y and emission wavelength, we could study them individually (Figure 10C).By this time in 1994, the limitations of the near-,eld technique were incred-ibly obvious. Some of these were just engineering challenges, but some were truly fundamental. .e foremost of these is that the near-,eld is ridiculously short. It was clear that, because of this short depth of focus, there was no way I was going to realize my ultimate dream of looking at live cells with the reso-lution of an electron microscope, so I got very frustrated. At the same time, though, near-,eld got to be a big fad, and like all scienti,c fads, you get a lot of people jumping into the ,eld. .ey publish sloppy results, sweep all the prob-lems underneath the rug, and over-hype the capabilities. All of that made me very uncomfortable. And the third thing that tipped the balance for me was Bell. You had to work really hard to succeed at Bell, but by 1994 you could sense the changes that were happening in the company, and they would no longer value basic science in the way they used to. All these things together took two young and innocent guys like me and Harald in 1989 and turned us into two stressed and worn-out guys just ,ve years later.So with all of that combined, I said, fiScrew it, Itmm sick of science. I really hate academia. I quit.fl So thattms just what I did. I really had no idea what I was going to do next. But a@er a few months of trying to ^ush near-,eld microscopy out of my head, I was walking my daughter around in a stroller and it hit meSI dontmt know how or where fromSthat you could combine that single-molecule FIGURE 11. .e concept of super-resolution localization microscopy. (A) A ,eld of close-packed molecules unresolved, because their di\"raction-limited images overlap. (B) .e same molecules, a@er their mutual isolation in a higher dimensional space. (C) Super-resolution map of molecular positions a@er localization of each isolated molecule [26]. 120 The Nobel Prizesexperiment I did with the spectroscopy experiment Harald and I did to come up with a di\"erent far-,eld way of doing super-resolution imaging..e idea is that if you have a bunch of molecules that are too close together, their di\"raction-limited spots overlap (Figure 11A). Wetmve already heard about this in W.E.tms talk. However, if you can ,nd some way in which they di\"er from one anotherSand it can be anythingSthen you can isolate them in a higher di-mensional space (Figure 11B). But once theytmre isolated, you can ,nd the centers of each one of their di\"raction-limited spots to much better than the width of the spot, and hence, you plot all the coordinates of the molecules (Figure 11C).I published that idea in 1995 [26]. In 1999, van Oijen and colleagues ,rst demonstrated this by spectral isolation at low temperature and resolved seven molecules in one di\"raction-limited volume in 3-D [27]. In the 2000s, several groups extended this to room temperature, by various meansSphotobleaching [28,29], lifetime [30], or blinking [31]. .is was really a general concept I was trying to get across here..e problem with all of these methods, though, is based on something called the Nyquist criterion (Figure 12). If you want to make any microscope image of FIGURE 12. .e Nyquist criterion and the labeling density problem. With many local-ized molecules per period, any spatial frequency is easily detectable (center le@), but when the number drops to two per period or less, the frequency might be missed. As a result, resolution in localization microscopy is limited more by density of single molecule labels than by the precision their localization (top right). .e minimum number of local-izations required per di\"raction-limited region increasing rapidly with dimensionality (lower right). Single Molecules, Cells, and Super-Resolution Optics 121a certain resolution, you have to sample every resolution element divided by two. For example, if I sample only once every half period of this sine pattern (Figure 12), I can miss it completely (Figure 12, lower le@). What that means is that if you want to get 20 nm resolution in two dimensions by this method, you have to have the ability to see one molecule on top of 500 that could be glowing at the same time. And none of the methods I just described were at the point of having that much isolation in that third dimension to get very much beyond the di\"raction limit. I didntmt have a really good idea in 1995 about how to get around this problem, other than running at cryogenic temperatures with a near-,eld microscope. .at was going to be a hero experiment, and I was sick of science, so I just published the idea and le@ it at that.Eventually I ended up working for my Dadtms machine tool company in Michigan, where I did a number of things, but my baby, the one Itmm proudest of, was a servo-hydraulic machine tool that married old hydraulic technology to modern control algorithms and the sort of energy storage principles that you ,nd in hybrid cars today. It would move 4 tons at 8gs of acceleration and posi-tion it to 5 microns, while collapsing the size of the machine from the size of this stage to something about the size of a car, making it much cheaper, much faster, much more productive. I spent four years developing that idea, and three years trying to sell it, and in the end I sold two. So what I learned is that I may be a bad scientist, but man, am I a worse businessman.By 2002, I said, fiDad, Itmm tired of wasting your money. You know, Itmm sorry, this just isntmt going to work.fl And so I quit. As usual, I had no plan B. .is was the darkest time in my life, because not only had I pissed away my academic career, I had also blown up my backup plan of following in my Dadtms footsteps. Itmm 42 years old with two young kids and no job and no prospect of a job.But I did something smart. Harald had also gone into industry, where he was considerably more successful than I was, working for a startup in San Diego. So I reconnected with him and we just started getting together in di\"erent parts of the country, like the national parks, and just talked . . . Whattms the meaning of life? How can we have an impact before we die? Whattms interesting? What we realized is that while neither one of us ,ts well in the normal academic scheme of things, we both really love science and we love the ability to be able to pursue our curiosity. So we started trying to think about what we could do to have an impact in science again..at caused me to start reading the scienti,c literature, which I hadntmt done for 10 years. .e ,rst thing I ran across was green ^uorescent protein [32]. It was a revelation to meSa shockSbecause it was such a big problem in the near-,eld days, how to label cells to get high enough labeling density and speci,city. .e 122 The Nobel Prizesnotion that you could coax a live cell with a little bit of jelly,sh DNA to be able to get it to produce any protein you want with a ^uorescent tag on it. My jaw was hanging down for a week in astonishment at this. Initially when I was casting around for an idea, I didntmt want to do microscopy, but as soon as I saw this I said, fiOh, shit, Itmve got to do microscopy again.flWhile Harald and I continued to look around during my holiday from sci-ence, science itself wasntmt standing still. Right a@er GFP appeared on the scene, a lot of people wanted to understand its photophysics, in part to be able to do mutagenesis to get di\"erent colors so they could do multicolor imaging.Steven Boxertms group in 1996 noticed that there isntmt just one absorption hump for GFP but two. And what was even crazier is that if you would excite at this near-UV peak for a while, it would go down, but the peak at 488 would go up [33] (Figure 13A). In other words, there was some kind of weird photo-activation e\"ect happening in GFP..en Tobias Meyertms group actually exploited this for what was the ,rst photo-activated pulse-chase experiment, where they used wild-type GFP and focused UV light to enhance the brightness of GFP in a certain part of the cell, and then watched how those proteins go to other parts of the cell [34] (Figure 13B). .e following year, W.E. was able to show the same phenomenon with Rob Dickson in GFP at the single molecule level [35] (Figure 13C). .en, around 2000, George Patterson in Jennifer Lippincott-Schwartztms group at NIH was very FIGURE 13. .e development of photoactivatable GFP. (A) UV-visible double absorp-tion peaks of wt-GFP [33]. (B) Pulse chase experiment to trace the fate of wt-GFP lo-cally photoactivated in one region of a cell [34]. (C) Energy state diagram from single molecule photoactivation of GFP [35]. (D) Improved on/o\" contrast ratio of PA-GFP [36]. (E) Pulse chase experiment of the relative rates of nuclear and cytosolic di\"usion of PA-GFP [36]. Single Molecules, Cells, and Super-Resolution Optics 123interested in following up on what Tobias had done. .e problem was that the on/o\" contrast ratio for wild-type GFP was very low, so he applied directed mutagenesis and eventually came up with what was called PA-GFP [36]. With this, you could turn on the ^uorescence of molecules with a much higher con-trast ratio (Figure 13D), and use them in much better pulse-chase experiments (Figure 13E).In 2005, Harald recommended that we go visit the National High Magnetic Field Lab that was headed by our buddy from Bell, Greg Boebinger, so that we could meet some guy named Mike Davidson. Mike was a microscopist who had made a fortune selling neckties that were emblazoned with photomicrographs of cocktail mixes, and he channeled that money into creating the website tuto-rials for the major microscope companies. He made a lot of money from that, and then used that to follow his passion of doing live-cell imaging. Eventually he developed a library of 3,500 di\"erent ^uorescent protein fusions. When we visited Mike, Harald and I learned about photo-activated GFP and the other photo-activated proteins that had come along. I vividly remember Harald and I sitting in the airport in Tallahassee and then both of us being thunderstruck when we realized that this idea of being able to turn on molecules one at a time was the missing link to make that idea I had pitched 10 years earlier to work.I had been pursuing another microscope idea at the time [37,38]. We dropped that like a hot potato. We thought, this is easySlettms do it and do it now. .e problem is that Harald had quit his job a few months before. So now you have two guys who are unemployedShow the hell are we going to do this? Ittms going to take too long to get a grant, too long to get VC funding. So because Harald doesntmt burn his bridges as e\"ectively as I do, he was able to take a lot of FIGURE 14. .e development of PALM. (A) La Jolla Labs, also known as Haraldtms living room. (B) .e PALM team. Clockwise from upper le@: Harald Hess, Mike Davidson, George Patterson, and Jennifer Lippincott-Schwartz. 124 The Nobel Prizeshis equipment from Bell. We pulled that out of the storage shed, and put $25,000 each of our own money into it. Normally you would do it in the garage like Jobs and Wozniak, but we were able to put it together in Haraldtms living room (Figure 14A) because he wasntmt married. So there was nobody in the way to prevent that from happening. But we knew we had to work fast because this idea was going to be ripe and in the air, so we worked around the clock day and night in order to do thisSor at least Harald worked day and night. I found the couch sometimes too comfortable, so Harald would tease me and keep taking pictures of me while I was asleep.We were still missing one thing, though, as you had two physicists who were totally naive about biology. We needed a good partner in that regard. So, shortly a@er the visit to Mike Davidson, I gave a talk at NIH that I wangled a@er con-tacting another Bell Labs friend, Rob Tycho. In the talk, I pitched the other microscope idea, but I askedSwhen Itmm there could I please, please, please meet George Patterson and Jennifer Lippincott-Schwartz?I took George and Jennifer to lunch and I swore them to secrecy and told them the idea that Harald and I were working on. Many people would have blown us o\" because we were two crazy guys who hadntmt published a paper in 10 years. Jennifer doesntmt think that way, and I owe a lot of my success to her as well as Harald. She said, fiFantastic, bring it here.fl Great! Now we had the team we needed (Figure 14B). A@er building the instrument in Haraldtms living room, we packed it up and started working in the darkroom in Jennifertms lab, which was a lot less comfortable.We started doing experiments very quickly a@er we brought it in. George did all the cell culture, transfections, and molecular biology to try out a whole bunch of di\"erent protein fusions. We turned down the violet light so low that a few molecules at a time would come on. If we summed up those spots, we got the di\"raction-limited image. But instead, if we found the center of each spot ,rst and then plotted those, we started building the PALM image (Figure 15A). A@er 20,000 frames, we went from the di\"raction-limit to a super-resolution image [39] (Figure 15B). With high enough labeling density you can get down to 20 nm resolution in your living room by this technique. Ittms a fairly simple method.In a way, Harald and I got lucky, because it wasntmt certain that wetmd be able to localize enough molecules to meet the Nyquist criterion at very high resolu-tion. We got lucky in the sense that we found certain photo-activated proteins (Figure 16A) and caged dyes (Figure 16B) that had enormous on/o\" contrast ratios. .eretms now a lot of work in this ,eld, and I feel many people still dontmt ap-preciate how important that on/o\" contrast ratio is to get from smushy looking Single Molecules, Cells, and Super-Resolution Optics 125FIGURE 15. Photoactivated localization microscopy (PALM). (A) Repeated rounds of weak photoactivation with violet light activates di\"erent subsets of molecules in a speci-men. Summing their di\"raction-limited spots produces a di\"raction-limited image (le@ column), but summing the measured centers of all such spots produces the super-reso-lution PALM image (right column). (B) Di\"raction-limited (upper le@) and super-res-olution PALM images in di\"erent regions, showing the distribution of transmembrane protein CD-63 in a 70 nm section cut through lysosomes in a COS-7 cell [39].FIGURE 16. .e importance of high molecular on/o\" contrast. (A) PA-GFP (le@), with a poor contrast ratio, yields poor resolution in a PALM image of a focal adhesion, due to imprecise molecular localizations from surrounding background. .e photoactivatable ^uorescent protein Eos (right), with a high contrast ratio, achieves better resolution [40]. (B) Di\"raction-limited (le@) and higher magni,cation PALM images (right) of islands of high contrast caged Q-rhodamine dye [39], demonstrating that PALM is not limited to just ^uorescent proteins. 126 The Nobel Prizesresults like that to much crisper results because of the background problems that you face [40].We went from the idea of PALM to having the data for our Science paper that got me on this stage today in six months. .attms what we could do because we were working alone in a living room, which is a very e\"ective environment. But 2005 was the luckiest year of my life, and not only because of PALM. In the same year, by a di\"erent, crazy set of circumstances, I got introduced to Gerry Rubin. HHMI (Howard Hughes Medical Institute) was starting to build a freestand-ing research institution modeled on Bell Labs. .e rebirth of Bell Labs caught Haraldtms and my interest. Gerry was farsighted enough to hire two guys who hadntmt published a paper in 10 yearsSthis was before the PALM paper came out. And so we went from rags to riches.Once the institution (Janelia Farm) opened, we went and built the next gen-eration scopes. I hired postdoc Hari Shro\", Harald hired Senior Scientist Gleb Shtengel, and then we went to work. In my group, we focused on applications for the ,rst few years. With Jan Liphardttms group at Berkeley, we looked at che-motaxis receptors in E. coli [41] (Figure 17A), and were able to show that the various cluster sizes you see and their positions along the poles are completely predictable in terms of stochastic model of self-assembly, where the proteins are randomly inserted in the membrane and then di\"use until they stick to an exist-ing cluster. We also showed that many proteins, such as those in focal adhesions that attach the cell to the substrate, might look colocalized at the di\"raction limit are de,nitely not colocalized at high resolution [42] (Figure 17B). With Bob Tijantms group at Janelia, we were able to show a mechanism of gene silenc-ing, where core promoters (green) are spatially segregated from genes that hug up against the nuclear membrane [43] (red, Figure 17C). With Tom Blanpiedtms group at Maryland we were able to look at live cultured neurons by sptPALM (single particle tracking PALM [44]) and show that the actin that gives rise to the shapes of dendritic spines is only polymerized at certain discrete locations [45].At the same time, Harald, being the better physicist than I am, built the ultimate PALM microscope that uses a three-phase interfereometer he origi-nally developed in industry to measure the ^y height of recording heads above a magnetic disk, that has even better sensitivity in z than in x and y [46]. He and Gleb then worked with Clare Watermantms group at NIH to unravel the en-tire architecture of focal adhesion proteins vertically from the substrate up to the actin cytoskeleton [47]. In a recent paper with Jennifertms group, they were able to resolve a question about ESCRT proteins which are involved in HIV Single Molecules, Cells, and Super-Resolution Optics 127buddingSwhether these act outside of the bud or inside of the budSand they showed that the latter is true [48].Harald has a lot of background from his time in industry in electron micros-copy, so hetms also worked at correlating electron microscopy with PALM in three dimensionsSin one case, looking at mitochondrial nucleoids and their location inside of the mitochondria [49], and in another looking at clathrin-coated pits [50].I think a lot of my success is attributable to the fact that Itmm a pessimist. I like to focus on problems because I think problems are opportunities. .erefore, Itmd like to say a bit about what are the problems with super-resolution microscopy instead of extolling its virtues. First is that, as I said earlier, based on the Nyquist criterion you need an insanely high density of labels [51] (Figure 12). .ese can cause overexpression of proteins to get to those levels (Figure 18A), or if you use exogenous dyes ittms hard enough to get enough speci,city without a bunch of background (Figure 18B). Second, ninety-,ve percent of what we look at in super-resolution is ,xed cells, but ittms known that chemical ,xatives alter the FIGURE 17. Applications of PALM. (A) Chemotaxis receptor clusters in E. coli [41]. (B) Two-color di\"raction-limited and PALM views of the spatial relationship of vinculin and paxillin in focal adhesions [42]. (C) Spatial relationship of core promoters of transcrip-tion (green) relative to the nuclear membrane (red) at di\"erent stages of myogenesis [43]. (D) Tracks of actin polymerization in dendritic spines of live cultured neurons [45]. 128 The Nobel Prizesultrastruture at the nanoscale (Figure 18C), so we have to put an asterisk next to almost everything that we learn by chemical ,xation. .ese problems must be confronted by all super-resolution methods, not just PALM.In what I think was a very important innovation a year ago was to get around the labeling density problem, Jan Ellenbergtms group studied the nuclear pore. Even though it was di~cult to get perfect labeling of every structure, by looking at thousands of these stereotypical structures, they could do particle averag-ing techniques borrowed from cryo-electron microscopy, and then were able to determine the radial positions of several key proteins in the nuclear pore to less than 1 nm by super-resolution optics [52]. .ere was an ambiguity in the cryo-EM data as to which way a subunit was oriented inside the pore, and that was addressed by super-resolution microscopy in this way. A really great example.Of course, we heard in Sven Lidintms introduction that that the real promise of super-resolution, though, is the ability and the hope to look at living cells. But ittms still largely a promise. Even though there have been technical demonstrations, theretms been very little in terms of, Itmd say, real biology learned. One problem is that if you want to get to higher and higher resolution, you have to collect many more photons than youtmve ever had to do at the di\"raction limit (Figure 19, second column). Another is that life evolved under a solar ^ux of one-tenth of a watt per square centimeter. .e super-resolution methods wetmre talking about FIGURE 18. Problems in super-resolution. (A) Overexpression of the target protein can alter the physiological state of the cell [41]. (B) Exogenously-introduced dyes o@en have limited a~nity for the desired target (le@, actin cytoskeleton) and high residual back-ground (right, focal adhesion). (C) Chemical ,xation can alter the ultra-structure, as seen here in the endoplasmic reticulum, before and a@er ,xation. Single Molecules, Cells, and Super-Resolution Optics 129today require intensities anywhere from a gigawatt per square centimeter to a kilowatt per square centimeter (third column). You have to ask yourself what are you doing to the poor cell when youtmre trying to look at it live? Finally, the acquisition times of many of these methods (fourth column) are far slower than the rate at which dynamics is happening in cells, so you get motion-induced artifacts or cantmt follow the thing you want to do..e one technique which can do much better, because it doesntmt o\"er as much resolution gain, is SIM [54] (structured illumination microscopy). It usu-ally gets only twice beyond the di\"raction limit, but it really o\"ers a lot of other bene,ts, particularly for live imaging [55] (Figure 20). Ittms a shame that you cantmt have four people win a Nobel Prize, because I think SIM is totally justi,ed to be a part of this.One of the pioneers of this technology was Swedish native Mats Gustafs-son, who eventually became my colleague at Janelia, before passing away from a brain tumor in 2011. Wetmve been working with Matstm SIM technique for a while now, and eventually found ways to push beyond this 100 nm barrier, ,rst to 80 nm and, with nonlinear SIM [57], down to 60 nm, while still capable of looking FIGURE 19. Problems in live cell super-resolution. Compared to di\"raction-limited live imaging techniques, the various super-resolution methods [53] require: large increases in the amount of the ^uorescence the specimen must produce (leading to rapid photo-bleaching); much higher illumination intensities (leading to rapid phototoxicity); and much longer acquisition times (leading to motion-induced artifacts and restricting in-vestigations to slow dynamic processes). 130 The Nobel Prizesat the dynamics of living cells. I think PALM is a great tool to image structure at the nanoscale, but I think SIM is going to be the real winner for being able to look at the dynamics of living cells beyond the di\"raction limit.Despite this, ittms still true that no matter what you do, and no matter what method you want to use, the higher the spatial resolution you want to have, the more measurements you have to take, which takes more time, and means throwing more potentially damaging light at the cell. .e moral of the story of SIM is that by backing o\" a bit in terms of the resolution wetmre asking for, we can learn a lot more about cellular dynamics.So, what if we back o\" all the way to the di\"raction limit? Why would you want to do that? Well, the hallmark of life is that ittms animate. Every living thing is a complex thermodynamic pocket of reduced entropy through which mat-ter and energy is ^owing continuously. While structural imaging will always be important, a complete understanding of life requires high resolution imaging across all four dimensions of space-time at the same time. So another focus of my group has been to push in this direction of 4D imaging. Over the last 10 years, theretms been tremendous growth in light sheet microscopy [58]. Wetmve adapted to this concept the idea of using non-di\"racting beams, and particularly optical lattices, which was the crazy idea I was working on before Harald and I dropped it for PALM. Adapted instead to light sheet microscopy, now we have a wonderful tool to look at high-speed 3D dynamics of everything from single molecules to whole embryos over four orders of magnitude of space and time by this method, noninvasively, for very long periods of time [59] (Figure 21).FIGURE 20. Structured illumination microscopy excels for live imaging. (A) 2D live SIM image of the endoplasmic reticulum in an LLC-PK1 cell, taken from a movie of 1800 time points at 0.75 sec intervals [56]. (B) 3D live SIM images of mitochondria in a HeLa cell, showing internal structure and the dynamics of ,ssion/fusion events [55]. Single Molecules, Cells, and Super-Resolution Optics 131.at got us back, ,nally, to super-resolution, because in the same year that we published the PALM paper, Robin Hochstrassertms group published a di\"erent way of doing single-molecule localization, which doesntmt involve photo-activa-tion, but just the transient binding of molecules to cells [60]. .e advantage of this method is you can have your whole imaging bath labeled with ^uorophores that just keep coming, so you have an in,nite army of molecules and can get higher and higher localization density. By pushing in that direction with our lattice light sheet, which allows us to get high signal-to-noise, single molecule imaging, even in the background of all of these molecules in the bath, wetmve been able to take 3-D localization microscopy up about two orders of magnitude in the number of localizations you can get. Plus we can look at much thicker samples than with wide-,eld localization, such as a whole dividing cell about 15 microns thick, where we localized 300 million distinct molecules.FIGURE 21. Rapid, noninvasive 3D live imaging with lattice light sheet microscopy [59]. (A) Tracks denoting the plus ends of growing microtubules, color coded by velocity, dur-ing di\"erent stages of mitosis, seen in relationship to chromosomes (orange). (B) Com-putationally extracted slices at di\"erent time points through a dividing LLC-PK1 cell, showing the 3D spatial relationship of chromosomes (green), endoplasmic reticulum (magneta), and mitochondria (yellow). (C) Rapid 3D shape changes in the protozoan Tetrahymena thermophila at 0.31 sec intervals. 132 The Nobel Prizes.e ,nal challenge going forward is how to take cell biology away from the cover slip. .attms not where cells evolved, we need to look at them inside the whole organism. .e problem is that the light rays are scrambled as you go in, and so wetmre now borrowing adaptive optics techniques ,rst developed by astronomers to make ground-based telescopes have resolution as good as or better than the Hubble space telescope. Moving deep into the brain of a living zebra,sh embryo with this adaptive optics technique, we see low resolution and weak signal with the adaptive optics o\" (Figure 22A). .attms what you would see with a normal microscope. .en, when we turn the adaptive optics on (Figure 22B,C), we see the recovered performance when we correct for the aberrations and return to di\"raction-limited resolution [61]. Such recovery is possible even FIGURE 22. Adaptive optics enables deep imaging at high resolution. (A) Two-photon image of membrane-labeled neurons in the spinal cord of a live zebra,sh embryo, 72 hours post fertilization. (B) Same region a@er adaptive optical correction using direct wavefront sensing [61], demonstrating recovery of signal and spatial resolution. (C) Adaptive optical correction of a sparse subset of neurons over a large portion of the ze-bra,sh brain. (D) In vivo two-photon lateral and axial views of neural processes deep in the mouse cortex, before (le@) and a@er (right) adaptive optical correction using indirect wavefront sensing [63]. Single Molecules, Cells, and Super-Resolution Optics 133in the scattering brain tissue of the mouse (Figure 22D) [62OE64]. .e ultimate goal of my group is to try to combine these technologies to be able to look deep in a multi-cellular context, to be able to look noninvasively and fast with meth-ods like lattice light sheet, and then bring in super-resolution techniques such as SIM and PALM to then add the high spatial resolution on top of that. At that point, Itmm done and Itmm out of microscopy and Itmll be back into that black phase and trying to ,gure out something else that I want to do.Itmd just like to end with a couple of things. First, there are many, many people to thank, but the guy I have to single out is Harald (Hess). I would have ^amed out of Bell Labs in my ,rst few years if I hadntmt latched onto him as a friend and a mentor. .eretms no way I wouldtmve had the courage to pursue PALM on my own without him by my side. One of the bittersweet things about winning this award is not having him here by my side up on the stage. But I feel this award is very much as much his as it is mine..e last thing I would like to say is a lot of what you heard this morning, like in Shuji Nakamuratms talk and Stefan Helltms talk, and my talk, is about taking risks. People are always exhorted to take risks, and thattms ,ne. But youtmre hearing that from guys whose risks paid o\". Ittms not a risk unless you fail most of the time. And so Itmd like to dedicate my talk to all of the unknown people out there in any walk of life who have gambled their fortunes, their careers, and their reputations to take a risk but, in the end, failed. Itmd just like to say that they should remember that ittms the struggle itself that is its own reward, and the satisfaction that you knew that you gave everything you had to make the world a better place. .ank you for your time.REFERENCES1. Lewis, A., Isaacson, M., Harootunian, A., Muray, A., fiDevelopment of a 500A spa-tial resolution light microscope,fl Ultramicroscopy 13, 227OE232 (1984).2. Betzig, E., Harootunian, A., Lewis, A., Isaacson, M., fiNear-,eld di\"raction by a slit: implications for superresolution microscopy,fl Appl. Opt. 25, 1890OE1900 (1986).3. Betzig, E. Lewis, A., Harootunian, A., Isaacson, M., Kratschmer, E., fiNear-,eld scanning optical microscopy: development and biophysical applications,fl Biophys. J. 49, 269OE279 (1986).4. Hamill, O.P., Marty, A., Neher, E., Sackmann, B., Sigworth, F.J., fiImproved patch-clamp techniques for high-resolution current recording from cells and cell-free membrane patches,fl P~ugers Arch. 391, 85OE100 (1981).5. Ash, E.A., Nicholls, G., fiSuper-resolution aperture scanning microscope,fl Nature 237, 510OE512 (1972).6. Synge, E.H., fiA suggested method for extending microscopic resolution into the ultra-microscopic region,fl Phil. Mag. 6, 356OE358 (1928). 134 The Nobel Prizes7. Lukosz, W., fiOptical systems with resolving powers exceeding the classical limit,fl J. Opt. Sci. Am. 56, 1463OE1472 (1966).8. Lukosz, W., fiExperiments on superresolution imaging of a reduced object ,eld,fl J. Opt. Sci. Am. 57, 163OE169 (1967).9. Images courtesy of Dr. Mehdi Vaez-Iravani, Applied Materials, Inc.10. Betzig, E., Isaacson, M., Lewis, A., fiCollection mode near-,eld scanning optical microscopy,fl Appl. Phys. Lett. 51, 2088OE2090 (1987)11. Betzig, E., Non-destructive optical imaging of surfaces with 500A resolution, Ph.D. .esis, Cornell University (1988).12. Betzig, E., Trautman, J.K., Harris, T.D., Weiner, J.S., Kostelak, R.L., fiBreaking the di\"raction barrier: optical microscopy on a nanometric scale,fl Science 251, 1468OE1470 (1991).13. Betzig, E., Finn, P.L., Weiner, J.S., fiCombined shear force and near-,eld scanning optical microscopy,fl Appl. Phys. Lett. 60, 2484OE2486 (1992).14. Betzig, E., Trautman, J.K., fiNear-,eld optics: microscopy, spectroscopy, and surface modi,cation beyond the di\"raction limit,fl Science 257, 189OE195 (1992).15. Betzig, E., Trautman, J.K., Wolfe, R., Gyorgy, E.M., Finn, P.L., Kryder, M.H., Chang, C.H., fiNear-,eld magneto-optics and high density data storage,fl Appl. Phys. Lett. 61, 142OE144 (1992),16. Trautman, J.K., Macklin, J.J., Brus, L.E., Betzig, E., fiNear-,eld spectroscopy of single molecules at room temperature,fl Nature 369, 40OE42 (1994).17. Hwang, J., Tamm, L.K., Bohm, C., Ramalingham, T.S., Betzig, E., Edinin, M., fiNanoscale complexity of phospholipid monolayers investigated by near-,eld scan-ning optical microscopy,fl Science 270, 610OE614 (1995).18. Betzig, E., Chichester, R.J., Lanni, F., Taylor, D.L., fiNear-,eld ^uorescence imaging of cytoskeletal actin,fl Bioimaging 1, 129OE135 (1993).19. Moerner, W.E., Kador, L., fiOptical detection and spectroscopy of single molecules in a solid,fl Phys. Rev. Lett. 62, 2535OE2538 (1989).20. Orrit, M., Bernard, J., fiSingle pentacene molecules detected by ^uorescence excita-tion in a p-Terphenyl crystal,fl Phys. Rev. Lett. 65, 2716OE2719 (1990).21. Shera, E.B., Seitzinger, N.K., Davis, L.M., Keller, R.A., Soper, S.A., fiDetection of single ^uorescent molecules,fl Chem. Phys. Lett. 174, 553OE557 (1990).22. Rigler, R., Widengren, J., fiUltrasensitive detection of single molecules by ^uores-cence correlation spectroscopy,fl BioScience 3, 180OE183 (1990).23. Betzig, E., Chichester, R.J., fiSingle molecules observed by near-,eld scanning opti-cal microscopy,fl Science 262, 1422OE1425 (1993).24. Bethe, H.A., fi.eory of di\"raction by small holes,fl Phys. Rev. 66, 163OE166 (1944).25. Hess, H.F., Betzig, E., Harris, T.D., Pfei\"er, L.N., West, K.W., fiNear-,eld spectros-copy of the quantum constituents of a luminescent system,fl Science 264, 1740OE1745 (1994).26. Betzig, E., fiProposed method for molecular optical imaging,fl Opt. Lett. 20, 237OE239 (1995).27. van Oijen, A.M., Kohler, J., Schmidt, J., Muller, M., Brakenho\", G.J., fiFar-,eld ^uo-rescence microscopy beyond the di\"raction limit,fl JOSA A 16, 909OE915 (1999). Single Molecules, Cells, and Super-Resolution Optics 13528. Qu, X., Wu, D., Mets, L., Scherer, N.F., fiNanometer-localized multiple single-mole-cule ^uorescence,fl Proc. Natl. Acad. Sci. USA 101, 11298OE11303 (2004).29. Gordon, M.P., Ha, T., Selvin, P.R., fiSingle-molecule high-resolution imaging with photobleaching,fl Proc. Natl. Acad. Sci. USA 101, 6462OE6465 (2004).30. Heilmann, M., Herten, D.P., Heintzmann, R., Cramer, C., Muller, C., et al., fiHigh-resolution colocalization of single dye molecules by ^uorescence lifetime imaging microscopy,fl Anal. Chem. 74, 3511OE3517 (2002).31. Lidke, K., Rieger, B., Jovin, T., Heintzmann, R., fiSuperresolution by localization of quantum dots using blinking statistics,fl Opt. Express 13, 7052OE7062 (2005).32. Chal,e, M., Tu, Y., Euskirchen, G., Ward, W.W., Prasher, D.C., fiGreen ^uorescen protein as a marker for gene expression,fl Science 263, 802OE805 (1994).33. Chattoraj, M., King, B.A., Bublitz, G.U., Boxer, S.G., fiUltra-fast excited state dynam-ics in green ^uorescent protein: multiple states and proton transfer.fl Proc. Natl. Acad. Sci. USA 93, 8362OE8367 (1996).34. Yokoe, H., Meyer, T., fiSpatial dynamics of GFP-tagged proteins investigated by local ^uorescence enhancement,fl Nat. Biotech. 14, 1252OE1256 (1996).35. Dickson, R.M., Cubitt, A.B., Tsien, R.Y., Moerner, W.E., fiOn/o\" blinking and switching behavior of single molecules of green ^uorescent protein,fl Nature 388, 355OE358 (1997).36. Patterson, G.H., Lippincott-Schwartz, J., fiA photoactivable GFP for selective photo-labeling of proteins and cells,fl Science 297, 1873OE1877 (2002).37. Betzig, E., fiSparse and composite coherent lattices,fl Phys. Rev. A 71, 063406 (2005).38. Betzig, E., fiExcitation strategies for optical lattice microscopy,fl Opt. Express 13, 3021OE3036 (2005).39. Betzig, E., Patterson, G.H., Sougrat, R., Lindwasser, O.W., Olenych, S., et al., fiImaging intracellular ^uorescent proteins at nanometer resolution,fl Science 313, 1642OE1645 (2006).40. H. Shro\", H. White, E. Betzig, fiPhotoactivated localization microscopy (PALM) of adhesion complexes,fl Curr. Protocols in Cell Biol. 4.21.1OE4.21.27 (2008).41. Green,eld, D., McEvoy, A.L., Shro\", H., Crooks, G.E., Wingreen, N.S., Betzig, E., Liphardt, J., fiSelf-organization of the Escherichia coli chemotaxis network imaged with super-resolution light microscopy,fl PLoS Biol. 7, e1000137 (2009).42. Shro\", H., Galbraith, C.G., Galbraith, J.A., White, H., Gillette, J., Olenych, S., Davidson, M.W., Betzig, E., fiDual-color superresolution imaging of genetically expressed probes within individual adhesion complexes,fl Proc. Natl. Acad. Sci. 104, 20308OE20313 (2007).43. Yao, J., Fetter, R.D., Hu, P., Betzig, E., Tijan, R., fiSubnuclear segregation of genes and core promotor factors in myogenesis,fl Genes Dev. 25, 569OE580 (2011).44. Manley, S., Gillette, J.M., Patterson, G.H., Shro\", H., Hess, H.F., et al., fiHigh-denisty mapping of single molecule trajectories with photoactivated localization micros-copy,fl Nat. Methods 5, 155OE157 (2008).45. Frost, N.A., Shro\", H., Kong, H., Betzig, E., Blanpied, T.A., fiSingle-molecule dis-crimination of discrete perisynaptic sites of actin ,lament assembly within den-dritic spines,fl Neuron 67, 86OE99 (2010). 136 The Nobel Prizes46. Shtengel, G., Galbraith, J.A., Galbriath, C.G., Lippincott-Schwartz, J., Gillette, J.M, et al., fiInterferometric ^uorescent super-resolution microscopy resolves 3D cellular ultrastructure,fl Proc. Natl. Acad. Sci. USA 106, 3125OE3130 (2009).47. Kanchanawong, P., Shtengel, G., Pasapera, A.M., Ramko, E.B., Davidson, M.W., Hess, H.F., Waterman, C.M., fiNanoscale architecture of integrin-based cell adhe-sions,fl Nature 468, 580OE584 (2010).48. Van Engelenburg, S.B., Shtengel, G., Sengupta, P., Waki, K., Jamik, M., et al., fiDistribution of ESCRT machinery at HIV assembly sites reveals virus sca\"olding of ESCRT subunits,fl Science 343, 653OE656 (2014).49. Kopek, B.G., Shtengel, G., Xu, C.S., Clayton, D.A., Hess, H.F., fiCorrelative 3D super-resolution ^uorescence and electron microscopy reveal the relationship of mito-chondrial nucleoids to membranes,fl Proc. Natl. Acad. Sci. USA 109, 6136OE6141 (2012).50. Sochacki, K.A., Shtengel, G., van Engelenburg, S.B., Hess, H.F., Taraska, J.W., fiCorrelative super-resolution ^uorescence and metal replica transmission electron microscopy,fl Nat. Methods 11, 305OE308 (2014).51. Shro\", H., Galbraith, C.G., Galbraith, J.A., Betzig, E., fiLive-cell photoactivated localization microscopy of nanoscale adhesion dynamics,fl Nat. Methods 5, 417OE423 (2008).52. Szymborska, A., de Marco A., Daigle N., Cordes, V.C., Briggs, J.A., Ellenberg, J., fiNuclear pore sca\"old structure analyzed by super-resolution microscopy and par-ticle averaging,fl Science 341, 655OE658 (2013).53. Schermelleh, L., Heintzmann, R., Leonhardt, H., fiA guide to super-resolution ^uo-rescence microscopy,fl J. Cell Biol. 190, 165OE175 (2010).54. Gustafsson, M.G., fiSurpassing the lateral resolution limit by a factor of two using structured illumination microscopy,fl J. Microsc. 198, 82OE87 (2000).55. Shao, L., Kner, P., Rego, E.H., Gustafsson, M.G.L., fiSuper-resolution 3D micros-copy of live whole cells using structured illumination,fl Nat. Methods 8, 1044OE1046 (2011).56. Image courtesy of Dr. Dong Li, Janelia Research Campus, HHMI57. Rego, E.H., Shao., L., Macklin, J.J., Winoto, L., Johansson, G.A., et al., fiNonlinear structured-illumination microscopy with a photoswitchable protein reveals cellular structures at 50-nm resolution,fl Proc. Natl. Acad. Sci. USA 109, E135OEE143 (2012).58. Huisken, J., Swoger, J., Del Bebe, F., Wittbrodt, J., Stelzer, E.H., fiOptical sectioning deep inside live embryos by selective plane illumination microscopy,fl Science 305, 1007OE1009 (2004).59. Chen, B-C, Legant, W.R., Wang, K., Shao, L., Milkie, D.E., et al., fiLattice light sheet microscopy: imaging molecules to embryos at high spatiotemporal resolution,fl Science 346, 1257998 (2014).60. Sharonov, A., Hochstrasser, R.M., fiWide-,eld subdi\"raction imaging by accumu-lated binding of di\"using probes,fl Proc Natl. Acad. Sci. USA 103, 18911OE18916 (2006).61. Wang, K., Milkie, D.E., Saxena, A., Engerer, P., Misgeld, T., et al., fiRapid adaptive optical recovery of optimal resolution over large volumes,fl Nat. Methods 11, 625OE628 (2014). Single Molecules, Cells, and Super-Resolution Optics 13762. Ji, N., Milkie, D.E., Betzig, E., fiAdaptive optics via pupil segmentation for high reso-lution imaging in biological tissues,fl Nat. Methods 7, 141OE147 (2009).63. Ji, N., Sato, T.R., Betzig, E., fiCharacterization and adaptive optical correction of aberrations during in vivo imaging in the mouse cortex,fl Proc. Natl. Acad. Sci. USA 109, 22OE27 (2012).64. Wang, C., Liu, R., Milkie, D.E., Sun, W., Tan, Z., et al., fiMultiplexed aberration mea-surement for deep tissue imaging in vivo,fl Nat. Methods 11, 1037OE1040 (2014).Portrait photo of Eric Betzig by photographer Alexander Mahmoud."}, "bio": {"url": "http://www.nobelprize.org/nobel_prizes/chemistry/laureates/2014/betzig-bio.html", "words": "I was born and raised in Ann Arbor, Michigan, a university town. Even though my parents were not affiliated with the university while I was growing up, I think that environment and the people I encountered there really contributed to my latching on to science. My Dad went to the University of Michigan as a physical education major right after World War II. He became the captain of the wrestling team (Figure 1), and after graduation, he was asked to stay on as an assistant coach. Eventually, to make more money, he started working as a junior draftsman at a machine tool business, and my parents put down roots in Ann Arbor. Figure 1. Two budding engineers. (Left) My Dad, captain of the University of Michigan wrestling team, 1948. (Right) Me, building a giraffe, age 7. My Dad taught me the value of hard work. He came from very humble beginnings, but eventually started his own company and grew it to 300 employees and 75 million dollars in annual sales. My mom raised my two older sisters, my younger brother, and me. Both my parents were quite intelligent, as well as extremely competitive. My Dad was an All-American wrestler who just missed the 1948 Olympic team. My Mom didn't have any outlet for her intelligence, and I think she was unhappy being locked into her role as a housewife in the 1950s and 60s. But she loved to trounce all the contestants on Jeopardy when it came on TV. Genetically, I think my parents' competitiveness coherently interfered in me to create something four times as competitive as either one of them. I don't like to lose. I had a happy childhood. I was in Boy Scouts and I'd play a bit with other kids, but nothing really interested me as much as reading and learning. My siblings say I was self-absorbed. I latched on to the space program around the time I was in kindergarten, drawn to the exploration and the excitement, the rockets and the power. I drew elaborate designs of spacecraft and other nonsensical machines that my fifth grade teacher hung in the corridors of the elementary school, and when I was a bit older, I was really into building model rockets. When I was talking about science I could be engaging, but outside of that, I was very shy. In the third grade, I made friends with a boy whose Dad was a scientist at the university, and he infected me with his enthusiasm for science. We had a subscription to the Science Service, and waited with baited breath for the company to mail us a new kit each month so we could get started building a battery or doing the next experiment. By the end of fourth grade, I had exhausted every science-related book in the library and was looking for more to learn. I remember writing a letter to a scientist at the university right after quarks were discovered. I asked him about the mass and charge of quarks, and I was so excited when he wrote back with answers to my questions. By middle school, I wanted to be a theoretical astrophysicist. In seventh grade, I'd spend most afternoons messing around with a couple of friends in the science teacher's back room, which had everything you would need to make everything from fireworks to a Van de Graaf accelerator. We usually stayed until dinnertime, making gunpowder or mixing chemicals to see what colors they gave off when you added various metals. That guy would probably be arrested if he allowed that today, but that freedom to explore was so valuable. By high school, I became a machine of studying. I took advanced placement everything, whether it interested me or not, and I pulled innumerable all-nighters working on assignments. My attendance was probably barely  enough to pass, but man, I learned a lot. My biology teacher senior year was Mr. Young. Knowing he had never given an A, I made it my mission to get an A+ in his class. Every week, we had another complicated and extremely detailed lab, and that's where I realized I liked experimentation and doing things with my hands. I turned in a 50-100 page lab report every week, and I got the A+. After high school, I went to Caltech. I went with much trepidation, afraid I wouldn't measure up to my classmates. I didn't realize that my public high school was probably one of the best in the country, and it turned out I was better prepared than most of the kids. I threw myself into my coursework, taking harder and harder classes. By my junior year, I found my limit. It felt like an infinite loop of homework and studying and test taking. I had to take the third trimester off because of my health - my hair was falling out and I had eczema so bad I looked like a lobster. I've never worked that hard at any other time in my life. I got a great education at Caltech but it was extremely theoretical. It was an independent project in a fluid mechanics lab that hooked me on doing experimental research. My advisor, Garry Brown, encouraged me to present my research at an undergraduate competition held by the American Institute of Aeronautics and Astronautics. My practice talk was incredibly dense and full of equations, and he ripped it to shreds. He taught me that when you give a talk, you are telling a story. That was incredibly helpful in learning how to communicate science, and in the end I won the nationals of that competition. That experience convinced me to be an experimental scientist. So, when I graduated from Caltech in 1983, I wanted to find practical applications of my physics. Cornell offered one of the few applied physics programs in the country at that time, and its student population was 50 percent female. Although I was still very shy, I knew if I went there I would be forced to confront the opposite sex. So I went to Cornell. The path to the rest of my career was set almost immediately. After the first semester, I met Mike Isaacson and Aaron Lewis. Aaron had been trained as a chemist in Raman spectroscopy, and Mike was one of the first guys to directly image atoms in an electron microscope. He had turned that microscope around and made it into a lithography tool that could make holes as small as 30 nanometers in a thin membrane, which you could then coat with metal to make it opaque. He and Aaron thought that if they shone light through those apertures and scanned it across living cells, they could illuminate just a 30 nanometer region and produces images with the resolution of an electron microscope. This sounded like it could be something big, and I wanted in. Once I got started, I couldn't wait for classes to end. I wanted to be in the lab all the time. The first couple of years were really hard. We had no money. Fellow graduate student Alec Haratounian and I were able to make the patterns at the sub-micron facility, but we had to borrow or build just about everything else. So I learned how to make things work when you don't have anything to work with. My advisors mostly left me alone, so once we got a grant a few years in, I was free to make my own mistakes. I made plenty of mistakes, but you learn by failing, and I learned a lot. I did a lot of work characterizing the apertures, and Alec started putting together a test rig. But to make those apertures, the membrane had to be 100 nanometers thick, and if you looked at them the wrong way they would shatter. After the first couple of years, we figured out we could pull glass pipettes like people were doing for patch clamping to get the tips we needed for the probes. Alec got his thesis, and I built this crazy, elaborate, expensive microscope that kind of worked (Figure 2). I never looked at much beyond test patterns, but it was enough to prove that the idea was valid. Figure 2. My near-field microscope at Cornell. In that era, Cornell was at the forefront of many aspects of cryogenic condensed matter physics, which made it a recruiting conduit to Bell Labs. I wasn't salivating to go there, but I got an interview and I went to visit in early 1988. By the time I left, I knew it was where I really wanted to be. Everybody was so bright, and they didn't hold anything back. I had prepared a 45 minute talk and it took an hour and a half because I was just peppered with questions. It was fantastic. During that visit, I met Horst Stormer, head of the semiconductor physics research department (Figure 3). Horst radiated enthusiasm and energy out of every pore, and he was just brilliant besides. I knew next to nothing about semiconductor physics, but Horst thought near-field was a really cool idea and it could go places. He wanted to hire me, even though what I was doing was completely outside of what everyone else in the department was doing. Except for one guy - Harald Hess, who I also met during that visit. Harald had built a low temperature scanning tunneling microscope to study superconductors, and he and I hit it off immediately. Figure 3. My mentors, 1989. (Left) My boss at Bell Labs, Horst Stormer. (Right) My best friend, and the most talented scientist I've ever known, Harald Hess. I was hired in Horst's department, and I picked up where I'd left off with near-field. I had enough resources to build my microscope, but the damn thing wasn't working any better for me than it did at Cornell. Because of Bell Lab's history and the brilliance of everyone around me, I felt like I was on probation from the time I got there. Two years in, I wrote in my self-evaluation that if I didn't have a breakthrough in the next year, they wouldn't need to fire me because I would quit. Harald really kept me afloat both personally and professionally during that time. We both worked insanely hard during those years. I would come into work at 4:30 in the morning, and if I saw Harald's car, I would put my hand on the hood to find out if the engine was still warm. He did exactly the same thing. We were both really competitive, but we played tennis every morning and ate dinner together every night. We were best friends and still are. During my third year, I stopped just trying one thing after another, and started thinking like a physicist about why things weren't working. Once I understood the physical problems of the pipette tip I was using, I realized I could replace it with an optical fiber, which would deliver more light to the tip. I also came up with a method of using dissipation force feedback to regulate the tip's distance from the surface of a sample, which didn't break tips like my old method and could be used on cells as well as semiconductors. With those breakthroughs, the next few years were the golden age for nearfield micoscopy. I tried the technology everywhere I could think of. Sometimes it worked and sometimes it didn't, but the papers came quick. In 1992, we applied it to data storage - at one time we held the world record for storage density - and in the following year I demonstrated super-resolution fluorescence imaging of cells for the first time. W.E. Moerner had been the first to see the spectral signature of single molecules at cryogenic temperatures in 1989, but no one had yet imaged single molecules at room temp. You needed focused light, because otherwise the background would obscure the signature of a single molecule. At the time, there was no better means of focusing light than near-field microscopy, and as soon as I attempted that experiment, it worked. Surprisingly, the molecules looked like arcs instead of round spots - the molecule was acting as the light source, and its dipole moment was mapping out the electrical field inside the near-field aperture. It was an afternoon experiment that was a shock on many fronts. For my last hurrah with near-field, Harald and I put my near-field probe on his low-temperature tunneling microscope to study quantum well structures, which are the basis of semiconductor lasers, like those in laser pointers. With standard diffraction-limited optics, their spectrum looks like a smooth hill of emission, but we saw a crazy series of super sharp lines. Our probe volume was so small, the light could only be emitted at certain discrete sites. And the wavelength of that light was very sensitive to the local thickness of the quantum well, so they glowed in different colors, which meant we could study them individually. That was a stunning paper, but by this time I was fed up. Although nearfield has proven to be a valuable tool for materials characterization and studying light-matter interactions at the nanoscale, my original goal was to make an optical microscope that could look at living cells with the resolution of an electron microscope. But near-field only worked on samples that were ridiculously flat, where the thing that you wanted to see was ridiculously close to the surface. If you're 20 nanometers away, you lose significant resolution. I knew a cell was a bit rougher than 20 nanometers, so it just wasn't going to happen. Meanwhile, the field had blown up. There were hundreds of people doing near-field by this time, and much of it was crap. People were fooling themselves with images that had sharp-looking but artifactual structures, and they just didn't want to hear it. I felt like every good result I had provided justification for a hundred lousy papers to follow, and that was a waste of people's time and taxpayers' money. On top of that, it was clear by 1994 that Bell was coming to an end. The phone monopoly had been broken up in 1984, and it was hard for AT&T to justify all the spending on basic science. We could feel the weight of the world on our shoulders. I was exhausted. So I quit. While my wife worked, I stayed home with our daughter Kriya, who was born in 1993, and became a house husband. I really didn't know what I wanted to do. My Dad had worked for the same company until he was 60, then used his retirement savings to start a competing company. He had always wanted me to come work for him. So I made occasional trips to Michigan to consult for him while I raised my daughter in New Jersey and continued thinking about science. A few months after I left Bell, I was pushing Kriya around in the stroller and it popped into my head that if you could somehow isolate different molecules in multiple dimensions, you could localize each one and do super-resolution imaging that way. I was excited about this for a couple of months, and I published the idea. But I knew using it for biology was going to be very difficult, because there could be hundreds or thousands of proteins in a single diffraction-limited spot, and there was no easy way to distinguish them at room temperature. As an engineer, I didn't want to do a hero's experiment; I wanted to do something useful. When Kriya was three, and started speaking with a Jersey accent, I knew we had to get out of New Jersey. I eventually became convinced from the consulting I did that I could have an impact in my Dad's company, so we moved to Michigan in 1997 and set down roots. My Dad gave me as much freedom as I had at Bell. My proudest development was a servo-hydraulic machine tool that combined old hydraulic technology with modern control theory and the energy storage principles that are in today's hybrid cars (Figure 4). It could move four tons at eight Gs of acceleration and position to five micron precision. It was much smaller, much cheaper, much faster, and much better than any previous technology. It was also too different, and after three or four years developing it, I couldn't sell it worth beans. Figure 4. My detour. The Flexible Adaptive Servohydraulic Technology (FAST) machine tool I designed at my Dad's company. You work under so many more constraints in the business world than you do in academia - anybody who can make a profit has nothing but my utmost respect. But I was very bad at it, and I felt like I was only using a small fraction of what I knew and was good at, which was physics. So in 2002 I quit. That was probably the hardest part of my life. I had pissed away my academic career and I had pissed away my backup plan of working for my Dad. Once again, I didn't have any idea what I wanted to do. Fortunately, with money in the bank, I had some time to think of a solution. I reconnected with Harald, who had also gone into industry in San Diego, but wasn't completely satisfied. We started meeting in various national parks (Figure 5) and confronted our respective mid-life crises, asking: What do we want of life? What's important? How can we have an impact? The rest of the time, I would go to a cottage we had on a lake in Michigan to think while Kriya and her brother Ravi were in school. Figure 5. Finding our path. Harald (left) and I (right) on a trip to Yosemite National Park, 2002. I started reading the scientific literature again, and quickly came across Marty Chalfie's paper on green fluorescent protein, which he had published in 1994 as I was leaving Bell. It was like a religious revelation to me. Part of what made imaging with near-field so difficult was that it was hard to label proteins densely enough without also putting the fluorophore on a bunch of nonspecific crap. Here was a way to label with 100 percent specificity, and you could do it in a live cell. I couldn't believe how amazingly elegant it was. I hadn't wanted to go back to microscopy, but once I learned about GFP, I felt like I had to. I wanted to take advantage of GFP to do live cell imaging, but my physics knowledge had atrophied. So I pulled out my old textbooks and started redoing old homework problems. I was really motivated to understand it this time around, because I figured this was my last chance to make a scientific career. The knowledge was all in my head, it was just kind of stuck behind a wall, and that wall came down quickly. Robert Heinlein in Stranger in a Strange Land has this word called \"grok,\" where you know something so well that you love it and hate it and it's part of you. Within three months, I grokked diffraction and light and formation of foci. I started to think about using multiple foci to image more quickly. I learned about optical lattices, which had been developed several years earlier, and came up with a theory for new lattices that would allow for faster, less damaging imaging. After thinking through all the potential applications, I filed a patent that was more than 300 pages long. I tried to convince Harald to come make this lattice microscope with me. He was interested, but unsure. I also contacted Horst, who had won the Nobel in 1998, and was now at Columbia. He invited me to present the idea to the biology department there in April 2005. Marty Chalfie was one of my hosts during that visit, and he turned to me in the cab on the way to dinner and said, \"It sounds like you really believe in this idea. How are you going to get back in the lab?\" I said, \"I have no idea, but I read in Physics Today that there's a guy named Gerry Rubin who wants to make a biological Bell Labs,\" and we left it at that. I stayed focused on finding a way to do the lattice microscope, and in the same month went with Harald to meet Mike Davidson at Florida State University. Mike had one of the biggest libraries of fluorescent protein fusions in the world, and that's where we learned about photoactivatable fluorescent proteins. In the Tallahassee airport on our way home, it became obvious to Harald and me that this was the missing link for the idea that I had pitched after I left Bell: we could isolate a few molecules at a time by activating limited subsets of photoactivatable proteins. It seemed so easy. We immediately abandoned the lattice idea and started writing claims for patents. We continued to meet in various national parks, and planned our research and patent strategy. Harald and I didn't know any biology, so we needed help. I arranged to meet the developers of the photoactivable fluorophores, Jennifer Lippincott-Schwartz and George Patterson at the National Institutes of Health and told them our idea. Jennifer told us to build the microscope and bring it by. Harald and I built the first PALM microscope in his living room in La Jolla (Figure 6). We were both unemployed, but Harald had some of his equipment from Bell. We pulled that out of storage, and each put in $25,000 to cover everything else we needed. We worked hard, and in September shipped all the parts to rebuild the microscope in the darkroom of Jennifer's lab at the NIH. The first time we put a cover slip coated with molecules into the microscope and turned on the photoactivating light, the first subset popped up and we knew we had it. Figure 6. La Jolla Labs. Building the first PALM microscope in Harald's living room. By limiting the photoactivating light so that only a few labeling molecules appeared in each image, we could find the center of each spot. Repeating this 10 or 20 thousand times built up the super-resolution image. By early 2006, we had 20 nanometer resolution images of actin filaments, focal adhesions, mitochondria, and lysosomes. We submitted the work to Science in March, and it was published that August, after a lengthy fight with a reviewer who demanded correlative EM data, and then pushed for rejection even after we supplied it. Meanwhile, Marty had told Gerry that I was interested in that \"biological Bell Labs,\" HHMI's new Janelia Farm Research Campus. The campus wasn't built yet, but I was invited to interview in a little building off site in August, and was on the payroll in October 2005. Once the building opened in 2006, postdoc Hari Shroff and I lived and breathed PALM for the next few years. It was a very competitive time in super-resolution. We developed multicolor capability, and demonstrated live-cell PALM. We also developed with Jennifer a method to study cellular transport by watching subsets of molecules diffuse in a cell, and we had a few other successes here and there. In 2008, Nature Methods named super-resolution \"Method of the Year.\" Everyone and his kid sister were doing super-resolution by that time. Just like when near-field was at its peak, people were making all kinds of claims that I knew were impossible. Although we had demonstrated live cell imaging, PALM is too slow and throws too much light at a sample to be a practical solution for that. The field was getting crowded, and I've always found it most productive to go where the people aren't. It was time to do something new. Many of my neuroscientist colleagues at Janelia were trying to peer inside the brains of flies and mice, and I knew that imaging gets pretty crappy when you try to look deep below the surface of the tissue. We needed adaptive optics to correct for distortions caused by heterogeneity of the tissue. Astronomers deal with this problem in telescope images by shining a laser high in the atmosphere in the direction of the object they are observing, then measuring with a special sensor how the light from that guide star is distorted as it returns to Earth. We couldn't use quite the same approach because scattering in the brain obscures the guide star, so in 2010 postdoc Na Ji and I turned the sensing principle on its head and used image displacements in the sample itself as the sensor. Na has since improved this idea greatly in her own lab, and uses it to record neural activity deep in the cortex with much greater accuracy and reliability. Meanwhile, Ernst Stelzer had come to Janelia in 2008 and spoke about using a sheet of light to image a single plane at a time within a specimen while avoiding illuminating the regions above and below. I thought that was an elegant solution to the problem of photodamage, and wanted to contribute something new. A light sheet is typically too thick to see detail inside of cells, so with postdocs Liang Gao and Thomas Planchon, we used something called a Bessel beam that we scanned across the sample to create a much thinner light sheet. Within a year or so, we were imaging dynamics within living cells with good resolution in all three dimensions. One of the problems we encountered was that the Bessel beam had side lobes of weaker light, which created out-of-focus excitation. Liang eventually overcame that problem by stepping the beam instead of sweeping it, and using structured illumination microscopy (SIM), originally developed by my Janelia colleague Mats Gustafsson, to exploit the resulting periodic excitation pattern and extend the resolution a bit beyond the diffraction limit in two of the three dimensions. To not sacrifice speed when stepping the beam, we generated seven Bessel beams in parallel. To our initial surprise, spreading the energy seven-fold significantly cut the photodamage. What we learned was that while the total dose of light you put into the cell is important, what's far more important is the instantaneous power delivered to the cell. I then realized that this was consistent with what Na and I had found earlier in 2008 when we reduced the damage associated with two-photon imaging by splitting ultrafast light pulses into a series of sub-pulses of much lower peak power. Why stop at seven? I modeled the interactions of additional beams, and found that as they become crowded and the side lobes start to interfere, you get crazy resonances and anti-resonances - but there are magic periods where all of a sudden the side lobes destructively interfere. It's a triple win: You spread the energy out, get a very thin light sheet by eliminating the nasty side lobe problem, and you create a high contrast light sheet ideal for SIM. That brought me back full circle to the optical lattice theory I had published in 2005. That theory predicted exactly what types of light patterns would create these magic periods. Postdoc Kai Wang figured out how we could use a spatial light modulator to produce these patterns in the lab, and my other postdocs Bi-Chang Chen and Wesley Legant built lattice light sheet microscopes to discover what we could do with this technology. As it turns out, a lot. The light sheet is so thin that only in-focus molecules are illuminated, making it the perfect tool to push all single molecule imaging methods, including PALM, past their previous limitation to thin samples. Ditto with SIM. When used in a diffraction-limited mode, we can often record several image volumes per second or, at slower speeds, image many brightly labeled samples indefinitely. We worked with over thirty different groups on everything from the kinetics of single transcription factor molecules in stem cells to cell division, 3D cell migration, and embryonic development before publishing the method in Science shortly after I received the Nobel. I think the super-resolution field is still sorting itself out, but I have a suspicion that the lattice light sheet microscope, and not PALM, will be the high water mark of my career. I'll never be a biologist, but I get a kick out of the beauty of the movies, the craziness of the cell, and the opportunity to learn from dozens of the best biologists in the world. Every week it's a new adventure. Mats passed away in 2011, but we also continue to push the limits of SIM. My postdoc Dong Li has extended live cell SIM to 50 nm resolution at subsecond frame rates. Because it is so much faster and uses so much less power than PALM, STED, or RESOLFT, I think there's a good chance that SIM will be the super-resolution method that will have the greatest impact in live imaging. I feel like I've been incredibly lucky to have had the career I've had. Everywhere I've been, I've been able to focus 100% on my work - I've never written a grant in my life. I doubt I would have been as successful in a more traditional academic career path. My group at Janelia has never been larger than five postdocs, and has averaged three. It's tremendous fun to be able to work closely with them, and it's exciting to feel like I have a real intellectual stake in what comes out of the lab. I doubt I'd have the same rush with a larger group such as is common elsewhere. In fact, I think that our research model gives us an almost unfair competitive advantage over our peers. I'm also lucky in that I have a second chance to be a better husband and father. While I'm close with Kriya and Ravi, one of my regrets is that I didn't spend more time with them when they were growing up. Na and I have two happy and beautiful little hellions, Max and Mia, and I have the opportunity to be with them more. I don't know, though, if I'll ever figure out how to optimally balance my responsibility and desire to be at both work and home. Being fundamentally a pessimist, I still have two fears. One is that the distractions from the Nobel will disrupt our research model and hamper our productivity, as it has already begun to do. The other is that I feel we've been too successful. There's important work still to be done, such as in a project by my postdoc Tsung-Li Liu to combine an adaptive optics method for transparent specimens developed by Kai with the lattice light sheet tech developed by Bi-Chang and Wes. This would allow us to take cells away from the cover slip, and place them back into the multicellular environment in which they evolved. However, this too is likely to succeed. I think it's my obligation, given the resources at Janelia and the prestige and security of the Nobel, to throw the dice again, and do crazy, risky stuff. Harald and I are working together again with our respective groups in this direction. Only time will tell if anything comes of it, which is just the way I like it.   From The Nobel Prizes 2014. Published on behalf of The Nobel Foundation by Science History Publications/USA, division Watson Publishing International LLC, Sagamore Beach, 2015 This autobiography/biography was written at the time of the award and later published in the book series Les Prix Nobel/ Nobel Lectures/The Nobel Prizes. The information is sometimes updated with an addendum submitted by the Laureate.", "title": "Eric Betzig - Biographical"}, "timeline": {}, "affiliations": [{"city": "Ashburn, VA", "name": "Janelia Research Campus, Howard Hughes Medical Institute", "country": "USA"}], "gender": "male", "death_date": "", "diedCountryCode": "", "prize_title": "The Nobel Prize in Chemistry 2014", "birth_date": "1960-01-13", "co_winners": "Eric Betzig, Stefan W. Hell, William E. Moerner", "contribution": null}