{"motivation": "\"for the invention of efficient blue light-emitting diodes which has enabled bright and energy-saving white light sources\"", "last_name": "Amano", "share": "1/3", "death_city": "", "birth_country": "Japan", "year": "2014", "birth_city": "Hamamatsu", "death_country": "", "first_name": "Hiroshi", "area": "physics", "id": "907", "field": " semiconductor technology", "speech": {"date": "", "url": "", "location": "", "words": ""}, "bornCountryCode": "JP", "lecture": {"date": "2014-12-08 00:00:00", "url": "http://www.nobelprize.org/nobel_prizes/physics/laureates/2014/amano-lecture.pdf", "location": "Stockholm", "words": "43Growth of GaN on Sapphire via Low-Temperature Deposited Bu~er Layer and Realization of p-Type GaN by Mg Doping Followed by Low-Energy Electron Beam IrradiationNobel Lecture, December 8, 2014by Hiroshi AmanoDepartment of Electrical Engineering and Computer Science, Venture Business Laboratory, Akasaki Research Center, Nagoya University, Japan.ABSTRACT.is is a personal history of one of the Japanese researchers engaged in develop-ing a method for growing GaN on a sapphire substrate, paving the way for the realization of smart television and display systems using blue LEDs. .e most important work was done in the mid- to late 80s. .e background to the authortms work and the process by which the technology enabling the growth of GaN and the realization of p-type GaN was established are reviewed.1. MOTIVATION FOR STARTING BLUE LED RESEARCHTo explain blue light-emitting diodes (LEDs), it is worth showing an example of how they have changed our lives. Portable games machines and cellular or smart phones are very familiar items, especially to young people. .e worldtms ~rst portable games machine was released in 1979 [1] and cellular phones ~rst became commercially available in 1984 [2]. But until the end of the 90s, all the displays of portable games machines and cellular phones were monochrome. 44 The Nobel PrizesSo, it should be emphasized that the younger generation can now enjoy full-color portable games and cellular/smart phones because of the emergence of blue LEDs. Today, the applications of blue LEDs are not limited to displays. In combination with phosphors, blue LEDs can act as a white light source [3] and are also used in general lighting.In this introduction, let me brie@y explain why I became interested in the development of blue LEDs. .e two giant computer-related companies, Micro-so, and Apple, were established by Bill Gates and Paul Allen in 1975 [4] and by Steve Jobs and Stephen Wozniak in 1976 [5], respectively. Since then, the market for computers, especially personal computer (PC) systems has expanded enormously [6]. When these companies were ~rst established, Braun tubes were used in almost all displays as well as in television systems, and Braun tubes were too big to use in laptop PCs. Also, the use of Braun tubes in televisions meant that they were too bulky to be comfortably used in small Japanese houses. So, when I found nitride-based blue LEDs listed as an undergraduate dissertation topic at Akasaki Laboratory, Nagoya University, in 1982, I was so excited. .e reason why I chose this laboratory was that as a naive undergraduate student, I thought that the subject of nitride-based blue LEDs would be easy to under-stand. I thought if I could achieve blue LEDs, I would contribute to improv-ing the quality of life of people by helping to realize wall-mounted television systems and elegant PC systems, meaning that I would change the world. Of course, I was not aware at that time of the di\"culty of this subject.2. DIFFICULTY OF REALIZING HIGH~PERFORMANCE BLUE LEDs BASED ON GaNIf we try to grow bulk GaN crystals from a solution, we need a very high pres-sure and high temperature, similar to those needed for diamond growth, or even higher [7, 8]. So, we have to use a chemical reaction to reduce the pressure and temperature required for the growth of GaN. Also, we have to use foreign sub-strates. For the synthesis of GaN, we used ammonia as the nitrogen source [9] because nitrogen molecules are inert and do not actively react with metallic Ga. Ammonia is very active at temperatures of around 1000 degC at which GaN can be synthesized, therefore the range of materials that could be used as the substrate was limited.Sapphire was one of the most promising substrate materials because it is stable at high temperatures and does not react with ammonia so strongly [10]. But the most serious problem with sapphire is its large mismatch with GaN of up to 16% for each (0001) plane. In general, for heteroepitaxial growth, some Growth of GaN on Sapphire via Low-Temperature Deposited Bu~er Layer 45people think that the lattice mismatch should be less than a few percent [11], so a mismatch of 16% should make it almost impossible.In 1971, Professor Jacques Pankove developed the ~rst GaN-based blue LEDs, which were a metal-insulator-semiconductor (MIS)-type fabricated by hydride vapor phase epitaxy (HVPE), which involved the chemical reaction of Ga and hydrogen chloride to form GaCl and ammonia [12]. At that time, it was believed to be impossible to grow p-type GaN because of self-compensation [13]. Self-compensation means that if we dope acceptors as an impurity, the same number of intrinsic donors such as nitrogen vacancies are generated to compensate for the doped acceptors.Another reason why bright blue LEDs are so di\"cult to achieve is related to the sensitivity of the human eye. .e responsivity of the human eye to pure blue light is only 3% of that to 555 nm yellow-green light [14].3. FUNDING SITUATION OF OUR LABORATORY IN THE MID~1980S AND THE DIFFICULTY OF GROWING GaN ON A SAPPHIRE SUBSTRATELet me go back to the early 80s. Professor Isamu Akasaki started his research on nitrides in 1967 [15] at Matsushita Research Institute Tokyo (MRIT), now Panasonic, ~rst investigating powdered AlN. .en, his group started to grow GaN by molecular beam epitaxy (MBE) and observed its cathodoluminescence. His group subsequently switched to HVPE and succeeded in fabricating MIS-type blue LEDs with a @ip-chip con~guration in the late 70s [16]. Unfortunately, however, MRIT decided to abandon its project on GaN-based blue LEDs, so Professor Akasaki moved from MRIT to Nagoya University in 1981. I joined his laboratory in 1982 as an undergraduate student..e problem of fabricating MIS-type blue LEDs using HVPE was that the growth rate was so high that it was di\"cult to control the thickness of the in-sulating layer in the MIS-type structure. .erefore, the operating voltage could not be controlled. Also, Professor Akasaki noticed the di\"culty of growing GaN by MBE. He thus decided to use metalorganic vapor phase epitaxy (MOVPE) for the growth of GaN. At that time, funding for research at our laboratory was insu\"cient [17]. Also, there was no commercially available MOVPE system es-pecially designed for the growth of GaN. Consequently, it was impossible to buy an MOVPE system. So in 1982, a mastertms degree student two years older than I developed the ~rst vertical type MOVPE reactor [18]. At that time, the @ow rate was so low that we could not grow GaN using hydrogen as the carrier gas. I tried to visualize the @ow pattern by using the reaction between TiCl4 and H2O 46 The Nobel Prizesto form TiO2 powder and found that the @ow rate would be insu\"cient if I used hydrogen as the carrier gas.In 1984, a PhD student, now Dr. Yasuo Koide, joined Professor Akasakitms laboratory and started research on AlGaN and AlN, while I focused on growing GaN. From experience, I knew that the @ow rate would be insu\"cient if I used the old con~guration of gas supply tubes in the reactor, so I merged all the gas lines into one line and increased the @ow rate from a few cm/s to more than 4 m/s [19]. .en, I successfully grew GaN on a sapphire substrate even though I used hydrogen as the carrier gas, although the surface was quite rough and the quality was very poor.I tried to grow GaN many times while varying the growth temperature, the @ow rate of the source and carrier gases, the con~guration of the linear tubes, the susceptor shape, and other parameters. But I could not grow high-quality GaN with a smooth surface. .e problem of the large lattice mismatch of 16% was too great for a mastertms student to overcome. So, almost two years passed without any success.4. LOW~TEMPERATURE DEPOSITED BUFFER LAYERIn February 1985, I was almost at the end of my mastertms course. A foreign stu-dent and I had decided to start a PhD program from April. While all the other Japanese students went on a graduation trip, I carried out lonely experiments. At that time, Dr. Koide was growing Al-containing nitrides such as AlN and AlGaN and I was growing GaN. When we compared his Al-containing crystals and my GaN, the surface of his crystals seemed to be smoother. .erefore, I thought that AlN could be used to e^ectively grow GaN with a better surface morphology. So, I tried to grow a thin AlN layer on a sapphire substrate just before the growth of GaN. At that time, I knew that the epitaxial temperature of AlN should be higher than 1200degC. Because the old oscillator did not work well, I could not get the temperature to reach 1200degC. However, I suddenly remembered a dis-cussion in the laboratory. Dr. Sawaki, an associate professor at that time, ex-plained the growth process of boron phosphide (BP) on Si [20], for which the lattice mismatch is as large as 16%. He explained the e^ectiveness of a pre@ow of phosphorus as a source gas just before the growth of BP and mentioned that the phosphor atoms appear to act as nucleation centers. So, I imagined that if I supplied a small amount of AlN at a low temperature, it should provide nucle-ation centers. .e temperature sequence in the growth process is shown in Fig. 1. Usually, I looked inside the reactor during growth to see whether there was an interference pattern on the substrate, by which I could check that the source gas Growth of GaN on Sapphire via Low-Temperature Deposited Bu~er Layer 47had been properly supplied. But at that time, I was tired and forgot to check the interference pattern. When I took the sample out from the reactor and saw that it had a perfectly smooth surface and was perfectly transparent, I thought, fiOh, Itmve made a mistake! I forgot to supply trimethylgallium!fl.But a,er rethinking, I recognized that I had not made a mistake.So, I checked the surface using a Nomarski-type microscope and found that I had succeeded in growing atomically @at GaN as shown in Fig. 2. Follow-ing the suggestion of Professor Akasaki, I evaluated other qualities such as the crystalline, optical, and electrical qualities, all of which were superior to those in previous reports. .is process is known as filow-temperature deposited bu^er layer technologyfl and has been used by many researchers worldwide [21OE37].FIGURE 1. Susceptor temperature sequence in the growth of GaN on a sapphire substrate using a low-temperature-deposited AlN bu^er layer.FIGURE 2. Scanning electron microscopic images of GaN on a sapphire (0001) substrate (a) without and (b) with a low-temperature-deposited AlN bu^er layer [19]. 48 The Nobel Prizes5. REALIZATION OF p~TYPE GaN.e next task for us was to realize p-type GaN. I grew Zn-doped GaN many times, but all the samples were highly resistive or n-type. In 1987, during my PhD program, I observed very sharp exciton emission from Zn-doped GaN grown on c-plane and a-plane sapphire at a cryogenic temperature [22]. I also measured the deformation potential of the GaN. I was excited by these results and tried to present them at the Japan Society for Applied Physics annual fall meeting held at Nagoya University. However, I was surprised to see that there were only four people in the room for my presentation, the chairman, Prof. Aka-saki, one other guy and me. At that time, other researchers were interested in other compound semiconductors such as GaAs and ZnSe, and GaN researchers were in the minority. Also in 1988, during my internship as part of my PhD program, I found that Zn-related blue emission was enhanced irreversibly dur-ing cathodoluminescence measurement as shown in Fig. 3 [38]. So, I called this process low-energy electron beam irradiation (LEEBI) treatment. But even a,er the LEEBI treatment, Zn-doped GaN did not show p-type conductivity. .is phenomena was already published by Russian scientist. [39]In 1989, I became a research associate of the Akasaki Laboratory of Nagoya University. When I read the textbook fiBonds and Bands in Semiconductors,fl written by Dr. J.C. Phillips [40], I found one graph particularly interesting. It shows that Mg is better than Zn for the activation of acceptors. However, the Mg source, bis-Cp2Mg, was too expensive. So, I begged Professor Akasaki to let me buy some. He kindly gave permission, and a,er waiting several months for it to arrive, I was able to grow many Mg-doped samples with my laboratory partner Masahiro Kito, at that time a mastertms student.FIGURE 3. Change in blue PL intensity upon electron beam (EB) irradiation of Zn-doped GaN [38]. Growth of GaN on Sapphire via Low-Temperature Deposited Bu~er Layer 49Here, I would like to mention the pioneering work in 1972 of Dr. H.P. Maruska [41], who at that time was a student at Stanford University. He suc-ceeded in fabricating the worldtms ~rst MIS-type violet LED using Mg-doped GaN.All our Mg-doped GaN samples were highly resistive when they were as-grown. But a,er LEEBI treatment, some samples showed p-type behavior when subjected to hot probe measurement. I knew that hot probes are not so reliable and that no one would believe that p-type conduction had been achieved. So, Mr. Kito subjected the samples to Hall e^ect measurement and we ~nally recog-nized that we had achieved p-type GaN for the ~rst time in the world. We also fabricated pn-junction ultraviolet LEDs as shown in Fig. 4 [42OE45]. Soon a,er that, Dr. Shuji Nakamuratms group also used LEEBI treatment [46, 47]. In 1992, Dr. Nakamura claimed that p-type GaN could be obtained by simple thermal annealing [48]. Today, almost all LED companies use thermal annealing..e mechanism of p-type conduction involves the desorption of hydrogen near Mg acceptors as shown in Fig. 4, as ~rst pointed out by Professor J.A. Van Vechten [49], which was con~rmed experimentally by Dr. Nakamura [48].6. ATTEMPTS TO GROW InGaNFor us, another important task was to realize true blue emission using a band-to-band transition. So, we tried to grow InGaN. However, this was also very di\"cult and we only succeeded in growing InGaN with an In composition of less than 1.7% [50].FIGURE 4. Schematic GaN drawing of the activation of hydrogen-passivated Mg in GaN [48] and electroluminescence pattern of a LED in which only the area of the fiMfl was ir-radiated with an electron beam [41]. 50 The Nobel PrizesIn 1989, Dr. Takashi Matsuokatms group at NTT reported the successful growth of InGaN under an extremely high ammonia supply while also using nitrogen as a carrier gas [51]. .ey also reported blue-violet photoluminescence (PL) at 77 K, indicating the incorporation of In. At room temperature, deep-level-related yellow emission could be observed. .e mechanism of In incor-poration in InGaN has been clari~ed by thermodynamic analysis by Professor Akinori Koukitu et al. [53, 54].Finally, by combining high-quality-crystal growth technology using a low-temperature-deposited bu^er layer with p-type growth technology and InGaN growth technology, Nichia Corporation succeeded in commercializing double-heterostructure-type InGaN blue LEDs for the ~rst time in the world in 1993 [55]. .ey also fabricated single-quantum-well LEDs in 1995 [56], which are also a very important technology for enhancing the e\"ciency of nitride LEDs because a very narrow quantum well suppresses the quantum-con~ned Stark e^ect [57], thus increasing the transition probability [58].7. CONTRIBUTION OF InGaN~BASED BLUE LEDs TO ENERGY SAVINGTo conclude, let me explain how InGaN LEDs can contribute to improving the electricity situation, especially in Japan. Many people remember the great earth-quake of east Japan and the meltdown of the nuclear power plants in 2011. Cur-rently, none of the 48 nuclear electricity generators in Japan are in operation [59]. Before 2011, about 30% of Japantms electricity was generated by nuclear reac-tors. So, we have to ~nd a way of adapting to the loss of 30% of Japantms generating capacity. .e US Department of Energy predicted that more than 70% of light-ing will have been replaced with LED lighting systems by the year 2030 in the United States, resulting in a 7% reduction in electricity use [60]. In the case of Japan, the penetration of LED lighting systems into the market is expected to be much faster. A research company in Japan has predicted that by 2020 more than 70% of general lighting systems will have been replaced with LED lighting [61].More importantly, we can develop and supply compact lighting systems to the younger generation, especially children in remote areas without access to electricity. Figure 5 shows an image of the Earth at night provided by NASA [62]. Using an LED lighting system with a solar cell panel and a battery, children can read books and study at night as shown in the inset images of Fig. 5.Finally, I would like to address younger researchers. When we achieved the LT bu^er, I was a 24-year-old mastertms student, and when we ~rst realized p-type GaN, I was 28 years old. Of course I was very lucky to have carried out re-search under the excellent supervision of Prof. Akasaki and many distinguished Growth of GaN on Sapphire via Low-Temperature Deposited Bu~er Layer 51colleagues. .ese days, facilities and funding are much better than in the 80s. So, I would like to see the younger generation attempting to tackle subjects which will greatly contribute to improving the quality of human lives. By doing so, the younger generation can develop a much better world for themselves.ACKNOWLEDGEMENTSI would like to thank the following people: Isamu Akasaki, Nobuhiko Sawaki, Kazumasa Hiramatsu, Shigeru Tamura, Atsushi Shimizu, Yasuo Koide, Kenji Itoh, Takahiro Kozawa, Masahiro Kito, Kouichi Naniwae; the previous stu-dents of Akasaki Laboratory at Nagoya University, Satoshi Kamiyama, Tetsuya Takeuchi, and Motoaki Iwaya; the previous students of the Akasaki and Amano Laboratory at Meijo University, Masahito Yamaguchi, Yoshio Honda, Guangju Ju, Kaddour Lekhal, and Siyoung Bae; the students of Amano, Yamaguchi and Honda Laboratory at Nagoya University, Aki Eguchi, Masako Yasui, Yoko Tat-sumi, Tomoko Hosoe, Michinari Hamaguchi, Hideyo Kunieda, Yoshihito Wata-nabe, Yasuo Suzuoki, and Seiichi Matsuo; the sta^ of Nagoya University, Koichi Ota, Naoki Shibata, Nobuo Okazaki, Katsuhide Manabe, Michinari Sassa, Hi-saki Kato, Masahiro Kotaki, and Tadashi Arashima; the sta^ of Toyoda Gosei, Masafumi Hashimoto, Akira Hirano, Masamichi Ipponmatsu, Cyril Pernot, Hidemasa Tomosawa, and Toshihiko Kai; and the sta^ of UVCR and Nikkiso.Finally, I would like to express my sincere gratitude to my parents Yoshiko and Tatsuji Amano, my brother Takashi Amano, and my family Kasumi, Aya, and Mitsuru Amano.FIGURE 5. Image of the Earth at night provided by NASA [61]. 52 The Nobel PrizesREFERENCES1. http://gaming.wikia.com/wiki/History_of_handheld_game_consoles2. http://en.wikipedia.org/wiki/Mobile_phone3. P. Schlotter, R. Schmidt and J. Schneider, Appl. Phys., A64 (1997) 417.4. http://news.bbc.co.uk/2/hi/business/5085630.stm5. http://www.notablebiographies.com/Ho-Jo/Jobs-Steve.html6. http://www.maximizingprogress.org/2012/03/platform-wars-history-of-emergent.html7. S. Porowski and I. Grzegory, J. Cryst. Growth, 178 (1997) 174.8. F. P. Bundy, H. T. Hall, H. M. Strong and R. H. Wentorf, Nature, 176 (1955) 51.9. W. C. Johnson, J. B. Parsons and M. C. Crew, J. Phys. Chem., 36 (1932) 7.10. H. P. Maruska and J. J. Tietjen, Appl. Phys. Lett., 15 (1969) 327.11. For example, F. C. Frank and J. H. van der Merwe, Proc. R. Soc. London, Ser. A 198 (1949) 205.12. J. I. Pankove, E. A. Miller, D. Richman and J. E. Berkeyheiser, J. Lumin., 4 (1971) 63.13. For example, G. Mandel, Phys. Rev. A, 134 (1964) 1073.14. For example, photopic V(~) modi~ed by Vos (1978) http://www.cvrl.org/ Copyright (c) 1995OE2015 Color and Vision Research Labs.15. I. Akasaki and M. Hashimoto, Solid State Commun., 5 (1967) 851.16. Y. Ohki, Y. Toyoda, H. Kobayashi and I. Akasaki, Inst. Phys. Conf. Ser., 63 (1982) 479.17. For example, http://www.mext.go.jp/english/whitepaper/1302651.htm18. M. Hashimoto, H. Amano, N. Sawaki and I. Akasaki, J. Cryst. Growth, 68 (1984) 163.19. H. Amano, N. Sawaki, I. Akasaki and Y. Toyoda, Appl. Phys. Lett., 48 (1986) 353.20. T. Nishinaga and T. Mizutani, Jpn. J. Appl. Phys., 14 (1975) 753.21. H. Amano, I. Akasaki, K. Hiramatsu, N. Koide and N. Sawaki, ~in Solid Films, 163 (1988) 415.22. H. Amano, K. Hiramatsu and I. Akasaki, Jpn. J. Appl. Phys., 27 (1988) L1384.23. I. Akasaki, H. Amano, Y. Koide, K. Hiramatsu and N. Sawaki, J. Cryst. Growth, 98 (1989) 209.24. H. Amano, T. Asahi and I. Akasaki, Jpn. J. Appl. Phys., 29 (1990) L205.25. K. Hiramatsu, H. Amano, I. Akasaki, H. Kato, N. Koide and K. Manabe, J. Cryst. Growth, 107 (1991) 509.26. K. Hiramatsu, S. Itoh, H. Amano, I. Akasaki, N. Kuwano, T. Shiraishi and K. Oki, J. Cryst. Growth, 115 (1991) 628.27. N. Kuwano, T. Shiraishi, A. Koga, K. Oki, K. Hiramatsu, H. Amano, K. Itoh and I. Akasaki, J. Cryst. Growth, 115 (1991) 381.28. S. Nakamura, Jpn. J. Appl. Phys., 30 (1991) 1620.29. H. Murakami, T. Asahi, H. Amano, K. Hiramatsu, N. Sawaki and I. Akasaki, J. Cryst. Growth, 115 (1991) 648.30. J. N. Kuznia, M. A. Khan, D. T. Olson, R. Kaplan and J. Freitas, J. Appl. Phys., 73 (1993) 4700.31. S. T. Kim, H. Amano, I. Akasaki and N. Koide, Appl. Phys. Lett., 64 (1994) 1535.32. T. Sasaoka and T. Matsuoka, J. Appl. Phys., 77 (1995) 192.33. Y. M. Le Vaillant, R. Bisaro, J. Oliver, O. Durand, J. Y. Duboz, S. Ru^enach-Clur, O. Briot, B. Gil and R. L. Aulombard, Mater. Sci. Eng., B50 (1997) 32. Growth of GaN on Sapphire via Low-Temperature Deposited Bu~er Layer 5334. M. Iwaya, T. Takeuchi, S. Yamaguchi, C. Wetzel, H. Amano and I. Akasaki, Jpn. J. Appl. Phys., 37 (1998) L316.35. Y. M. Le Vaillant, R. Bisaro, J. Olivier, O. Durand, J-Y Duboz, S. Ru^enach-Clur, O. Briot, B. Gil, and R. L. Aulombard, J. Cryst. Growth, 189/190 (1998) 282.36. Y. Kobayashi, T. Akasaki and N. Kobayashi, Jpn. J. Appl. Phys., 37 (1998) L1208.37. T. Ito, K. Phtsuka, K. Kuwahara, M. Sumiya, Y. Takano and S. Fuke, J. Cryst. Growth, 205 (1999) 20.38. H. Amano, I. Akasaki, T. Kozawa, K. Hiramatsu, N. Sawaki, K. Ikeda and Y. Ishii, J. Lumin., 40OE41 (1988) 121.39. G.V. Saparin, S.K. Obyden, M.V. Chukichev, S.J. Popov, J. Lumin. 31 & 32 (1984), 684.40. J. C. Phillips, Bonds and Bands in Semiconductors, 1st edition, Academic Press 1973.41. H. P. Maruska, W. C. Rhines and D. A. Stevenson, Mater. Res. Bull., 7 (1972) 777.42. H. Amano, M. Kito, K. Hiramatsu and I. Akasaki, Jpn. J. Appl. Phys., 28 (1989) L2112.43. H. Amano, M. Kitoh, K. Hiramatsu and I. Akasaki, J. Electrochem. Soc., 137 (1990) 1639.44. I. Akasaki, H. Amano, M. Kito and K. Hiramatsu, J. Lumin., 48 & 49 (1991) 666.45. I. Akasaki, H. Amano, H. Murakami, M. Sassa, H. Kato and K. Manabe, J. Cryst. Growth, 128 (1993) 379.46. S. Nakamura, M. Senoh and T. Mukai, Jpn. J. Appl. Phys., 30 (1991) L1708.47. S. Nakamura, N. Iwasa, M. Senoh and T. Mukai, Jpn. J. Appl. Phys., 31 (1992) 1258.48. S. Nakamura, T. Mukai, M. Senoh and N. Iwasa, Jpn. J. Appl. Phys., 31 (1992) L139.49. J. A. Van Vechten, J. D. Zook, R. D. Horning and B. Goldenberg, Jpn. J. Appl. Phys., 31 (1992) 3662.50. T. Kozawa, Mastertms .esis, Nagoya University, 1987.51. T. Matsuoka, H. Tanaka, T. Sasaki and A. Katsui, Inst. Phys. Conf. Ser., 106 (1990) 141.52. N. Yoshimoto, T. Matsuoka, T. Sasaki and A. Katsui, Appl. Phys. Lett., 59 (1991) 2251.53. A. Koukitu, N. Takahashi, T. Taki and H. Seki, Jpn. J. Appl. Phys., 35 (1996) L673.54. A. Koukitu, T. Taki, N. Takahashi and H. Seki, J. Cryst. Growth, 197 (1999) 99.55. S. Nakamura, M. Senoh and T. Mukai, Jpn. J. Appl. Phys., 32 (1993) L8.56. S. Nakamura, M. Senoh, N. Iwasa and S. Nagahama, Jpn. J. Appl. Phys., 34 (1995) L797.57. H. Amano and I. Akasaki, Ext. Abst. Int. Conf. Solid State Devices and Materials, V-7 (1995) 683.58. T. Takeuchi, S. Sota, M. Katsuragawa, M. Komori, H. Takeuchi, H. Amano and I. Akasaki, Jpn. J. Appl. Phys., 36 (1997) L382.59. http://www.enecho.meti.go.jp/category/electricity_and_gas/nuclear/001/pdf/001_02_001.pdf (in Japanese)60. U.S. Department of Energy, Energy Savings Potential of Solid-State Lighting in General Illumination Applications, Jan. 2012, (2012) 4. (http://apps1.eere.energy.gov/buildings/publications/pdfs/ssl/ssl_energy-savings-report_jan-2012.pdf)61. Fuji Chimera Research Institute, Inc., 2014 LED Related Market Survey, (2014) 41.62. http://earthobservatory.nasa.gov/Features/NightLights/page3.phpPortrait photo of Hiroshi Amano by photographer Alexander Mahmoud."}, "bio": {"url": "http://www.nobelprize.org/nobel_prizes/physics/laureates/2014/amano-bio.html", "words": "I was born in Hamamatsu, Shizuoka Prefecture, Japan, on September 11, 1960, to my father Tatsuji and mother Yoshiko, and I grew up with younger brother Takashi. Hamamatsu is famous as the birthplace of Professor Kenjiro Takayanagi, a Japanese pioneer in the development of television, who succeeded in transmitting the first Katakana character \"i\" by wireless transfer using a Braun tube in 1926, and also Soichiro Honda, who established Honda Motor Co., Ltd., in 1946. In addition, several engineering and manufacturing companies, such as motorbike companies, musical instrument companies, and optoelectronics companies, are based in Hamamatsu. A possible reason why I considered a career in engineering may have been the influence of growing up in such an industrial city. I spent elementary school, junior high school, and high school at Hamamatsu. I was a weak child who was often ill. My grandmother Ken always nursed me, during which she often told me of her wretched experiences during World War II, so I learned a lot about the war. At elementary school, I concentrated on sports such as baseball and football. During elementary school and junior high school, I did not enjoy studying because the only reason to study seems to be to pass the entrance examination for high school. At high school, I had the same mathematics teacher for three years who taught me the importance of logical thinking and how to approach difficult problems in mathematics. I found that I could solve difficult problems if I thought logically. Although I became very interested in solving mathematics problems, I still did not have a good reason for studying. I moved to Nagoya in 1979 to enter Nagoya University as a student of the Department of Electrical Engineering. In the introductory class to engineering, I heard a very profound interpretation of the meaning of the Kanji character \"Gong ,\" which means engineering. The lecturer explained that the meaning of \"Gong \" is the connection of people with people, which means that the ultimate goal of engineering is to enrich the lives of people. I was astonished with this explanation and felt that my view of study had suddenly opened through recognizing that the meaning of study is to benefit the people. As a result, I became interested in all fields of study offered by my department, particularly computer science. This was soon after Bill Gates and Paul Allen established Microsoft (1975) and Steve Jobs and Stephen Wozniak started Apple Computers (1976). After the establishment of these now giant companies, the development of personal computer (PC) systems proceeded rapidly, and I hoped to contribute to the further development of PC systems. In 1982, when I was in my third year of university, I had to choose a dissertation research topic. Unfortunately, there were no topics concerning computer science, especially the design of central processing units. But when I found that GaN-based blue LEDs could be researched in Professor Isamu Akasaki's laboratory, I decided to pursue this topic as my dissertation topic. At that time, Braun tubes were used as the monitors of PCs and also in television systems. Because Braun tubes were so large, I thought that if I could develop blue LEDs, I could change the world by improving people's lives by providing the means to develop more smart PC and TV systems. At that time, I did not know how difficult it would be to develop blue LEDs. At that time, funding of our laboratory was very limited. Therefore, the students at Nagoya University had to develop their own system to enable the growth of nitride crystals by metal-organic vapor phase epitaxy (MOVPE). Through the efforts of a master's degree student followed by myself and Mr Koide, a student in the year above me, we succeeded in developing an MOVPE system. I then used our laboratory-built MOVPE system to try to grow high-quality GaN, and Mr. Koide focused on growing AlN and AlGaN. However, the growth of GaN on a foreign substrate such as sapphire was so difficult that I spent three years in vain trying to grow high-quality GaN. In February 1985, almost at the end of my master's course, I was still carrying out lonely fruitless experiments. When I compared my GaN and AlN grown by Mr Koide, I found that the surface morphology of his AlN was slightly better that that of my GaN, so I decided to deposit AlN just before growing GaN. I noticed that a very high temperature was necessary to grow AlN. However, the heating system of our MOVPE system was so old that it could not reach the required temperature. I then remembered a discussion with Dr. Sawaki, at that time Associate Professor at Akasaki Laboratory. He said that in the growth of boron phosphide (BP) on Si for which the lattice mismatch is 16%, almost the same as that of GaN on sapphire, the predeposition of P was effective for growing BP with a flat surface. He also mentioned that a P cluster should act as a nucleation center causing BP to grow laterally in the initial stage. I decided to deposit a very small amount of AlN at a low temperature, which I anticipated would act as a nucleation center. When I took the resulting sample out from the MOVPE reactor, I first thought that I had forgotten to supply the Ga source. But when I checked the surface morphology using an optical microscope, I finally recognized that I had succeeded in growing GaN with an atomically flat surface. It took almost one year for this result to be published in Applied Physics Letters because I had to check not only the surface morphology but also the crystalline quality, electrical properties and optical properties. I found that all the properties of the GaN film were far superior to those reported previously. This process is called low-temperature deposited buffer layer technology for growing GaN on a sapphire substrate by MOVPE. Our next challenge for us was to realize p-type GaN. I unsuccessfully tried to grow p-type GaN using Zn as an acceptor dopant from 1985 to 1988. At NTT, where I spent the internship of my PhD, I found that blue luminescence increased irreversibly when Zn-doped GaN was irradiated with electrons. I called this low-energy electron beam irradiation (LEEBI) treatment. However, even after LEEBI treatment, the Zn-doped samples did not show p-type conduction. In 1989, I became a Research Associate of Akasaki laboratory before completing my PhD. When I read the book \"Bonds and Bands in Semiconductors\" written by J. C. Phillips, I found that Mg is a better acceptor impurity than Zn in GaP. Then, myself and Mr. Kito, a master's student, started to investigate the Mg doping of GaN. We found that grown Mg-doped GaN showed high resistivity, but after LEEBI treatment, it showed distinct p-type conduction. We also succeeded in fabricating the world's first pn-junction-type UV/blue LED. In 1991 Nichia Chemicals team led by Dr. Nakamura found that p-type GaN could be grown by simple thermal annealing, which became the de fact standard method for the growth of p-type GaN. In 1992, I moved to the School of Science and Technology, Meijo University, to work with Professor Akasaki, where I became an Assistant Professor. In 1998 and 2002, I became an Associate Professor and a Professor, respectively. In 2010, I moved to the Engineering Department, Nagoya University, where I continued to work as a Professor. I have been Director of Akasaki Research Center, Nagoya University, since 2011. I was awarded several honors such as the IEEE/LEOS Engineering Achievement Award in 1996; the Rank Prize, Rank Prize Foundation, UK, in 1998; the Marubun Academic Award, Marubun Research Promotion Foundation, Japan, in 2002; the Takeda  Award,  Takeda  Foundation, Japan, in 2002; the   Japanese Association for Crystal Growth JACG Award, Japan, in 2008; the NISTEP Award, National Institute of Science and Technology Policy, Japan, in 2009; the Order of Culture from the Japanese Emperor in 2014; and the Nobel Prize in Physics, Nobel Foundation, Sweden, in 2014. I have been a fellow of the Japan Society of Applied Physics (JSAP) since 2009 and a fellow of the Institute of Physics (IOP), UK, since 2011. I am also a member of several academic organizations. Selected activities include Sub Chair of the Program Committee of the International Symposium on Compound Semiconductors in 2007, Program Committee Chair of the Second International Symposium on the Growth of Nitride semiconductors in 2010, Program Committee Chair of the Third International Symposium on Growth of Nitride Semiconductors in 2012, and Organizing Committee Chair of the International Workshop on Nitride Semiconductors in 2012.   From The Nobel Prizes 2014. Published on behalf of The Nobel Foundation by Science History Publications/USA, division Watson Publishing International LLC, Sagamore Beach, 2015 This autobiography/biography was written at the time of the award and later published in the book series Les Prix Nobel/ Nobel Lectures/The Nobel Prizes. The information is sometimes updated with an addendum submitted by the Laureate.", "title": "Hiroshi Amano - Biographical"}, "timeline": {}, "affiliations": [{"city": "Nagoya", "name": "Nagoya University", "country": "Japan"}], "gender": "male", "death_date": "", "diedCountryCode": "", "prize_title": "The Nobel Prize in Physics 2014", "birth_date": "1960-09-11", "co_winners": "Isamu Akasaki, Hiroshi Amano, Shuji Nakamura", "contribution": null}